//-----------------------------------------------------------------------------
// File : MoveBehavior.cpp
// Desc : Move Behavior.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "MoveBehavior.h"
#include "Player.h"


///////////////////////////////////////////////////////////////////////////////
// OneWayMoveBehaivor class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      直線的な移動処理です.
//-----------------------------------------------------------------------------
void OneWayMoveBehavior::OnTick(Enemy& entity)
{
    auto pos = entity.GetCenter();
    pos += m_Param.Velocity;
    entity.SetCenter(pos);
}


///////////////////////////////////////////////////////////////////////////////
// WaveMoveBehavior class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      波状の移動処理です.
//-----------------------------------------------------------------------------
void WaveMoveBehavior::OnTick(Enemy& entity)
{
    auto pos = entity.GetCenter();
    float cx;
    if (entity.GetTimer() == 0)
    {
        asdx::Vector4 param = entity.GetParam();
        param.z = pos.x;
        entity.SetParam(param);
        cx = pos.x;
    }
    else
    {
        const auto& param = entity.GetParam();
        cx = param.z;
    }

    auto timer = int(ceil(asdx::F_2PI / m_Param.AngleScale));
    timer = entity.GetTimer() % timer;

    pos.x = m_Param.Amplitude * sinf(m_Param.AngleScale * timer + m_Param.AngleOffset) + cx;
    pos.y += m_Param.Speed;

    entity.SetCenter(pos);
}


///////////////////////////////////////////////////////////////////////////////
// CircleMoveBehavior class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      円状の移動処理です.
//-----------------------------------------------------------------------------
void CircleMoveBehavior::OnTick(Enemy& entity)
{
    auto pos = entity.GetCenter();

}


///////////////////////////////////////////////////////////////////////////////
// AinminMoveBehavior class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      追跡移動します.
//-----------------------------------------------------------------------------
void AimingMoveBehavior::OnTick(Enemy& entity)
{
    auto pos = entity.GetCenter();

}
