//-----------------------------------------------------------------------------
// File : Entity.cpp
// Desc : Entity.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "Entity.h"
#include "SpriteData.h"
#include <gfx/asdxSprite.h>


///////////////////////////////////////////////////////////////////////////////
// Entity class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
Entity::Entity()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
Entity::Entity(uint16_t kind, float x, float y, bool center)
: m_Kind(kind)
{
    if (center)
    {
        const auto& data = GetSpriteData(SpriteKind(kind));
        m_Pos.x = x - data.W * 0.5f;
        m_Pos.y = y - data.H * 0.5f;
    }
    else
    {
        m_Pos.x = x;
        m_Pos.y = y;
    }
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
Entity::Entity(uint16_t kind, const asdx::Vector2& pos, bool center)
: m_Kind(kind)
{
    if (center)
    {
        const auto& data = GetSpriteData(SpriteKind(kind));
        m_Pos.x = pos.x - data.W * 0.5f;
        m_Pos.y = pos.y - data.H * 0.5f;
    }
    else
    {
        m_Pos = pos;
    }
}

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
Entity::~Entity()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      スプライト種別を設定します.
//-----------------------------------------------------------------------------
void Entity::SetKind(uint16_t value)
{ m_Kind = value; }

//-----------------------------------------------------------------------------
//      位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetPos(const asdx::Vector2& value)
{ m_Pos = value; }

//-----------------------------------------------------------------------------
//      位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetPos(float x, float y)
{
    m_Pos.x = x;
    m_Pos.y = y;
}

//-----------------------------------------------------------------------------
//      位置座標のX成分を設定します.
//-----------------------------------------------------------------------------
void Entity::SetPosX(float value)
{ m_Pos.x = value; }

//-----------------------------------------------------------------------------
//      位置座標のY成分を設定します.
//-----------------------------------------------------------------------------
void Entity::SetPosY(float value)
{ m_Pos.y = value; }

//-----------------------------------------------------------------------------
//      指定された点が中心になるように位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetCenter(const asdx::Vector2& value)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    m_Pos.x = value.x - data.W * 0.5f;
    m_Pos.y = value.y - data.H * 0.5f;
}

//-----------------------------------------------------------------------------
//      指定された点が中心になるように位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetCenter(float x, float y)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    m_Pos.x = x - data.W * 0.5f;
    m_Pos.y = y - data.H * 0.5f;
}

//-----------------------------------------------------------------------------
//      指定された点がX方向の中心になるように位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetCenterX(float value)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    m_Pos.x = value - data.W * 0.5f;
}

//-----------------------------------------------------------------------------
//      指定された点がY方向の中心になるように位置座標を設定します.
//-----------------------------------------------------------------------------
void Entity::SetCenterY(float value)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    m_Pos.y = value - data.H * 0.5f;
}

//-----------------------------------------------------------------------------
//      スプライト種別を取得します.
//-----------------------------------------------------------------------------
uint16_t Entity::GetKind() const
{ return m_Kind; }

//-----------------------------------------------------------------------------
//      位置座標を設定します.
//-----------------------------------------------------------------------------
const asdx::Vector2& Entity::GetPos() const
{ return m_Pos; }

//-----------------------------------------------------------------------------
//      位置座標のX成分を取得します.
//-----------------------------------------------------------------------------
float Entity::GetPosX() const
{ return m_Pos.x; }

//-----------------------------------------------------------------------------
//      位置座標のY成分を取得します.
//-----------------------------------------------------------------------------
float Entity::GetPosY() const
{ return m_Pos.y; }

//-----------------------------------------------------------------------------
//      中心座標を取得します.
//-----------------------------------------------------------------------------
asdx::Vector2 Entity::GetCenter() const
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    asdx::Vector2 result;
    result.x = m_Pos.x + data.W * 0.5f;
    result.y = m_Pos.y + data.H * 0.5f;
    return result;
}

//-----------------------------------------------------------------------------
//      中心座標のX成分を取得します.
//-----------------------------------------------------------------------------
float Entity::GetCenterX() const
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    return m_Pos.x + data.W * 0.5f;
}

//-----------------------------------------------------------------------------
//      中心座標のY成分を取得します.
//-----------------------------------------------------------------------------
float Entity::GetCenterY() const
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    return m_Pos.y + data.H * 0.5f;
}

//-----------------------------------------------------------------------------
//      スプライトサイズを取得します.
//-----------------------------------------------------------------------------
asdx::Int2 Entity::GetSize() const
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    return asdx::Int2(data.W, data.H);
}

//-----------------------------------------------------------------------------
//      スプライトを描画します.
//-----------------------------------------------------------------------------
void Entity::Draw(asdx::SpriteRenderer& renderer)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    renderer.Add(int(m_Pos.x), int(m_Pos.y), data.W, data.H, data.uv0, data.uv1);
}

//-----------------------------------------------------------------------------
//      交差判定を行います.
//-----------------------------------------------------------------------------
bool Entity::IsHit(const asdx::Vector2& pos, const asdx::Int2& size) const
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    return !((m_Pos.x + float(data.W)) <= pos.x || (pos.x + float(size.x)) <= m_Pos.x ||
             (m_Pos.y + float(data.H)) <= pos.y || (pos.y + float(size.y)) <= m_Pos.y);
}

//-----------------------------------------------------------------------------
//      交差判定を行います.
//-----------------------------------------------------------------------------
bool Entity::IsHit(const Entity& target) const
{ return IsHit(target.GetPos(), target.GetSize()); }

//-----------------------------------------------------------------------------
//      画面外かどうか判定します.
//-----------------------------------------------------------------------------
bool Entity::IsOutOfScreen(uint32_t w, uint32_t h)
{
    const auto& data = GetSpriteData(SpriteKind(m_Kind));
    return ((m_Pos.x + float(data.W)) < 0 || m_Pos.x > float(w)
         || (m_Pos.y + float(data.H)) < 0 || m_Pos.y > float(h));
}