//-----------------------------------------------------------------------------
// File : Player.cpp
// Desc : Player Entity.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "Player.h"
#include "SpriteData.h"
#include "Bullet.h"


namespace {

//-----------------------------------------------------------------------------
// Constants.
//-----------------------------------------------------------------------------
constexpr uint8_t kDefaultLife      = 3;        //!< 残機数のデフォルト値.
constexpr float   kDefaultMoveSpeed = 3.0f;     //!< プレイヤー移動速度のデフォルト値.
constexpr float   kShotSpeed        = 25.0f;

constexpr asdx::PAD_BUTTON kShotButton = asdx::PAD_B;

} // namespace


///////////////////////////////////////////////////////////////////////////////
// Player class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
Player::Player()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      デストラクタです.
//-----------------------------------------------------------------------------
Player::~Player()
{ Term(); }

//-----------------------------------------------------------------------------
//      初期化処理を行います.
//-----------------------------------------------------------------------------
void Player::Init(uint32_t playerIndex, uint16_t kind, float px, float py)
{
    m_Pad.SetPlayerIndex(playerIndex);
    SetKind(kind);
    SetPos(px, py);

    m_Life      = kDefaultLife;
    m_MoveSpeed = kDefaultMoveSpeed;
    m_PadLock   = true;
}

//-----------------------------------------------------------------------------
//      終了処理を行います.
//-----------------------------------------------------------------------------
void Player::Term()
{
    m_PadLock = true;
    m_Life    = 0;
}

//-----------------------------------------------------------------------------
//      更新処理を行います.
//-----------------------------------------------------------------------------
void Player::Update(uint32_t w, uint32_t h)
{
    asdx::Vector2 pos = GetPos();
    auto& data = GetSpriteData(SpriteKind(GetKind()));
    auto center = asdx::Vector2(pos.x + data.W * 0.5f, pos.y + data.H * 0.5f);

    // パッド更新.
    m_Pad.UpdateState();

    if (!m_PadLock)
    {
        // パッド操作による移動.
        pos.x += m_MoveSpeed * m_Pad.GetNormalizedThumbLX();
        pos.y -= m_MoveSpeed * m_Pad.GetNormalizedThumbLY();

        center = asdx::Vector2(pos.x + data.W * 0.5f, pos.y + data.H * 0.5f);

        if (m_Pad.IsDown(kShotButton))
        {
            auto& shotData = GetSpriteData(LASER_BLUE01);
            auto x = center.x - float(shotData.W) * 0.5f;
            auto y = pos.y    + float(shotData.H);

            // 真上方向に撃つ.
            GetPlayerBulletMgr().Spwan(LASER_BLUE01, x, y, -90.0f, 0.0f, kShotSpeed, 0.0f);
        }
    }

    pos = asdx::Vector2::Clamp(pos, asdx::Vector2(0.0f, 0.0f), asdx::Vector2(float(w - data.W), float(h - data.H)));
    SetPos(pos);
}

//-----------------------------------------------------------------------------
//      ゲームパッドを取得します.
//-----------------------------------------------------------------------------
const asdx::GamePad& Player::GetPad() const
{ return m_Pad; }

//-----------------------------------------------------------------------------
//      パッド操作をロックします.
//-----------------------------------------------------------------------------
void Player::SetPadLock(bool value)
{ m_PadLock = value; }

//-----------------------------------------------------------------------------
//      パッド操作がロックされているかどうかチェックします.
//-----------------------------------------------------------------------------
bool Player::IsPadLock() const
{ return m_PadLock; }

//-----------------------------------------------------------------------------
//      残機数を設定します.
//-----------------------------------------------------------------------------
void Player::SetLife(uint8_t value)
{ m_Life = value; }

//-----------------------------------------------------------------------------
//      残機数を取得します.
//-----------------------------------------------------------------------------
uint8_t Player::GetLife() const
{ return m_Life; }

