//-----------------------------------------------------------------------------
// File : asdxChunkAllocator.h
// Desc : Chunk Allocator.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <cassert>
#include <cstring>
#include <new>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// ChunkAllocator class
///////////////////////////////////////////////////////////////////////////////
class ChunkAllocator
{
    // ※ do-while 構文を使用してメモリを確保してください.

    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // pubilc methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ChunkAllocator() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ChunkAllocator()
    {
        assert(m_Buffer == nullptr);
        assert(m_Size   == 0);
        assert(m_Offset == 0);
    }

    //-------------------------------------------------------------------------
    //! @brief      確保処理を行います.
    //! 
    //! @param[in]      size        確保サイズ.
    //! @param[in]      alignment   メモリアライメント.
    //! @return     AllocChunk() が呼び出し後は, 確保メモリへのポインタを返却します.
    //!             AllocChunk() が呼び出し前は，nullptr を返却します.
    //-------------------------------------------------------------------------
    void* Alloc(size_t size, size_t alignment = 4)
    {
        auto addSize = (size + (alignment - 1)) & ~(alignment - 1);
        if (m_Buffer == nullptr)
        {
            m_Size += addSize;
            return nullptr;
        }
        else
        {
            auto ptr  = m_Buffer + m_Offset;
            m_Offset += addSize;
            assert(m_Offset <= m_Size);
            return ptr;
        }
    }

    //-------------------------------------------------------------------------
    //! @brief      new演算子を利用した確保処理を行います.
    //! 
    //! @param[in]      count       確保数.
    //! @return     AllocChunk() が呼び出し後は, 確保メモリへのポインタを返却します.
    //!             AllocChunk() が呼び出し前は，nullptr を返却します.
    //-------------------------------------------------------------------------
    template<typename T>
    T* New(size_t count = 1)
    {
        auto buf = reinterpret_cast<T*>(Alloc(sizeof(T) * count, alignof(T)));
        auto mem = buf;
        for(size_t i=0; i<count; ++i)
        {
            new (mem) T;
            mem++;
        }
        return buf;
    }

    //-------------------------------------------------------------------------
    //! @brief      メモリをまるっと確保します.
    //! 
    //! @return     最初の呼び出しでは true を返却し, 2回目以降は false を返却します.
    //-------------------------------------------------------------------------
    bool AllocChunk()
    {
        assert(m_Size != 0);
        if (m_Buffer != nullptr)
            return false;

        m_Offset = 0;
        m_Buffer = new uint8_t [m_Size];
        memset(m_Buffer, 0, m_Size);
        return true;
    }

    //-------------------------------------------------------------------------
    //! @brief      メモリをまるっと解放します.
    //-------------------------------------------------------------------------
    void FreeChunk()
    {
        if (m_Buffer)
        {
            delete[] m_Buffer;
            m_Buffer = nullptr;
        }
        m_Size   = 0;
        m_Offset = 0;
    }

    //-------------------------------------------------------------------------
    //! @brief      確保サイズを取得します.
    //! 
    //! @return     確保サイズを返却します.
    //-------------------------------------------------------------------------
    size_t GetSize() const 
    { return m_Size; }

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    size_t      m_Size   = 0;       //!< 確保サイズ.
    size_t      m_Offset = 0;       //!< メモリオフセット.
    uint8_t*    m_Buffer = nullptr; //!< 確保メモリ.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
