//-----------------------------------------------------------------------------
// File : SampleApp.h
// Desc : Sample Application.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

// サウンドを有効かする場合は 1 に.
#define ASDX_ENABLE_SOUND (0)

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxMacro.h>
#include <fw/asdxApp.h>
#include <fw/asdxAppCamera.h>
#include <gfx/asdxCommandQueue.h>
#include <gfx/asdxTextureManager.h>
#include <gfx/asdxSprite.h>
#include <gfx/asdxSampler.h>
#include <gfx/asdxColorEffect.h>
#include <gfx/asdxTarget.h>

#if ASDX_ENABLE_SOUND
#include <fw/asdxSound.h>
#endif

#define USE_COMPUTE_SHADER (1)

///////////////////////////////////////////////////////////////////////////////
// SampleApp class
///////////////////////////////////////////////////////////////////////////////
class SampleApp : public asdx::App
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================


    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    SampleApp();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~SampleApp();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    asdx::AppCamera         m_Camera;
    asdx::WaitPoint         m_FrameWaitPoint;
    asdx::TextureHolder     m_TextureBG;
    asdx::Sampler           m_LinearClamp;
    asdx::ColorEffect       m_ColorFilter;
    asdx::SpriteRenderer    m_SpriteRenderer;
#if USE_COMPUTE_SHADER
    asdx::ComputeTarget     m_FilterTarget;
#else
    asdx::ColorTarget       m_FilterTarget;
#endif

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      初期化時の処理です.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool OnInit() override;

    //-------------------------------------------------------------------------
    //! @brief      終了時の処理です.
    //-------------------------------------------------------------------------
    void OnTerm() override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム遷移時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnFrameMove(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム描画時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnFrameRender(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      リサイズ時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnResize(const asdx::App::ResizeEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      キー処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnKey(const asdx::App::KeyEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      マウス処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnMouse(const asdx::App::MouseEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      タイピング時の処理です.
    //! 
    //! @param[in]      keyCode     キーコードです.
    //-------------------------------------------------------------------------
    void OnTyping(uint32_t keyCode) override;

    //-------------------------------------------------------------------------
    //! @brief      メッセージプロシージャ時の処理です.
    //! 
    //! @param[in]
    //-------------------------------------------------------------------------
    void OnMsgProc(HWND hWnd, UINT msg, WPARAM wp, LPARAM lp) override;
};
