//-----------------------------------------------------------------------------
// File : asdxMath.inl
// Desc : Math Module.
// Copyright(c) Project Asura All right reserved.
//-----------------------------------------------------------------------------
#pragma once

namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// Functions
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      ラジアンに変換します.
//-----------------------------------------------------------------------------
inline constexpr float ToRadian(float degree) noexcept
{ return degree * (F_PI / 180.0f); }

//-----------------------------------------------------------------------------
//      ラジアンに変換します.
//-----------------------------------------------------------------------------
inline constexpr double ToRadian(double degree ) noexcept
{ return degree * (D_PI / 180.0); }

//-----------------------------------------------------------------------------
//      度に変換します.
//-----------------------------------------------------------------------------
inline constexpr float ToDegree(float radian ) noexcept
{ return radian * (180.0f / F_PI); }

//-----------------------------------------------------------------------------
//      度に変換します.
//-----------------------------------------------------------------------------
inline constexpr double ToDegree(double radian ) noexcept
{ return radian * (180.0 / D_PI); }

//-----------------------------------------------------------------------------
//      ゼロかどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsZero(float value) noexcept
{ return fabs(value) <= F_EPSILON; }

//-----------------------------------------------------------------------------
//      ゼロかどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsZero(double value) noexcept
{ return abs(value) <= D_EPSILON; }

//-----------------------------------------------------------------------------
//      値が等しいかどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsEqual(float value1, float value2) noexcept
{ return fabs(value1 - value2) <= F_EPSILON; }

//-----------------------------------------------------------------------------
//      値が等しいかどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsEqual(double value1, double value2) noexcept
{ return abs(value1 - value2) <= D_EPSILON; }

//-----------------------------------------------------------------------------
//      非数かどうかチェックします.
//-----------------------------------------------------------------------------
inline constexpr bool IsNaN(float value) noexcept
{ return (value != value); }

//-----------------------------------------------------------------------------
//      非数かどうかチェックします.
//-----------------------------------------------------------------------------
inline constexpr bool IsNaN(double value) noexcept
{ return (value != value); }

//-----------------------------------------------------------------------------
//      無限大かどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsInf(float value)
{
    // ビット列に変換して，指数部がすべて 1 かどうかチェック.
#if _HAS_CXX20
    auto u = std::bit_cast<uint32_t>(value);
#else
    uint32_t u = 0;
    memcpy(&u, &value, sizeof(u));
#endif
    return ((u & 0x7f800000) == 0x7f800000) && (value == value);
}

//-----------------------------------------------------------------------------
//      無限大かどうかチェックします.
//-----------------------------------------------------------------------------
inline bool IsInf(double value)
{
#if _HAS_CXX20
    auto l = std::bit_cast<uint64_t>(value);
#else
    uint32_t l = 0;
    memcpy(&l, &value, sizeof(l));
#endif
    return ((l & 0x7ff0000000000000) == 0x7ff0000000000000) && (value == value);
}

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline float Hypot(float x, float y)
{ return sqrtf(x * x + y * y ); }

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline float Hypot(float x, float y, float z)
{ return sqrtf(x * x + y * y + z * z ); }

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline float Hypot(float x, float y, float z, float w)
{ return sqrtf(x * x + y * y + z * z + w * w ); }

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline double Hypot(double x, double y)
{ return sqrt(x * x + y * y ); }

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline double Hypot(double x, double y, double z)
{ return sqrt(x * x + y * y + z * z ); }

//-----------------------------------------------------------------------------
//      平方和の平方根を求めます.
//-----------------------------------------------------------------------------
inline double Hypot(double x, double y, double z, double w )
{ return sqrt(x * x + y * y + z * z + w * w ); }

//-----------------------------------------------------------------------------
//      階乗計算します.
//-----------------------------------------------------------------------------
inline uint32_t Fact(uint32_t number)
{
    uint32_t result = 1;
    for(uint32_t i=1; i<=number; ++i )
    { result *= i; }
    return result;
}

//-----------------------------------------------------------------------------
//      2重階乗を計算します.
//-----------------------------------------------------------------------------
inline uint32_t DblFact(uint32_t number)
{
    uint32_t result = 1;
    uint32_t start = ((number % 2 ) == 0 ) ? 2 : 1;
    for(uint32_t i=start; i<=number; i+=2 )
    { result *= i; }
    return result;
}

//-----------------------------------------------------------------------------
//      順列を計算します.
//-----------------------------------------------------------------------------
inline uint32_t Perm(uint32_t n, uint32_t r)
{
    assert(n >= r);
    return Fact(n) / Fact(n - r);
}

//-----------------------------------------------------------------------------
//      組み合わせを計算します.
//-----------------------------------------------------------------------------
inline uint32_t Comb(uint32_t n, uint32_t r)
{
    assert(n >= r);
    return Fact(n) / (Fact(n - r) * Fact(r));
}

//-----------------------------------------------------------------------------
//      32bit 浮動小数から 16bit 浮動小数に変換します.
//-----------------------------------------------------------------------------
inline half ToHalf(float value)
{
    half result;

    // ビット列を崩さないままuint32_t型に変換.
#if _HAS_CXX20
    uint32_t bit = std::bit_cast<uint32_t>(value);
#else
    uint32_t bit;
    memcpy(&bit, &value, sizeof(bit));
#endif

    // float表現の符号bitを取り出し.
    uint16_t sign = (bit & 0x80000000U) >> 16U;

    // 符号部を削ぎ落す.
    bit = bit & 0x7FFFFFFFU;

    // halfとして表現する際に値がデカ過ぎる場合は，無限大にクランプ.
    if (bit > 0x47FFEFFFU)
    { result = 0x7FFFU; }
    else
    {
        // 正規化されたhalfとして表現するために小さすぎる値は正規化されていない値に変換.
        if (bit < 0x38800000U)
        {
            uint32_t shift = 113U - (bit >> 23U);
            bit = (0x800000U | (bit & 0x7FFFFFU)) >> shift;
        }
        else
        {
            // 正規化されたhalfとして表現するために指数部に再度バイアスをかける
            bit += 0xC8000000U;
        }

        // half型表現にする.
        result = ((bit + 0x0FFFU + ((bit >> 13U) & 1U)) >> 13U) & 0x7FFFU; 
    }

    // 符号部を付け足して返却.
    return static_cast<half>(result | sign);
}

//-----------------------------------------------------------------------------
//      16bit 浮動小数から　32bit 浮動小数に変換します.
//-----------------------------------------------------------------------------
inline float ToFloat(half value)
{
    uint32_t exponent;
    uint32_t result;

    // 仮数
    uint32_t mantissa = static_cast<uint32_t>(value & 0x03FF);

    // 正規化済みの場合.
    if ((value & 0x7C00 ) != 0 )
    {
        // 指数部を計算.
        exponent = static_cast<uint32_t>((value >> 10 ) & 0x1F);
    }
    // 正規化されていない場合.
    else if (mantissa != 0)
    {
        // 結果となるfloatで値を正規化する.
        exponent = 1;

        do {
            exponent--;
            mantissa <<= 1;
        } while ((mantissa & 0x0400 ) == 0);

        mantissa &= 0x03FF;
    }
    // 値がゼロの場合.
    else
    {
        // 指数部を計算.
        exponent = (uint32_t)-112;
    }

    result = ((value & 0x8000) << 16) | // 符号部.
             ((exponent + 112) << 23) | // 指数部.
             (mantissa << 13);           // 仮数部.

#if _HAS_CXX20
    return std::bit_cast<float>(result);
#else
    float out;
    memcpy(&out, &result, sizeof(out));
    return out;
#endif
}

//-----------------------------------------------------------------------------
//      線形補間を行います.
//-----------------------------------------------------------------------------
inline constexpr float Lerp(float a, float b, float amount) noexcept
{ return a + amount * (b - a); }

//-----------------------------------------------------------------------------
//      線形補間を行います.
//-----------------------------------------------------------------------------
inline constexpr double Lerp(double a, double b, double amount) noexcept
{ return a + amount * (b - a); }


///////////////////////////////////////////////////////////////////////////////
// Vector2 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector2::Vector2(const float* pf)
{
    assert(pf != nullptr);
    x = pf[0];
    y = pf[1];
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector2::Vector2(float value)
: x(value)
, y(value)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector2::Vector2(float nx, float ny)
: x(nx)
, y(ny)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      float*へのキャストです.
//-----------------------------------------------------------------------------
inline Vector2::operator float *()
{ return &x; }

//-----------------------------------------------------------------------------
//      const float*へのキャストです.
//-----------------------------------------------------------------------------
inline Vector2::operator const float *() const
{ return &x; }

//-----------------------------------------------------------------------------
//      加算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::operator += (const Vector2& v)
{
    x += v.x;
    y += v.y;
    return (*this);
}

//-----------------------------------------------------------------------------
//      減算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::operator -= (const Vector2& v)
{
    x -= v.x;
    y -= v.y;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::operator *= (float f)
{
    x *= f;
    y *= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      除算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::operator /= (float f)
{
    assert(!IsZero(f));
    x /= f;
    y /= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::operator = (const Vector2& v)
{
    x = v.x;
    y = v.y;
    return (*this);
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator + () const
{ return (*this); }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator - () const
{ return Vector2(-x, -y); }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator + (const Vector2& v) const
{ return Vector2(x + v.x, y + v.y); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator - (const Vector2& v) const
{ return Vector2(x - v.x, y - v.y); }

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator * (float f) const
{ return Vector2(x * f, y * f); }

//-----------------------------------------------------------------------------
//      除算演算子です.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::operator / (float f) const
{
    assert(!IsZero(f));
    return Vector2(x / f, y / f);
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector2 operator * (float f, const Vector2& v)
{ return Vector2(f * v.x, f * v.y); }

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector2::operator == (const Vector2& v) const
{
    return IsEqual(x, v.x)
        && IsEqual(y, v.y);
}

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector2::operator != (const Vector2& v) const
{
    return !IsEqual(x, v.x)
        || !IsEqual(y, v.y);
}

//-----------------------------------------------------------------------------
//      長さを求めます.
//-----------------------------------------------------------------------------
inline float Vector2::Length() const
{ return Hypot(x, y); }

//-----------------------------------------------------------------------------
//      長さの2乗を求めます.
//-----------------------------------------------------------------------------
inline float Vector2::LengthSq() const
{ return (x * x) + (y * y); }

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::Normalize()
{
    auto mag = Length();
    assert(mag > 0.0f);
    x /= mag;
    y /= mag;
    return (*this);
}

//-----------------------------------------------------------------------------
//      ゼロ除算を考慮して正規化を行います.
//-----------------------------------------------------------------------------
inline Vector2& Vector2::SafeNormalize(const Vector2& set)
{
    auto mag = Length();
    if (mag > 0.0f)
    {
        x /= mag;
        y /= mag;
        return (*this);
    }

    x = set.x;
    y = set.y;
    return (*this);
}


///////////////////////////////////////////////////////////////////////////////
// Vector2 Methods
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      各成分の絶対値を求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Abs(const Vector2& value)
{
    return Vector2(
        fabs(value.x),
        fabs(value.y) );
}

//-----------------------------------------------------------------------------
//      各成分の値を制限します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Clamp(const Vector2& v, const Vector2& mini, const Vector2& maxi)
{
    return Vector2(
        asdx::Clamp(v.x, mini.x, maxi.x),
        asdx::Clamp(v.y, mini.y, maxi.y) );
}

//-----------------------------------------------------------------------------
//      各成分の値を0～1に収めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Saturate(const Vector2& v)
{
    return Vector2(
        asdx::Saturate(v.x),
        asdx::Saturate(v.y) );
}

//-----------------------------------------------------------------------------
//      2点間距離を求めます.
//-----------------------------------------------------------------------------
inline float Vector2::Distance(const Vector2& lhs, const Vector2& rhs)
{
    return Hypot(
        rhs.x - lhs.x,
        rhs.y - lhs.y);
}

//-----------------------------------------------------------------------------
//      2点間距離の2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Vector2::DistanceSq(const Vector2& lhs, const Vector2& rhs)
{
    auto X = rhs.x - lhs.x;
    auto Y = rhs.y - lhs.y;
    return X * X + Y * Y;
}

//-----------------------------------------------------------------------------
//      内積を求めます.
//-----------------------------------------------------------------------------
inline float Vector2::Dot(const Vector2& lhs, const Vector2& rhs)
{ return (lhs.x * rhs.x) + (lhs.y * rhs.y); }

//-----------------------------------------------------------------------------
//      正規化します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Normalize(const Vector2& value)
{
    auto mag = value.Length();
    assert(mag > 0.0f);
    return Vector2(
        value.x / mag,
        value.y / mag );
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::SafeNormalize(const Vector2& value, const Vector2& set)
{
    auto mag = value.Length();
    if (mag > 0.0f)
    {
        return Vector2(
            value.x / mag,
            value.y / mag );
    }

    return set;
}

//-----------------------------------------------------------------------------
//      交差角を求めます.
//-----------------------------------------------------------------------------
inline float Vector2::ComputeCrossingAngle(const Vector2& lhs, const Vector2& rhs)
{
    auto d = lhs.Length() * rhs.Length();
    if (d <= 0.0f)
    { return 0.0f; }

    auto c = Vector2::Dot(lhs, rhs) / d;
    if (c >= 1.0f) 
    { return 0.0f; }

    if (c <= -1.0f)
    { return F_PI; }

    return acosf(c);
}

//-----------------------------------------------------------------------------
//      各成分の最小値を求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Min(const Vector2& lhs, const Vector2& rhs)
{ 
    return Vector2(
        asdx::Min(lhs.x, rhs.x),
        asdx::Min(lhs.y, rhs.y) );
}

//-----------------------------------------------------------------------------
//      各成分の最大値を求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Max(const Vector2& lhs, const Vector2& rhs)
{
    return Vector2(
        asdx::Max(lhs.x, rhs.x),
        asdx::Max(lhs.y, rhs.y) );
}

//-----------------------------------------------------------------------------
//      反射ベクトルを求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Reflect(const Vector2& i, const Vector2& n)
{
    auto dot = n.x * i.x + n.y * i.y;
    return Vector2(
        i.x - (2.0f * n.x) * dot,
        i.y - (2.0f * n.y) * dot );
}

//-----------------------------------------------------------------------------
//      屈折ベクトルを求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Refract(const Vector2& i, const Vector2& n, float eta)
{
    auto cosi   = (-i.x * n.x) + (-i.y * n.y);
    auto cost2  = 1.0f - eta * eta * (1.0f - cosi * cosi);
    auto sign   = Sign(cost2 );
    auto sqrtC2 = sqrtf(fabs(cost2 ) );
    auto coeff  = eta * cosi - sqrtC2;

    return Vector2(
        sign * (eta * i.x + coeff * n.x),
        sign * (eta * i.y + coeff * n.y) );
}

//-----------------------------------------------------------------------------
//      重心座標を求めます.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Barycentric
(
    const Vector2& p0,
    const Vector2& p1,
    const Vector2& p2,
    float          a,
    float          b
)
{
    return Vector2(
        p0.x + a * (p1.x - p0.x) + b * (p2.x - p0.x),
        p0.y + a * (p1.y - p0.y) + b * (p2.y - p0.y) );
}

//-----------------------------------------------------------------------------
//      エルミートスプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Hermite
(
    const Vector2&  a,
    const Vector2&  t1,
    const Vector2&  b,
    const Vector2&  t2,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    Vector2 result;
    if (amount <= 0.0f)
    {
        result.x = a.x;
        result.y = a.y;
    }
    else if (amount >= 1.0f)
    {
        result.x = b.x;
        result.y = b.y;
    }
    else
    {
        result.x = (2.0f * a.x - 2.0f * b.x + t2.x + t1.x) * c3 + (3.0f * b.x - 3.0f * a.x - 2.0f * t1.x - t2.x) * c3 + t1.x * amount + a.x;
        result.y = (2.0f * a.y - 2.0f * b.y + t2.y + t1.y) * c3 + (3.0f * b.y - 3.0f * a.y - 2.0f * t1.y - t2.y) * c3 + t1.y * amount + a.y;
    }
    return result;
}

//-----------------------------------------------------------------------------
//      Catmull-Rom スプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::CatmullRom
(
    const Vector2&  a,
    const Vector2&  b,
    const Vector2&  c,
    const Vector2&  d,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    return Vector2(
        (0.5f * (2.0f * b.x + (c.x - a.x) * amount + (2.0f * a.x - 5.0f * b.x + 4.0f * c.x - d.x) * c2 + (3.0f * b.x - a.x - 3.0f * c.x + d.x) * c3)),
        (0.5f * (2.0f * b.y + (c.y - a.y) * amount + (2.0f * a.y - 5.0f * b.y + 4.0f * c.y - d.y) * c2 + (3.0f * b.y - a.y - 3.0f * c.y + d.y) * c3)) );
}

//-----------------------------------------------------------------------------
//      線形補間を行います.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Lerp(const Vector2& a, const Vector2& b, float amount)
{
    return Vector2(
        a.x + amount * (b.x - a.x),
        a.y + amount * (b.y - a.y) );
}

//-----------------------------------------------------------------------------
//      3次方程式を用いて，2つの値の間を補間します
//-----------------------------------------------------------------------------
inline Vector2 Vector2::SmoothStep(const Vector2& a, const Vector2& b, float amount)
{
    auto s = asdx::Clamp(amount, 0.0f, 1.0f);
    auto u = (s * s) + (3.0f - (2.0f * s));
    return Vector2(
        a.x + u * (b.x - a.x),
        a.y + u * (b.y - a.y) );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いて，ベクトルを変換します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::Transform(const Vector2& position, const Matrix& matrix)
{
    return Vector2(
        (position.x * matrix._11) + (position.y * matrix._21) + matrix._41,
        (position.x * matrix._12) + (position.y * matrix._22) + matrix._42 );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いて，法線ベクトルを変換します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::TransformNormal(const Vector2& normal, const Matrix& matrix)
{
    return Vector2(
        (normal.x * matrix._11) + (normal.y * matrix._21),
        (normal.x * matrix._12) + (normal.y * matrix._22) );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いてベクトルを変換し，変換結果をw=1に射影します.
//-----------------------------------------------------------------------------
inline Vector2 Vector2::TransformCoord(const Vector2& coords, const Matrix& matrix)
{
    auto X = (coords.x * matrix._11) + (coords.y * matrix._21) + matrix._41;
    auto Y = (coords.x * matrix._12) + (coords.y * matrix._22) + matrix._42;
    auto W = (coords.x * matrix._14) + (coords.y * matrix._24) + matrix._44;
    return Vector2(
        X / W,
        Y / W );
}

///////////////////////////////////////////////////////////////////////////////
// Vector3 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector3::Vector3(const float* pf)
{
    assert(pf != nullptr);
    x = pf[0];
    y = pf[1];
    z = pf[2];
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector3::Vector3(float scalar)
: x(scalar)
, y(scalar)
, z(scalar)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector3::Vector3(const Vector2& value, float nz)
: x(value.x)
, y(value.y)
, z(nz)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector3::Vector3(float nx, float ny, float nz)
: x(nx)
, y(ny)
, z(nz)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Vector3::operator float *()
{ return &x; }

//-----------------------------------------------------------------------------
//      const float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Vector3::operator const float *() const
{ return &x; }

//-----------------------------------------------------------------------------
//      加算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::operator += (const Vector3& v)
{
    x += v.x;
    y += v.y;
    z += v.z;
    return (*this);
}

//-----------------------------------------------------------------------------
//      減算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::operator -= (const Vector3& v)
{
    x -= v.x;
    y -= v.y;
    z -= v.z;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::operator *= (float f)
{
    x *= f;
    y *= f;
    z *= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      除算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::operator /= (float f)
{
    assert(!IsZero(f));
    x /= f;
    y /= f;
    z /= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::operator = (const Vector3& v)
{
    x = v.x;
    y = v.y;
    z = v.z;
    return (*this);
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator + () const
{ return (*this); }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator - () const
{ return Vector3(-x, -y, -z); }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator + (const Vector3& v) const
{ return Vector3(x + v.x, y + v.y, z + v.z); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator - (const Vector3& v) const
{ return Vector3(x - v.x, y - v.y, z - v.z); }

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator * (float f) const
{ return Vector3(x * f, y * f, z * f); }

//-----------------------------------------------------------------------------
//      除算演算子です.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::operator / (float f) const
{
    assert(!IsZero(f));
    return Vector3(x / f, y / f, z / f);
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector3 operator * (float f, const Vector3& v)
{ return Vector3(f * v.x, f * v.y, f * v.z); }

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector3::operator == (const Vector3& v) const
{
    return IsEqual(x, v.x)
        && IsEqual(y, v.y)
        && IsEqual(z, v.z);
}

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector3::operator != (const Vector3& v) const
{ 
    return !IsEqual(x, v.x)
        || !IsEqual(y, v.y)
        || !IsEqual(z, v.z);
}

//-----------------------------------------------------------------------------
//      ベクトルの大きさを求めます.
//-----------------------------------------------------------------------------
inline float Vector3::Length() const
{ return Hypot(x, y, z); }

//-----------------------------------------------------------------------------
//      ベクトルの大きさの2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::LengthSq() const
{ return (x * x) + (y * y) + (z * z); }

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::Normalize()
{
    auto mag = Length();
    assert(mag > 0.0f);
    x /= mag;
    y /= mag;
    z /= mag;
    return (*this);
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化します.
//-----------------------------------------------------------------------------
inline Vector3& Vector3::SafeNormalize(const Vector3& set)
{
    auto mag = Length();
    if (mag > 0.0f)
    {
        x /= mag;
        y /= mag;
        z /= mag;
        return (*this);
    }

    x = set.x;
    y = set.y;
    z = set.z;
    return (*this);
}


///////////////////////////////////////////////////////////////////////////////
// Vector3 methods
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      各成分の絶対値を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Abs(const Vector3& value)
{ 
    return Vector3(
        fabs(value.x),
        fabs(value.y),
        fabs(value.z) );
}

//-----------------------------------------------------------------------------
//      各成分の値を制限します.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Clamp(const Vector3& value, const Vector3& mini, const Vector3& maxi)
{
    return Vector3(
        asdx::Clamp(value.x, mini.x, maxi.x),
        asdx::Clamp(value.y, mini.y, maxi.y),
        asdx::Clamp(value.z, mini.z, maxi.z) );
}

//-----------------------------------------------------------------------------
//      各成分の値を0～1に収めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Saturate(const Vector3& value)
{
    return Vector3(
        asdx::Saturate(value.x),
        asdx::Saturate(value.y),
        asdx::Saturate(value.z) );
}

//-----------------------------------------------------------------------------
//      2点間距離を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::Distance(const Vector3& lhs, const Vector3& rhs)
{
    return Hypot(
        rhs.x - lhs.x,
        rhs.y - lhs.y,
        rhs.z - lhs.z );
}

//-----------------------------------------------------------------------------
//      2点間距離の2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::DistanceSq(const Vector3& lhs, const Vector3& rhs)
{
    auto X = rhs.x - lhs.x;
    auto Y = rhs.y - lhs.y;
    auto Z = rhs.z - lhs.z;
    return X * X + Y * Y + Z * Z;
}

//-----------------------------------------------------------------------------
//      内積を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::Dot(const Vector3& lhs, const Vector3& rhs)
{ return (lhs.x * rhs.x) + (lhs.y * rhs.y) + (lhs.z * rhs.z); }

//-----------------------------------------------------------------------------
//      外積を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Cross(const Vector3& lhs, const Vector3& rhs)
{
    return Vector3(
        (lhs.y * rhs.z) - (lhs.z * rhs.y),
        (lhs.z * rhs.x) - (lhs.x * rhs.z),
        (lhs.x * rhs.y) - (lhs.y * rhs.x) );
}

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Normalize(const Vector3& value)
{
    auto mag = value.Length();
    assert(mag > 0.0f);
    return Vector3(
        value.x / mag,
        value.y / mag,
        value.z / mag);
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化を行います.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::SafeNormalize(const Vector3& value, const Vector3& set)
{
    auto mag = value.Length();
    if (mag > 0.0f)
    {
        return Vector3(
            value.x / mag,
            value.y / mag,
            value.z / mag);
    }

    return set;
}

//-----------------------------------------------------------------------------
//      三角形の面法線を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::ComputeNormal(const Vector3& p1, const Vector3& p2, const Vector3& p3)
{
    auto v1 = p2 - p1;
    auto v2 = p3 - p1;
    auto result = Vector3::Cross(v1, v2);
    return result.Normalize();
}

//-----------------------------------------------------------------------------
//      四角形の面法線を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::ComputeQuadNormal
(
    const Vector3& p1,
    const Vector3& p2,
    const Vector3& p3,
    const Vector3& p4
)
{
    Vector3 result;
    auto n1a = Vector3::ComputeNormal(p1, p2, p3);
    auto n1b = Vector3::ComputeNormal(p1, p3, p4);
    auto n2a = Vector3::ComputeNormal(p2, p3, p4);
    auto n2b = Vector3::ComputeNormal(p2, p4, p1);
    if (Vector3::Dot(n1a, n1b) > Vector3::Dot(n2a, n2b))
    {
        result = n1a + n1b;
        result.Normalize();
    }
    else
    {
        result = n2a + n2b;
        result.Normalize();
    }
    return result;
}

//-----------------------------------------------------------------------------
//      交差角を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::ComputeCrossingAngle(const Vector3& lhs, const Vector3& rhs)
{
    auto d = lhs.Length() * rhs.Length();
    if (d <= 0.0f)
    { return 0.0f; }

    auto c = Vector3::Dot(lhs, rhs) / d;
    if (c >= 1.0f)
    { return 0.0f; }

    if (c <= -1.0f)
    { return F_PI; }

    return acosf(c);
}

//-----------------------------------------------------------------------------
//      各成分の最小値を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Min(const Vector3& lhs, const Vector3& rhs)
{ 
    return Vector3(
        asdx::Min(lhs.x, rhs.x),
        asdx::Min(lhs.y, rhs.y),
        asdx::Min(lhs.z, rhs.z) );
}

//-----------------------------------------------------------------------------
//      各成分の最大値を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Max(const Vector3& lhs, const Vector3& rhs)
{
    return Vector3(
        asdx::Max(lhs.x, rhs.x),
        asdx::Max(lhs.y, rhs.y),
        asdx::Max(lhs.z, rhs.z) );
}

//-----------------------------------------------------------------------------
//      反射ベクトルを求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Reflect(const Vector3& i, const Vector3& n)
{
    auto dot = n.x * i.x + n.y * i.y + n.z * i.z;
    return Vector3(
        i.x - (2.0f * n.x) * dot,
        i.y - (2.0f * n.y) * dot,
        i.z - (2.0f * n.z) * dot );
}

//-----------------------------------------------------------------------------
//      屈折ベクトルを求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Refract(const Vector3& i, const Vector3& n, float eta)
{
    auto cosi   = (-i.x * n.x ) + (-i.y * n.y ) + (-i.z * n.z );
    auto cost2  = 1.0f - eta * eta * (1.0f - cosi * cosi );
    auto sign   = Sign(cost2 );
    auto sqrtC2 = sqrtf(fabs(cost2 ) );
    auto coeff  = eta * cosi - sqrtC2;

    return Vector3(
        sign * (eta * i.x + coeff * n.x),
        sign * (eta * i.y + coeff * n.y),
        sign * (eta * i.z + coeff * n.z) );
}

//-----------------------------------------------------------------------------
//      重心座標を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Barycentric
(
    const Vector3&  p0,
    const Vector3&  p1,
    const Vector3&  p2,
    float           a,
    float           b
)
{
    return Vector3(
        p0.x + a * (p1.x - p0.x) + b * (p2.x - p0.x),
        p0.y + a * (p1.y - p0.y) + b * (p2.y - p0.y),
        p0.z + a * (p1.z - p0.z) + b * (p2.z - p0.z) );
}

//-----------------------------------------------------------------------------
//      エルミートスプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Hermite
(
    const Vector3&  a,
    const Vector3&  t1,
    const Vector3&  b,
    const Vector3&  t2,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    Vector3 result;
    if (amount <= 0.0f )
    {
        result.x = a.x;
        result.y = a.y;
        result.z = a.z;
    }
    else if (amount >= 1.0f )
    {
        result.x = b.x;
        result.y = b.y;
        result.z = b.z;
    }
    else
    {
        result.x = (2.0f * a.x - 2.0f * b.x + t2.x + t1.x) * c3 + (3.0f * b.x - 3.0f * a.x - 2.0f * t1.x - t2.x) * c3 + t1.x * amount + a.x;
        result.y = (2.0f * a.y - 2.0f * b.y + t2.y + t1.y) * c3 + (3.0f * b.y - 3.0f * a.y - 2.0f * t1.y - t2.y) * c3 + t1.y * amount + a.y;
        result.z = (2.0f * a.z - 2.0f * b.z + t2.z + t1.z) * c3 + (3.0f * b.z - 3.0f * a.z - 2.0f * t1.z - t2.z) * c3 + t1.y * amount + a.z;
    }
    return result;
}

//-----------------------------------------------------------------------------
//      Catmull-Rom スプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::CatmullRom
(
    const Vector3&  a,
    const Vector3&  b,
    const Vector3&  c,
    const Vector3&  d,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    return Vector3(
        (0.5f * (2.0f * b.x + (c.x - a.x) * amount + (2.0f * a.x - 5.0f * b.x + 4.0f * c.x - d.x) * c2 + (3.0f * b.x - a.x - 3.0f * c.x + d.x) * c3)),
        (0.5f * (2.0f * b.y + (c.y - a.y) * amount + (2.0f * a.y - 5.0f * b.y + 4.0f * c.y - d.y) * c2 + (3.0f * b.y - a.y - 3.0f * c.y + d.y) * c3)),
        (0.5f * (2.0f * b.z + (c.z - a.z) * amount + (2.0f * a.z - 5.0f * b.z + 4.0f * c.z - d.z) * c2 + (3.0f * b.z - a.z - 3.0f * c.z + d.z) * c3)) );
}

//-----------------------------------------------------------------------------
//      線形補間を行います.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Lerp(const Vector3& a, const Vector3& b, float amount)
{
    return Vector3(
        a.x + amount * (b.x - a.x),
        a.y + amount * (b.y - a.y),
        a.z + amount * (b.z - a.z));
}

//-----------------------------------------------------------------------------
//      3次方程式を用いて，２つの値を補間します.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::SmoothStep(const Vector3& a, const Vector3& b, float amount)
{
    auto s = asdx::Clamp(amount, 0.0f, 1.0f);
    auto u = (s * s) + (3.0f - (2.0f * s));
    return Vector3(
        a.x + u * (b.x - a.x),
        a.y + u * (b.y - a.y),
        a.z + u * (b.z - a.z) );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いて，ベクトルを変換します.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Transform(const Vector3& position, const Matrix& matrix)
{
    return Vector3(
        (position.x * matrix._11) + (position.y * matrix._21) + (position.z * matrix._31) + matrix._41,
        (position.x * matrix._12) + (position.y * matrix._22) + (position.z * matrix._32) + matrix._42,
        (position.x * matrix._13) + (position.y * matrix._23) + (position.z * matrix._33) + matrix._43 );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いて，法線ベクトルを変換します.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::TransformNormal(const Vector3& normal, const Matrix& matrix)
{
    return Vector3(
        (normal.x * matrix._11) + (normal.y * matrix._21) + (normal.z * matrix._31),
        (normal.x * matrix._12) + (normal.y * matrix._22) + (normal.z * matrix._32),
        (normal.x * matrix._13) + (normal.y * matrix._23) + (normal.z * matrix._33) );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いてベクトルを変換し，変換結果をw=1に射影します.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::TransformCoord(const Vector3& coords, const Matrix& matrix)
{
    auto X = (coords.x * matrix._11) + (coords.y * matrix._21) + (coords.z * matrix._31) + matrix._41;
    auto Y = (coords.x * matrix._12) + (coords.y * matrix._22) + (coords.z * matrix._32) + matrix._42;
    auto Z = (coords.x * matrix._13) + (coords.y * matrix._23) + (coords.z * matrix._33) + matrix._43;
    auto W = (coords.x * matrix._14) + (coords.y * matrix._24) + (coords.z * matrix._34) + matrix._44;
    return Vector3(
        X / W,
        Y / W,
        Z / W );
}

//-----------------------------------------------------------------------------
//      スカラー3重積を求めます.
//-----------------------------------------------------------------------------
inline float Vector3::ScalarTriple(const Vector3& a, const Vector3& b, const Vector3& c)
{
    auto crossX = (b.y * c.z) - (b.z * c.y);
    auto crossY = (b.z * c.x) - (b.x * c.z);
    auto crossZ = (b.x * c.y) - (b.y * c.x);

    return (a.x * crossX) + (a.y * crossY) + (a.z * crossZ);
}

//-----------------------------------------------------------------------------
//      ベクトル3重積を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::VectorTriple(const Vector3& a, const Vector3& b, const Vector3& c)
{
    auto crossX = (b.y * c.z) - (b.z * c.y);
    auto crossY = (b.z * c.x) - (b.x * c.z);
    auto crossZ = (b.x * c.y) - (b.y * c.x);

    return Vector3(
        (a.y * crossZ) - (a.z * crossY),
        (a.z * crossX) - (a.x * crossZ),
        (a.x * crossY) - (a.y * crossX) );
}

//-----------------------------------------------------------------------------
//      四元数でベクトルを回転させます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::Rotate(const Vector3& value, const Quaternion& rotation)
{
    auto a = Quaternion(value.x, value.y, value.z, 0.0f);
    auto q = Quaternion::Conjugate(rotation);
    auto r = Quaternion::Multiply(q, a);
    r = Quaternion::Multiply(r, rotation);
    return Vector3(r.x, r.y, r.z);
}

//-----------------------------------------------------------------------------
//      四元数でベクトルを逆回転させます.
//-----------------------------------------------------------------------------
inline Vector3 Vector3::InverseRotate(const Vector3& value, const Quaternion& rotation)
{
    auto a = Quaternion(value.x, value.y, value.z, 0.0f);
    auto r = Quaternion::Multiply(rotation, a);
    auto q = Quaternion::Conjugate(rotation);
    r = Quaternion::Multiply(r, q);
    return Vector3(r.x, r.y, r.z);
}


///////////////////////////////////////////////////////////////////////////////
// Vector4 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector4::Vector4(const float* pf)
{
    assert(pf != nullptr);
    x = pf[0];
    y = pf[1];
    z = pf[2];
    w = pf[3];
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector4::Vector4(float scalar)
: x(scalar)
, y(scalar)
, z(scalar)
, w(scalar)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector4::Vector4(const Vector2& value, float nz, float nw)
: x(value.x)
, y(value.y)
, z(nz)
, w(nw)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector4::Vector4(const Vector3& value, float nw)
: x(value.x)
, y(value.y)
, z(value.z)
, w(nw)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Vector4::Vector4(float nx, float ny, float nz, float nw)
: x(nx)
, y(ny)
, z(nz)
, w(nw)
{ /* DO_NTOHING */ }

//-----------------------------------------------------------------------------
//      float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Vector4::operator float *()
{ return &x; }

//-----------------------------------------------------------------------------
//      const float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Vector4::operator const float *() const
{ return &x; }

//-----------------------------------------------------------------------------
//      加算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::operator += (const Vector4& v)
{
    x += v.x;
    y += v.y;
    z += v.z;
    w += v.w;
    return (*this);
}

//-----------------------------------------------------------------------------
//      減算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::operator -= (const Vector4& v)
{
    x -= v.x;
    y -= v.y;
    z -= v.z;
    w -= v.w;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::operator *= (float f)
{
    x *= f;
    y *= f;
    z *= f;
    w *= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      除算代入演算子です.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::operator /= (float f)
{
    assert(!IsZero(f));
    x /= f;
    y /= f;
    z /= f;
    w /= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::operator = (const Vector4& v)
{
    x = v.x;
    y = v.y;
    z = v.z;
    w = v.w;
    return (*this);
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator + () const
{ return (*this); }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator - () const
{ return Vector4(-x, -y, -z, -w); }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator + (const Vector4& v) const
{ return Vector4(x + v.x, y + v.y, z + v.z, w + v.w); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator - (const Vector4& v) const
{ return Vector4(x - v.x, y - v.y, z - v.z, w - v.w); }

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator * (float f) const
{ return Vector4(x * f, y * f, z * f, w * f); }

//-----------------------------------------------------------------------------
//      除算演算子です.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::operator / (float f) const
{
    assert(!IsZero(f));
    return Vector4(x / f, y / f, z / f, w / f);
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Vector4 operator * (float f, const Vector4& v)
{ return Vector4(f * v.x, f * v.y, f * v.z, f * v.w ); }

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector4::operator == (const Vector4& v) const
{
    return IsEqual(x, v.x)
        && IsEqual(y, v.y)
        && IsEqual(z, v.z)
        && IsEqual(w, v.z);
}

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Vector4::operator != (const Vector4& v) const
{ 
    return !IsEqual(x, v.x)
        || !IsEqual(y, v.y)
        || !IsEqual(z, v.z)
        || !IsEqual(w, v.w);
}

//-----------------------------------------------------------------------------
//      ベクトルの大きさを求めます.
//-----------------------------------------------------------------------------
inline float Vector4::Length() const
{ return Hypot(x, y, z, w); }

//-----------------------------------------------------------------------------
//      ベクトルの大きさの2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Vector4::LengthSq() const
{ return (x * x) + (y * y) + (z * z) + (w * w); }

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::Normalize()
{
    auto mag = Length();
    assert(mag > 0.0f);
    x /= mag;
    y /= mag;
    z /= mag;
    w /= mag;
    return (*this);
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化を行います.
//-----------------------------------------------------------------------------
inline Vector4& Vector4::SafeNormalize(const Vector4& set)
{
    auto mag = Length();
    if (mag > 0.0f)
    {
        x /= mag;
        y /= mag;
        z /= mag;
        w /= mag;
    }
    else
    {
        x = set.x;
        y = set.y;
        z = set.z;
        w = set.w;
    }

    return (*this);
}


///////////////////////////////////////////////////////////////////////////////
// Vector4  Methods
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      各成分の絶対値を求めます.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Abs(const Vector4& value)
{ 
    return Vector4(
        fabs(value.x),
        fabs(value.y),
        fabs(value.z),
        fabs(value.w) );
}

//-----------------------------------------------------------------------------
//      値を指定された範囲内に制限します.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Clamp(const Vector4& value, const Vector4& a, const Vector4& b)
{
    return Vector4(
        asdx::Clamp(value.x, a.x, b.x),
        asdx::Clamp(value.y, a.y, b.y),
        asdx::Clamp(value.z, a.z, b.z),
        asdx::Clamp(value.w, a.w, b.w) );
}

//-----------------------------------------------------------------------------
//      指定された値を0～1の範囲に制限します.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Saturate(const Vector4& value)
{
    return Vector4(
        asdx::Saturate(value.x),
        asdx::Saturate(value.y),
        asdx::Saturate(value.z),
        asdx::Saturate(value.w) );
}

//-----------------------------------------------------------------------------
//      2点間距離を求めます.
//-----------------------------------------------------------------------------
inline float Vector4::Distance(const Vector4& lhs, const Vector4& rhs)
{
    return Hypot(
        rhs.x - lhs.x,
        rhs.y - lhs.y,
        rhs.z - lhs.z,
        rhs.w - lhs.w );
}

//-----------------------------------------------------------------------------
//      2点間距離の2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Vector4::DistanceSq(const Vector4& lhs, const Vector4& rhs)
{
    auto X = rhs.x - lhs.x;
    auto Y = rhs.y - lhs.y;
    auto Z = rhs.z - lhs.z;
    auto W = rhs.w - lhs.w;
    return (X * X) + (Y * Y) + (Z * Z) + (W * W);
}

//-----------------------------------------------------------------------------
//      内積を求めます.
//-----------------------------------------------------------------------------
inline float Vector4::Dot(const Vector4& lhs, const Vector4& rhs)
{ return (lhs.x * rhs.x) + (lhs.y * rhs.y) + (lhs.z * rhs.z) + (lhs.w * rhs.w); }

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Normalize(const Vector4& value)
{
    auto mag = value.Length();
    assert(mag > 0.0f);
    return Vector4(
        value.x / mag,
        value.y / mag,
        value.z / mag,
        value.w / mag );
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化を行います.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::SafeNormalize(const Vector4& value, const Vector4& set)
{
    auto mag = value.Length();
    if (mag > 0.0f)
    {
        return Vector4(
            value.x / mag,
            value.y / mag,
            value.z / mag,
            value.w / mag );
    }

    return set;
}

//-----------------------------------------------------------------------------
//      交差角を求めます.
//-----------------------------------------------------------------------------
inline float Vector4::ComputeCrossingAngle(const Vector4& lhs, const Vector4& rhs)
{
    auto d = lhs.Length() * rhs.Length();
    if (d <= 0.0f)
    { return 0.0f; }

    auto c = Vector4::Dot(lhs, rhs) / d;
    if (c >= 1.0f)
    { return 0.0f; }

    if (c <= -1.0f)
    { return F_PI; }

    return acosf(c);
}

//-----------------------------------------------------------------------------
//      各成分の最小値を求めます.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Min(const Vector4& lhs, const Vector4& rhs)
{ 
    return Vector4(
        asdx::Min(lhs.x, rhs.x),
        asdx::Min(lhs.y, rhs.y),
        asdx::Min(lhs.z, rhs.z),
        asdx::Min(lhs.w, rhs.w) );
}

//-----------------------------------------------------------------------------
//      各成分の最大値を求めます.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Max(const Vector4& lhs, const Vector4& rhs)
{
    return Vector4(
        asdx::Max(lhs.x, rhs.x),
        asdx::Max(lhs.y, rhs.y),
        asdx::Max(lhs.z, rhs.z),
        asdx::Max(lhs.w, rhs.w) );
}

//-----------------------------------------------------------------------------
//      重心座標を求めます.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Barycentric
(
    const Vector4&  p0,
    const Vector4&  p1,
    const Vector4&  p2,
    float           a,
    float           b
)
{
    return Vector4(
        p0.x + a * (p1.x - p0.x) + b * (p2.x - p0.x),
        p0.y + a * (p1.y - p0.y) + b * (p2.y - p0.y),
        p0.z + a * (p1.z - p0.z) + b * (p2.z - p0.z),
        p0.w + a * (p1.w - p0.w) + b * (p2.w - p0.w) );
}

//-----------------------------------------------------------------------------
//      エルミートスプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Hermite
(
    const Vector4&  a,
    const Vector4&  t1,
    const Vector4&  b,
    const Vector4&  t2,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    Vector4 result;
    if (amount <= 0.0f )
    {
        result.x = a.x;
        result.y = a.y;
        result.z = a.z;
        result.w = a.w;
    }
    else if (amount >= 1.0f )
    {
        result.x = b.x;
        result.y = b.y;
        result.z = b.z;
        result.w = b.w;
    }
    else
    {
        result.x = (2.0f * a.x - 2.0f * b.x + t2.x + t1.x) * c3 + (3.0f * b.x - 3.0f * a.x - 2.0f * t1.x - t2.x) * c3 + t1.x * amount + a.x;
        result.y = (2.0f * a.y - 2.0f * b.y + t2.y + t1.y) * c3 + (3.0f * b.y - 3.0f * a.y - 2.0f * t1.y - t2.y) * c3 + t1.y * amount + a.y;
        result.z = (2.0f * a.z - 2.0f * b.z + t2.z + t1.z) * c3 + (3.0f * b.z - 3.0f * a.z - 2.0f * t1.z - t2.z) * c3 + t1.y * amount + a.z;
        result.w = (2.0f * a.w - 2.0f * b.w + t2.w + t1.w) * c3 + (3.0f * b.w - 3.0f * a.w - 2.0f * t1.w - t2.w) * c3 + t1.w * amount + a.w;
    }
    return result;
}

//-----------------------------------------------------------------------------
//      Catmull-Rom スプライン補間を行います.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::CatmullRom
(
    const Vector4&  a,
    const Vector4&  b,
    const Vector4&  c,
    const Vector4&  d,
    float           amount
)
{
    auto c2 = amount * amount;
    auto c3 = c2 * amount;

    return Vector4(
        (0.5f * (2.0f * b.x + (c.x - a.x) * amount + (2.0f * a.x - 5.0f * b.x + 4.0f * c.x - d.x) * c2 + (3.0f * b.x - a.x - 3.0f * c.x + d.x) * c3)),
        (0.5f * (2.0f * b.y + (c.y - a.y) * amount + (2.0f * a.y - 5.0f * b.y + 4.0f * c.y - d.y) * c2 + (3.0f * b.y - a.y - 3.0f * c.y + d.y) * c3)),
        (0.5f * (2.0f * b.z + (c.z - a.z) * amount + (2.0f * a.z - 5.0f * b.z + 4.0f * c.z - d.z) * c2 + (3.0f * b.z - a.z - 3.0f * c.z + d.z) * c3)),
        (0.5f * (2.0f * b.w + (c.w - a.w) * amount + (2.0f * a.w - 5.0f * b.w + 4.0f * c.w - d.w) * c2 + (3.0f * b.w - a.w - 3.0f * c.w + d.w) * c3)) );
}

//-----------------------------------------------------------------------------
//      線形補間を行います.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Lerp(const Vector4& a, const Vector4& b, float amount)
{
    return Vector4(
        a.x + amount * (b.x - a.x),
        a.y + amount * (b.y - a.y),
        a.z + amount * (b.z - a.z),
        a.w + amount * (b.w - a.w) );
}

//-----------------------------------------------------------------------------
//      3次方程式を用いて，2つの値の間を補間します.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::SmoothStep(const Vector4& a, const Vector4& b, float amount)
{
    auto s = asdx::Clamp(amount, 0.0f, 1.0f );
    auto u = (s * s) + (3.0f - (2.0f * s));
    return Vector4(
        a.x + u * (b.x - a.x),
        a.y + u * (b.y - a.y),
        a.z + u * (b.z - a.z),
        a.w + u * (b.w - a.w) );
}

//-----------------------------------------------------------------------------
//      指定された行列を用いて，ベクトルを変換します.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::Transform(const Vector4& position, const Matrix& matrix)
{
    return Vector4(
        (position.x * matrix._11) + (position.y * matrix._21) + (position.z * matrix._31) + (position.w * matrix._41),
        (position.x * matrix._12) + (position.y * matrix._22) + (position.z * matrix._32) + (position.w * matrix._42),
        (position.x * matrix._13) + (position.y * matrix._23) + (position.z * matrix._33) + (position.w * matrix._43),
        (position.x * matrix._14) + (position.y * matrix._24) + (position.z * matrix._34) + (position.w * matrix._44) );
}

//-----------------------------------------------------------------------------
//      平面式を正規化します.
//-----------------------------------------------------------------------------
inline Vector4 Vector4::NormalizePlane(const Vector4& value)
{
    auto mag = sqrt(value.x * value.x + value.y * value.y + value.z * value.z);
    return Vector4(value.x / mag, value.y / mag, value.z / mag, value.w / mag);
}


///////////////////////////////////////////////////////////////////////////////
// Matrix structure (row-major)
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline Matrix::Matrix()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Matrix::Matrix(const float* pf)
{
    assert(pf != nullptr);
    memcpy(&_11, pf, sizeof(Matrix));
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Matrix::Matrix
(
    float _f11, float _f12, float _f13, float _f14,
    float _f21, float _f22, float _f23, float _f24,
    float _f31, float _f32, float _f33, float _f34,
    float _f41, float _f42, float _f43, float _f44 
)
{
    _11 = _f11; _12 = _f12; _13 = _f13; _14 = _f14;
    _21 = _f21; _22 = _f22; _23 = _f23; _24 = _f24;
    _31 = _f31; _32 = _f32; _33 = _f33; _34 = _f34;
    _41 = _f41; _42 = _f42; _43 = _f43; _44 = _f44;
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Matrix::Matrix(const Vector4& v1, const Vector4& v2, const Vector4& v3, const Vector4& v4)
{
    _11 = v1.x; _12 = v1.y; _13 = v1.z; _14 = v1.z;
    _21 = v2.x; _22 = v2.y; _23 = v2.z; _24 = v2.z;
    _31 = v3.x; _32 = v3.y; _33 = v3.z; _34 = v3.z;
    _41 = v4.x; _42 = v4.y; _43 = v4.z; _44 = v4.z;
}

//-----------------------------------------------------------------------------
//      インデクサです.
//-----------------------------------------------------------------------------
inline float& Matrix::operator () (uint32_t row, uint32_t col)
{ return m[row][col]; }

//-----------------------------------------------------------------------------
//      インデクサです(const版).
//-----------------------------------------------------------------------------
inline const float& Matrix::operator () (uint32_t row, uint32_t col) const
{ return m[row][col]; }

//-----------------------------------------------------------------------------
//      float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Matrix::operator float* ()
{ return &_11; }

//-----------------------------------------------------------------------------
//      const float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Matrix::operator const float* () const 
{ return &_11; }

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator *= (const Matrix &value)
{
    auto m11 = (_11 * value._11) + (_12 * value._21) + (_13 * value._31) + (_14 * value._41);
    auto m12 = (_11 * value._12) + (_12 * value._22) + (_13 * value._32) + (_14 * value._42);
    auto m13 = (_11 * value._13) + (_12 * value._23) + (_13 * value._33) + (_14 * value._43);
    auto m14 = (_11 * value._14) + (_12 * value._24) + (_13 * value._34) + (_14 * value._44);

    auto m21 = (_21 * value._11) + (_22 * value._21) + (_23 * value._31) + (_24 * value._41);
    auto m22 = (_21 * value._12) + (_22 * value._22) + (_23 * value._32) + (_24 * value._42);
    auto m23 = (_21 * value._13) + (_22 * value._23) + (_23 * value._33) + (_24 * value._43);
    auto m24 = (_21 * value._14) + (_22 * value._24) + (_23 * value._34) + (_24 * value._44);

    auto m31 = (_31 * value._11) + (_32 * value._21) + (_33 * value._31) + (_34 * value._41);
    auto m32 = (_31 * value._12) + (_32 * value._22) + (_33 * value._32) + (_34 * value._42);
    auto m33 = (_31 * value._13) + (_32 * value._23) + (_33 * value._33) + (_34 * value._43);
    auto m34 = (_31 * value._14) + (_32 * value._24) + (_33 * value._34) + (_34 * value._44);

    auto m41 = (_41 * value._11) + (_42 * value._21) + (_43 * value._31) + (_44 * value._41);
    auto m42 = (_41 * value._12) + (_42 * value._22) + (_43 * value._32) + (_44 * value._42);
    auto m43 = (_41 * value._13) + (_42 * value._23) + (_43 * value._33) + (_44 * value._43);
    auto m44 = (_41 * value._14) + (_42 * value._24) + (_43 * value._34) + (_44 * value._44);

    _11 = m11;  _12 = m12;  _13 = m13;  _14 = m14;
    _21 = m21;  _22 = m22;  _23 = m23;  _24 = m24;
    _31 = m31;  _32 = m32;  _33 = m33;  _34 = m34;
    _41 = m41;  _42 = m42;  _43 = m43;  _44 = m44;

    return (*this);
}

//-----------------------------------------------------------------------------
//      加算代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator += (const Matrix& mat)
{
    _11 += mat._11; _12 += mat._12; _13 += mat._13; _14 += mat._14;
    _21 += mat._21; _22 += mat._22; _23 += mat._23; _24 += mat._24;
    _31 += mat._31; _32 += mat._32; _33 += mat._33; _34 += mat._34;
    _41 += mat._41; _42 += mat._42; _43 += mat._43; _44 += mat._44;
    return (*this);
}

//-----------------------------------------------------------------------------
//      減算代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator -= (const Matrix& mat)
{
    _11 -= mat._11; _12 -= mat._12; _13 -= mat._13; _14 -= mat._14;
    _21 -= mat._21; _22 -= mat._22; _23 -= mat._23; _24 -= mat._24;
    _31 -= mat._31; _32 -= mat._32; _33 -= mat._33; _34 -= mat._34;
    _41 -= mat._41; _42 -= mat._42; _43 -= mat._43; _44 -= mat._44;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator *= (float f)
{
    _11 *= f; _12 *= f; _13 *= f; _14 *= f;
    _21 *= f; _22 *= f; _23 *= f; _24 *= f;
    _31 *= f; _32 *= f; _33 *= f; _34 *= f;
    _41 *= f; _42 *= f; _43 *= f; _44 *= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      除算代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator /= (float f)
{
    assert(!IsZero(f));
    _11 /= f; _12 /= f; _13 /= f; _14 /= f;
    _21 /= f; _22 /= f; _23 /= f; _24 /= f;
    _31 /= f; _32 /= f; _33 /= f; _34 /= f;
    _41 /= f; _42 /= f; _43 /= f; _44 /= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::operator = (const Matrix& value)
{
    memcpy(&_11, &value._11, sizeof(Matrix));
    return (*this);
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator + () const
{ return (*this); }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator - () const
{
    return Matrix(
        -_11, -_12, -_13, -_14,
        -_21, -_22, -_23, -_24,
        -_31, -_32, -_33, -_34,
        -_41, -_42, -_43, -_44 );
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator * (const Matrix& value) const
{
    return Matrix(
        (_11 * value._11) + (_12 * value._21) + (_13 * value._31) + (_14 * value._41),
        (_11 * value._12) + (_12 * value._22) + (_13 * value._32) + (_14 * value._42),
        (_11 * value._13) + (_12 * value._23) + (_13 * value._33) + (_14 * value._43),
        (_11 * value._14) + (_12 * value._24) + (_13 * value._34) + (_14 * value._44),

        (_21 * value._11) + (_22 * value._21) + (_23 * value._31) + (_24 * value._41),
        (_21 * value._12) + (_22 * value._22) + (_23 * value._32) + (_24 * value._42),
        (_21 * value._13) + (_22 * value._23) + (_23 * value._33) + (_24 * value._43),
        (_21 * value._14) + (_22 * value._24) + (_23 * value._34) + (_24 * value._44),

        (_31 * value._11) + (_32 * value._21) + (_33 * value._31) + (_34 * value._41),
        (_31 * value._12) + (_32 * value._22) + (_33 * value._32) + (_34 * value._42),
        (_31 * value._13) + (_32 * value._23) + (_33 * value._33) + (_34 * value._43),
        (_31 * value._14) + (_32 * value._24) + (_33 * value._34) + (_34 * value._44),

        (_41 * value._11) + (_42 * value._21) + (_43 * value._31) + (_44 * value._41),
        (_41 * value._12) + (_42 * value._22) + (_43 * value._32) + (_44 * value._42),
        (_41 * value._13) + (_42 * value._23) + (_43 * value._33) + (_44 * value._43),
        (_41 * value._14) + (_42 * value._24) + (_43 * value._34) + (_44 * value._44) );
}

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator + (const Matrix& mat) const
{
    return Matrix(
        _11 + mat._11, _12 + mat._12, _13 + mat._13, _14 + mat._14,
        _21 + mat._21, _22 + mat._22, _23 + mat._23, _24 + mat._24,
        _31 + mat._31, _32 + mat._32, _33 + mat._33, _34 + mat._34,
        _41 + mat._41, _42 + mat._42, _43 + mat._43, _44 + mat._44 );
}

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator - (const Matrix& mat) const
{
    return Matrix(
        _11 - mat._11, _12 - mat._12, _13 - mat._13, _14 - mat._14,
        _21 - mat._21, _22 - mat._22, _23 - mat._23, _24 - mat._24,
        _31 - mat._31, _32 - mat._32, _33 - mat._33, _34 - mat._34,
        _41 - mat._41, _42 - mat._42, _43 - mat._43, _44 - mat._44 );
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator * (float f) const
{
    return Matrix(
        _11 * f, _12 * f, _13 * f, _14 * f,
        _21 * f, _22 * f, _23 * f, _24 * f,
        _31 * f, _32 * f, _33 * f, _34 * f,
        _41 * f, _42 * f, _43 * f, _44 * f );
}

//-----------------------------------------------------------------------------
//      除算演算子です.
//-----------------------------------------------------------------------------
inline Matrix Matrix::operator / (float f) const
{
    assert(!IsZero(f));
    return Matrix(
        _11 / f, _12 / f, _13 / f, _14 / f,
        _21 / f, _22 / f, _23 / f, _24 / f,
        _31 / f, _32 / f, _33 / f, _34 / f,
        _41 / f, _42 / f, _43 / f, _44 / f);
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Matrix operator * (float f, const Matrix& mat)
{
    return Matrix(
        f * mat._11, f * mat._12, f * mat._13, f * mat._14,
        f * mat._21, f * mat._22, f * mat._23, f * mat._24,
        f * mat._31, f * mat._32, f * mat._33, f * mat._34,
        f * mat._41, f * mat._42, f * mat._43, f * mat._44 );
}

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Matrix::operator == (const Matrix& mat) const
{ return (0 == memcmp(this, &mat, sizeof(Matrix))); }

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Matrix::operator != (const Matrix& mat) const
{ return (0 != memcmp(this, &mat, sizeof(Matrix))); }

//-----------------------------------------------------------------------------
//      行列式を求めます.
//-----------------------------------------------------------------------------
inline float Matrix::Determinant() const
{
    return
        _11 * _22 * _33 * _44 + _11 * _23 * _34 * _42 +
        _11 * _24 * _32 * _43 + _12 * _21 * _34 * _43 +
        _12 * _23 * _31 * _44 + _12 * _24 * _33 * _41 +
        _13 * _21 * _32 * _44 + _13 * _22 * _34 * _41 +
        _13 * _24 * _31 * _42 + _14 * _21 * _33 * _42 +
        _14 * _22 * _31 * _43 + _14 * _23 * _32 * _41 -
        _11 * _22 * _34 * _43 - _11 * _23 * _32 * _44 -
        _11 * _24 * _33 * _42 - _12 * _21 * _33 * _44 -
        _12 * _23 * _34 * _41 - _12 * _24 * _31 * _43 -
        _13 * _21 * _34 * _42 - _13 * _22 * _31 * _44 -
        _13 * _24 * _32 * _41 - _14 * _21 * _32 * _43 -
        _14 * _22 * _33 * _41 - _14 * _23 * _31 * _42;
}

//-----------------------------------------------------------------------------
//      単位行列化します.
//-----------------------------------------------------------------------------
inline Matrix& Matrix::Identity()
{
    _11 = _22 = _33 = _44 = 1.0f;
    _12 = _13 = _14 =
    _21 = _23 = _24 =
    _31 = _32 = _34 =
    _41 = _42 = _43 = 0.0f;
    return (*this);
}

//----------------------------------------------------------------------------
//      基底Xベクトルを取得します.
//----------------------------------------------------------------------------
inline Vector3 Matrix::GetBasisX() const
{ return Vector3(_11, _21, _31); }

//----------------------------------------------------------------------------
//      基底Yベクトルを取得します.
//----------------------------------------------------------------------------
inline Vector3 Matrix::GetBasisY() const
{ return Vector3(_12, _22, _32); }

//----------------------------------------------------------------------------
//      基底Zベクトルを取得します.
//----------------------------------------------------------------------------
inline Vector3 Matrix::GetBasisZ() const
{ return Vector3(_13, _23, _33); }

//-----------------------------------------------------------------------------
//      スケール成分を求めます.
//-----------------------------------------------------------------------------
inline Vector3 Matrix::CalcScale() const
{
    auto x = GetBasisX().Length();
    auto y = GetBasisY().Length();
    auto z = GetBasisZ().Length();
    return Vector3(x, y, z);
}


///////////////////////////////////////////////////////////////////////////////
// Matrix Methods (row-major)
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      単位行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateIdentity()
{
    return Matrix(
        1.0f, 0.0f, 0.0f, 0.0f,
        0.0f, 1.0f, 0.0f, 0.0f,
        0.0f, 0.0f, 1.0f, 0.0f,
        0.0f, 0.0f, 0.0f, 1.0f );
}

//-----------------------------------------------------------------------------
//      単位行列かどうかチェックします.
//-----------------------------------------------------------------------------
inline bool Matrix::IsIdentity(const Matrix &value)
{
    return (
           IsEqual(value.m[0][0], 1.0f)
        && IsEqual(value.m[0][1], 0.0f) 
        && IsEqual(value.m[0][2], 0.0f)
        && IsEqual(value.m[0][3], 0.0f)

        && IsEqual(value.m[1][0], 0.0f)
        && IsEqual(value.m[1][1], 1.0f)
        && IsEqual(value.m[1][2], 0.0f)
        && IsEqual(value.m[1][3], 0.0f)

        && IsEqual(value.m[2][0], 0.0f)
        && IsEqual(value.m[2][1], 0.0f)
        && IsEqual(value.m[2][2], 1.0f)
        && IsEqual(value.m[2][3], 0.0f)

        && IsEqual(value.m[3][0], 0.0f)
        && IsEqual(value.m[3][1], 0.0f)
        && IsEqual(value.m[3][2], 0.0f)
        && IsEqual(value.m[3][3], 1.0f) );
}

//-----------------------------------------------------------------------------
//      行列を転置します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::Transpose(const Matrix& value)
{
    return Matrix(
        value._11, value._21, value._31, value._41,
        value._12, value._22, value._32, value._42,
        value._13, value._23, value._33, value._43,
        value._14, value._24, value._34, value._44 );
}

//-----------------------------------------------------------------------------
//      行列同士を乗算します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::Multiply(const Matrix& lhs, const Matrix& rhs)
{
    return Matrix(
        (lhs._11 * rhs._11) + (lhs._12 * rhs._21) + (lhs._13 * rhs._31) + (lhs._14 * rhs._41),
        (lhs._11 * rhs._12) + (lhs._12 * rhs._22) + (lhs._13 * rhs._32) + (lhs._14 * rhs._42),
        (lhs._11 * rhs._13) + (lhs._12 * rhs._23) + (lhs._13 * rhs._33) + (lhs._14 * rhs._43),
        (lhs._11 * rhs._14) + (lhs._12 * rhs._24) + (lhs._13 * rhs._34) + (lhs._14 * rhs._44),

        (lhs._21 * rhs._11) + (lhs._22 * rhs._21) + (lhs._23 * rhs._31) + (lhs._24 * rhs._41),
        (lhs._21 * rhs._12) + (lhs._22 * rhs._22) + (lhs._23 * rhs._32) + (lhs._24 * rhs._42),
        (lhs._21 * rhs._13) + (lhs._22 * rhs._23) + (lhs._23 * rhs._33) + (lhs._24 * rhs._43),
        (lhs._21 * rhs._14) + (lhs._22 * rhs._24) + (lhs._23 * rhs._34) + (lhs._24 * rhs._44),

        (lhs._31 * rhs._11) + (lhs._32 * rhs._21) + (lhs._33 * rhs._31) + (lhs._34 * rhs._41),
        (lhs._31 * rhs._12) + (lhs._32 * rhs._22) + (lhs._33 * rhs._32) + (lhs._34 * rhs._42),
        (lhs._31 * rhs._13) + (lhs._32 * rhs._23) + (lhs._33 * rhs._33) + (lhs._34 * rhs._43),
        (lhs._31 * rhs._14) + (lhs._32 * rhs._24) + (lhs._33 * rhs._34) + (lhs._34 * rhs._44),

        (lhs._41 * rhs._11) + (lhs._42 * rhs._21) + (lhs._43 * rhs._31) + (lhs._44 * rhs._41),
        (lhs._41 * rhs._12) + (lhs._42 * rhs._22) + (lhs._43 * rhs._32) + (lhs._44 * rhs._42),
        (lhs._41 * rhs._13) + (lhs._42 * rhs._23) + (lhs._43 * rhs._33) + (lhs._44 * rhs._43),
        (lhs._41 * rhs._14) + (lhs._42 * rhs._24) + (lhs._43 * rhs._34) + (lhs._44 * rhs._44) );
}


//-----------------------------------------------------------------------------
//      スカラー乗算します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::Multiply(const Matrix& value, float scaleFactor)
{
    return Matrix(
        value._11 * scaleFactor, value._12 * scaleFactor, value._13 * scaleFactor, value._14 * scaleFactor,
        value._21 * scaleFactor, value._22 * scaleFactor, value._23 * scaleFactor, value._24 * scaleFactor,
        value._31 * scaleFactor, value._32 * scaleFactor, value._33 * scaleFactor, value._34 * scaleFactor,
        value._41 * scaleFactor, value._42 * scaleFactor, value._43 * scaleFactor, value._44 * scaleFactor );
}

//-----------------------------------------------------------------------------
//      行列同士を乗算し，乗算結果を転置します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::MultiplyTranspose(const Matrix& lhs, const Matrix& rhs)
{
    return Matrix(
        (lhs._11 * rhs._11) + (lhs._12 * rhs._21) + (lhs._13 * rhs._31) + (lhs._14 * rhs._41),
        (lhs._21 * rhs._11) + (lhs._22 * rhs._21) + (lhs._23 * rhs._31) + (lhs._24 * rhs._41),
        (lhs._31 * rhs._11) + (lhs._32 * rhs._21) + (lhs._33 * rhs._31) + (lhs._34 * rhs._41),
        (lhs._41 * rhs._11) + (lhs._42 * rhs._21) + (lhs._43 * rhs._31) + (lhs._44 * rhs._41),

        (lhs._11 * rhs._12) + (lhs._12 * rhs._22) + (lhs._13 * rhs._32) + (lhs._14 * rhs._42),
        (lhs._21 * rhs._12) + (lhs._22 * rhs._22) + (lhs._23 * rhs._32) + (lhs._24 * rhs._42),
        (lhs._31 * rhs._12) + (lhs._32 * rhs._22) + (lhs._33 * rhs._32) + (lhs._34 * rhs._42),
        (lhs._41 * rhs._12) + (lhs._42 * rhs._22) + (lhs._43 * rhs._32) + (lhs._44 * rhs._42),

        (lhs._11 * rhs._13) + (lhs._12 * rhs._23) + (lhs._13 * rhs._33) + (lhs._14 * rhs._43),
        (lhs._21 * rhs._13) + (lhs._22 * rhs._23) + (lhs._23 * rhs._33) + (lhs._24 * rhs._43),
        (lhs._31 * rhs._13) + (lhs._32 * rhs._23) + (lhs._33 * rhs._33) + (lhs._34 * rhs._43),
        (lhs._41 * rhs._13) + (lhs._42 * rhs._23) + (lhs._43 * rhs._33) + (lhs._44 * rhs._43),

        (lhs._11 * rhs._14) + (lhs._12 * rhs._24) + (lhs._13 * rhs._34) + (lhs._14 * rhs._44),
        (lhs._21 * rhs._14) + (lhs._22 * rhs._24) + (lhs._23 * rhs._34) + (lhs._24 * rhs._44),
        (lhs._31 * rhs._14) + (lhs._32 * rhs._24) + (lhs._33 * rhs._34) + (lhs._34 * rhs._44),
        (lhs._41 * rhs._14) + (lhs._42 * rhs._24) + (lhs._43 * rhs._34) + (lhs._44 * rhs._44) );
}

//-----------------------------------------------------------------------------
//      逆行列を求めます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::Invert(const Matrix& value)
{
    auto det = value.Determinant();
    assert(!IsZero(det));

    auto m11 = value._22*value._33*value._44 + value._23*value._34*value._42 + value._24*value._32*value._43 - value._22*value._34*value._43 - value._23*value._32*value._44 - value._24*value._33*value._42;
    auto m12 = value._12*value._34*value._43 + value._13*value._32*value._44 + value._14*value._33*value._42 - value._12*value._33*value._44 - value._13*value._34*value._42 - value._14*value._32*value._43;
    auto m13 = value._12*value._23*value._44 + value._13*value._24*value._42 + value._14*value._22*value._43 - value._12*value._24*value._43 - value._13*value._22*value._44 - value._14*value._23*value._42;
    auto m14 = value._12*value._24*value._33 + value._13*value._22*value._34 + value._14*value._23*value._32 - value._12*value._23*value._34 - value._13*value._24*value._32 - value._14*value._22*value._33;

    auto m21 = value._21*value._34*value._43 + value._23*value._31*value._44 + value._24*value._33*value._41 - value._21*value._33*value._44 - value._23*value._34*value._41 - value._24*value._31*value._43;
    auto m22 = value._11*value._33*value._44 + value._13*value._34*value._41 + value._14*value._31*value._43 - value._11*value._34*value._43 - value._13*value._31*value._44 - value._14*value._33*value._41;
    auto m23 = value._11*value._24*value._43 + value._13*value._21*value._44 + value._14*value._23*value._41 - value._11*value._23*value._44 - value._13*value._24*value._41 - value._14*value._21*value._43;
    auto m24 = value._11*value._23*value._34 + value._13*value._24*value._31 + value._14*value._21*value._33 - value._11*value._24*value._33 - value._13*value._21*value._34 - value._14*value._23*value._31;

    auto m31 = value._21*value._32*value._44 + value._22*value._34*value._41 + value._24*value._31*value._42 - value._21*value._34*value._42 - value._22*value._31*value._44 - value._24*value._32*value._41;
    auto m32 = value._11*value._34*value._42 + value._12*value._31*value._44 + value._14*value._32*value._41 - value._11*value._32*value._44 - value._12*value._34*value._41 - value._14*value._31*value._42;
    auto m33 = value._11*value._22*value._44 + value._12*value._24*value._41 + value._14*value._21*value._42 - value._11*value._24*value._42 - value._12*value._21*value._44 - value._14*value._22*value._41;
    auto m34 = value._11*value._24*value._32 + value._12*value._21*value._34 + value._14*value._22*value._31 - value._11*value._22*value._34 - value._12*value._24*value._31 - value._14*value._21*value._32;

    auto m41 = value._21*value._33*value._42 + value._22*value._31*value._43 + value._23*value._32*value._41 - value._21*value._32*value._43 - value._22*value._33*value._41 - value._23*value._31*value._42;
    auto m42 = value._11*value._32*value._43 + value._12*value._33*value._41 + value._13*value._31*value._42 - value._11*value._33*value._42 - value._12*value._31*value._43 - value._13*value._32*value._41;
    auto m43 = value._11*value._23*value._42 + value._12*value._21*value._43 + value._13*value._22*value._41 - value._11*value._22*value._43 - value._12*value._23*value._41 - value._13*value._21*value._42;
    auto m44 = value._11*value._22*value._33 + value._12*value._23*value._31 + value._13*value._21*value._32 - value._11*value._23*value._32 - value._12*value._21*value._33 - value._13*value._22*value._31;

    return Matrix(
        m11 / det, m12 / det, m13 / det, m14 / det,
        m21 / det, m22 / det, m23 / det, m24 / det,
        m31 / det, m32 / det, m33 / det, m34 / det,
        m41 / det, m42 / det, m43 / det, m44 / det );
}

//-----------------------------------------------------------------------------
//      拡大・縮小行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateScale(float scale)
{
    return Matrix(
       scale,   0.0f,   0.0f,   0.0f,
        0.0f,  scale,   0.0f,   0.0f,
        0.0f,   0.0f,  scale,   0.0f,
        0.0f,   0.0f,   0.0f,   1.0f );
}

//-----------------------------------------------------------------------------
//      拡大・縮小行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateScale(float xScale, float yScale, float zScale)
{
    return Matrix(
        xScale, 0.0f,   0.0f,   0.0f,
        0.0f,   yScale, 0.0f,   0.0f,
        0.0f,   0.0f,   zScale, 0.0f,
        0.0f,   0.0f,   0.0f,   1.0f );
}

//-----------------------------------------------------------------------------
//      拡大・縮小行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateScale(const Vector3& scales)
{
    return Matrix(
        scales.x,   0.0f,       0.0f,       0.0f,
        0.0f,       scales.y,   0.0f,       0.0f,
        0.0f,       0.0f,       scales.z,   0.0f,
        0.0f,       0.0f,       0.0f,       1.0f );
}

//-----------------------------------------------------------------------------
//      平行移動行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateTranslation(float xPos, float yPos, float zPos)
{
    return Matrix(
        1.0f, 0.0f, 0.0f, 0.0f,
        0.0f, 1.0f, 0.0f, 0.0f,
        0.0f, 0.0f, 1.0f, 0.0f,
        xPos, yPos, zPos, 1.0f );
}

//-----------------------------------------------------------------------------
//      平行移動行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateTranslation(const Vector3& pos)
{
    return Matrix(
        1.0f, 0.0f, 0.0f, 0.0f,
        0.0f, 1.0f, 0.0f, 0.0f,
        0.0f, 0.0f, 1.0f, 0.0f,
        pos.x, pos.y, pos.z, 1.0f );
}

//-----------------------------------------------------------------------------
//      X軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateRotationX(float radian)
{
    auto cosRad = cosf(radian);
    auto sinRad = sinf(radian);
    return Matrix(
        1.0f,   0.0f,   0.0f,   0.0f,
        0.0f,   cosRad, sinRad, 0.0f,
        0.0f,  -sinRad, cosRad, 0.0f,
        0.0f,   0.0f,   0.0f,   1.0f );
}

//-----------------------------------------------------------------------------
//      Y軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateRotationY(float radian)
{
    auto cosRad = cosf(radian);
    auto sinRad = sinf(radian);

    return Matrix(
        cosRad, 0.0f,  -sinRad, 0.0f,
        0.0f,   1.0f,   0.0f,   0.0f,
        sinRad, 0.0f,   cosRad, 0.0f,
        0.0f,   0.0f,   0.0f,   1.0f );
}

//-----------------------------------------------------------------------------
//      Z軸周りの回転行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateRotationZ(float radian)
{
    auto cosRad = cosf(radian);
    auto sinRad = sinf(radian);

    return Matrix(
        cosRad, sinRad, 0.0f, 0.0f,
       -sinRad, cosRad, 0.0f, 0.0f,
        0.0f,   0.0f,   1.0f, 0.0f,
        0.0f,   0.0f,   0.0f, 1.0f );
}

//-----------------------------------------------------------------------------
//      四元数から回転行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateFromQuaternion(const Quaternion& qua)
{
    auto xx = qua.x * qua.x; // num1
    auto yy = qua.y * qua.y; // num2
    auto zz = qua.z * qua.z; // num3

    auto xy = qua.x * qua.y; // num4
    auto zw = qua.z * qua.w; // num5
    auto zx = qua.z * qua.x; // num6
    
    auto yw = qua.y * qua.w; // num7
    auto yz = qua.y * qua.z; // num8
    auto xw = qua.x * qua.w; // num9

    return Matrix(
        1.0f - 2.0f * (yy + zz),
        2.0f * (xy + zw),
        2.0f * (zx - yw),
        0.0f,

        2.0f * (xy - zw),
        1.0f - 2.0f * (zz + xx),
        2.0f * (yz + xw),
        0.0f,

        2.0f * (zx + yw), 
        2.0f * (yz - xw),
        1.0f - 2.0f * (yy + xx),
        0.0f,

        0.0f,
        0.0f,
        0.0f,
        1.0f);
}

//-----------------------------------------------------------------------------
//      指定された軸と角度から回転行列を求めます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateFromAxisAngle(const Vector3& axis, float radian)
{
    auto sinRad = sinf(radian);
    auto cosRad = cosf(radian);
    auto a = 1.0f -cosRad;
    
    auto ab = axis.x * axis.y * a;
    auto bc = axis.y * axis.z * a;
    auto ca = axis.z * axis.x * a;
    auto tx = axis.x * axis.x;
    auto ty = axis.y * axis.y;
    auto tz = axis.z * axis.z;

    return Matrix(
        tx + cosRad * (1.0f - tx),
        ab + axis.z * sinRad,
        ca - axis.y * sinRad,
        0.0f,

        ab - axis.z * sinRad,
        ty + cosRad * (1.0f - ty),
        bc + axis.x * sinRad,
        0.0f,

        ca + axis.y * sinRad,
        bc - axis.x * sinRad,
        tz + cosRad * (1.0f - tz),
        0.0f,

        0.0f,
        0.0f,
        0.0f,
        1.0f);
}

//-----------------------------------------------------------------------------
//      ヨー・ピッチ・ロール角から回転行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateRotationFromYawPitchRoll(float yaw, float pitch, float roll)
{
    auto value = Quaternion::CreateFromYawPitchRoll(yaw, pitch, roll );
    return Matrix::CreateFromQuaternion(value );
}

//-----------------------------------------------------------------------------
//      注視点を基にビュー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateLookAt
(
    const Vector3& cameraPosition,
    const Vector3& cameraTarget,
    const Vector3& cameraUpVector
)
{
    auto zaxis = cameraPosition - cameraTarget;
    zaxis.Normalize();

    auto xaxis = Vector3::Cross(cameraUpVector, zaxis);
    xaxis.Normalize();

    auto yaxis = Vector3::Cross(zaxis, xaxis);
    yaxis.Normalize();

    return Matrix(
        xaxis.x, yaxis.x, zaxis.x, 0.0f,
        xaxis.y, yaxis.y, zaxis.y, 0.0f,
        xaxis.z, yaxis.z, zaxis.z, 0.0f,
        -Vector3::Dot(xaxis, cameraPosition),
        -Vector3::Dot(yaxis, cameraPosition),
        -Vector3::Dot(zaxis, cameraPosition),
        1.0f );
}

//-----------------------------------------------------------------------------
//      視線ベクトルを基にビュー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateLookTo
(
    const Vector3& cameraPosition,
    const Vector3& cameraDir,
    const Vector3& cameraUpVector
)
{
    auto zaxis = -cameraDir;
    zaxis.Normalize();

    auto xaxis = Vector3::Cross(cameraUpVector, zaxis);
    xaxis.Normalize();

    auto yaxis = Vector3::Cross(zaxis, xaxis);
    yaxis.Normalize();

    return Matrix(
        xaxis.x, yaxis.x, zaxis.x, 0.0f,
        xaxis.y, yaxis.y, zaxis.y, 0.0f,
        xaxis.z, yaxis.z, zaxis.z, 0.0f,
        -Vector3::Dot(xaxis, cameraPosition),
        -Vector3::Dot(yaxis, cameraPosition),
        -Vector3::Dot(zaxis, cameraPosition),
        1.0f );
}

//-----------------------------------------------------------------------------
//      透視投影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreatePerspective
(
    float width,
    float height,
    float nearClip,
    float farClip
)
{
    assert(!IsZero(width));
    assert(!IsZero(height));
    assert(!IsZero(nearClip - farClip));
    auto range = farClip / (nearClip - farClip);

    return Matrix(
        2.0f * nearClip / width, 
        0.0f, 
        0.0f,
        0.0f,

        0.0f,
        2.0f * nearClip / height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        range,
        -1.0f,

        0.0f,
        0.0f,
        range * nearClip,
        0.0f);
}

//-----------------------------------------------------------------------------
//      視野角に基づいて透視投影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreatePerspectiveFieldOfView
(
    float fieldOfView,
    float aspectRatio,
    float nearClip,
    float farClip
)
{
    assert(!IsZero(aspectRatio));
    assert(!IsZero(nearClip - farClip));
    auto sinFov = sinf(0.5f * fieldOfView);
    auto cosFov = cosf(0.5f * fieldOfView);
    auto height = cosFov / sinFov;
    auto width  = height / aspectRatio;
    auto range  = farClip / (nearClip - farClip);

    return Matrix(
        width,
        0.0f,
        0.0f,
        0.0f,

        0.0f,
        height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        range,
        -1.0f,

        0.0f,
        0.0f,
        range * nearClip,
        0.0f );
}

//-----------------------------------------------------------------------------
//      視野角に基づいてReverse-Z透視投影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreatePerspectiveFieldOfViewReverseZ
(
    float fieldOfView,
    float aspectRatio,
    float nearClip
)
{
    assert(!IsZero(aspectRatio));
    auto sinFov = sinf(0.5f * fieldOfView);
    auto cosFov = cosf(0.5f * fieldOfView);
    auto height = cosFov / sinFov;
    auto width  = height / aspectRatio;

    return Matrix(
        width,
        0.0f,
        0.0f,
        0.0f,

        0.0f,
        height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        0.0f,
        -1.0f,

        0.0f,
        0.0f,
        nearClip,
        0.0f );
}

//-----------------------------------------------------------------------------
//      カスタマイズした透視投影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreatePerspectiveOffCenter
(
    float left,
    float right,
    float bottom,
    float top,
    float nearClip,
    float farClip
)
{
    auto width  = right - left;
    auto height = top - bottom;
    auto depth  = nearClip - farClip;
    assert(!IsZero(width));
    assert(!IsZero(height));
    assert(!IsZero(depth));

    return Matrix(
        2.0f * nearClip / width,
        0.0f,
        0.0f,
        0.0f,

        0.0f,
        2.0f * nearClip / height,
        0.0f,
        0.0f,

        (left + right) / width,
        (top + bottom) / height,
        farClip / depth,
        -1.0f,

        0.0f,
        0.0f,
        nearClip * farClip/ depth,
        0.0f );
}

//-----------------------------------------------------------------------------
//      正射影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateOrthographic
(
    float width,
    float height,
    float nearClip,
    float farClip
)
{
    assert(!IsZero(width));
    assert(!IsZero(height));
    assert(!IsZero(nearClip - farClip));
    auto range = 1.0f / (nearClip - farClip);

    return Matrix(
        2.0f / width,
        0.0f,
        0.0f,
        0.0f,
    
        0.0f,
        2.0f / height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        range,
        0.0f,

        0.0f,
        0.0f,
        range * nearClip,
        1.0f );
}

//-----------------------------------------------------------------------------
//      カスタマイズした正射影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateOrthographicOffCenter
(
    float left,
    float right,
    float bottom,
    float top,
    float nearClip,
    float farClip
)
{
    auto width  = right - left;
    auto height = bottom - top;
    auto depth  = nearClip - farClip;
    assert(!IsZero(width));
    assert(!IsZero(height));
    assert(!IsZero(depth));

    return Matrix(
        2.0f / width,
        0.0f,
        0.0f,
        0.0f,

        0.0f,
        2.0f / height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        1.0f / depth,
        0.0f,

        (left + right) / width,
        (top + bottom) / height,
        nearClip / depth,
        1.0f
    );
}

//-----------------------------------------------------------------------------
//      カスタマイズした正射影行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateOrthographicOffCenterReverseZ
(
    float left,
    float right,
    float bottom,
    float top,
    float nearClip,
    float farClip
)
{
    auto width  = right - left;
    auto height = bottom - top;
    auto depth  = nearClip - farClip;
    assert(!IsZero(width));
    assert(!IsZero(height));
    assert(!IsZero(depth));

    return Matrix(
        2.0f / width,
        0.0f,
        0.0f,
        0.0f,

        0.0f,
        2.0f / height,
        0.0f,
        0.0f,

        0.0f,
        0.0f,
        -1.0f / depth,
        0.0f,

        (left + right) / width,
        (top + bottom) / height,
        -nearClip / depth + 1.0f,
        1.0f );
}

//-----------------------------------------------------------------------------
//      2つの行列を線形補間します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::Lerp(const Matrix& a, const Matrix& b, float amount)
{
    return Matrix(
        a._11 + amount * (b._11 - a._11),
        a._12 + amount * (b._12 - a._12),
        a._13 + amount * (b._13 - a._13),
        a._14 + amount * (b._14 - a._14),

        a._21 + amount * (b._21 - a._21),
        a._22 + amount * (b._22 - a._22),
        a._23 + amount * (b._23 - a._23),
        a._24 + amount * (b._24 - a._24),

        a._31 + amount * (b._31 - a._31),
        a._32 + amount * (b._32 - a._32),
        a._33 + amount * (b._33 - a._33),
        a._34 + amount * (b._34 - a._34),

        a._41 + amount * (b._41 - a._41),
        a._42 + amount * (b._42 - a._42),
        a._43 + amount * (b._43 - a._43),
        a._44 + amount * (b._44 - a._44) );
}

//-----------------------------------------------------------------------------
//      ビルボード行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateBillboard(const Matrix& value)
{
    return Matrix(
        value._11, value._21, value._31, 0.0f,
        value._12, value._22, value._32, 0.0f,
        value._13, value._23, value._33, 0.0f,
        value._14, value._24, value._34, 1.0f );
}

//-----------------------------------------------------------------------------
//      Y軸ビルボード行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateBillboardAxisY(const Matrix& value)
{
    return Matrix(
        value._11,  0.0f,   value._31,  0.0f,
             0.0f,  1.0f,        0.0f,  0.0f,
        value._13,  0.0f,   value._33,  0.0f,
        value._14,  0.0f,   value._34,  1.0f );
}

//-----------------------------------------------------------------------------
//      平行移動行列を左から掛けます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::AppendTranslation(const Vector3& vec, Matrix& mat)
{
    auto m41 = (vec.x * mat._11 ) + (vec.y * mat._21 ) + (vec.z * mat._31 ) + mat._41;
    auto m42 = (vec.x * mat._12 ) + (vec.y * mat._22 ) + (vec.z * mat._32 ) + mat._42;
    auto m43 = (vec.x * mat._13 ) + (vec.y * mat._23 ) + (vec.z * mat._33 ) + mat._43;
    auto m44 = (vec.x * mat._14 ) + (vec.y * mat._24 ) + (vec.z * mat._34 ) + mat._44;
    mat._41 = m41;
    mat._42 = m42;
    mat._43 = m43;
    mat._44 = m44;
    return mat;
}

//-----------------------------------------------------------------------------
//      平行移動行列を右から掛けます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::AppendTranslation(Matrix& mat, const Vector3& vec)
{
    mat._41 += vec.x;
    mat._42 += vec.y;
    mat._43 += vec.z;
    return mat;
}

//-----------------------------------------------------------------------------
//      スケール行列を左から掛けます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::AppendScale(const Vector3& vec, Matrix& mat)
{
    mat._11 *= vec.x;
    mat._12 *= vec.x;
    mat._13 *= vec.x;
    mat._14 *= vec.x;

    mat._21 *= vec.y;
    mat._22 *= vec.y;
    mat._23 *= vec.y;
    mat._24 *= vec.y;

    mat._31 *= vec.z;
    mat._32 *= vec.z;
    mat._33 *= vec.z;
    mat._34 *= vec.z;

    return mat;
}

//-----------------------------------------------------------------------------
//      スケール行列を右から掛けます.
//-----------------------------------------------------------------------------
inline Matrix Matrix::AppendScale(Matrix& mat, const Vector3& vec)
{
    mat._11 *= vec.x;
    mat._12 *= vec.y;
    mat._13 *= vec.z;

    mat._21 *= vec.x;
    mat._22 *= vec.y;
    mat._23 *= vec.z;

    mat._31 *= vec.x;
    mat._32 *= vec.y;
    mat._33 *= vec.z;

    mat._41 *= vec.x;
    mat._42 *= vec.y;
    mat._43 *= vec.z;

    return mat;
}

//-----------------------------------------------------------------------------
//      明度を調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateBrightnessMatrix(float brightness)
{ return Matrix::CreateScale(brightness); }

//-----------------------------------------------------------------------------
//      彩度を調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateSaturationMatrix(float r, float g, float b)
{
    // https://docs.microsoft.com/ja-jp/windows/win32/direct2d/saturation
    return Matrix(
        0.213f + 0.787f * r,
        0.213f - 0.213f * r,
        0.213f - 0.213f * r,
        0.0f,

        0.715f - 0.715f * g,
        0.715f + 0.285f * g,
        0.715f - 0.715f * g,
        0.0f,

        0.072f - 0.072f * b,
        0.072f - 0.072f * b,
        0.072f + 0.928f * b,
        0.0f,

        0.0f, 0.0f, 0.0f, 1.0f);
}

//-----------------------------------------------------------------------------
//      彩度を調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateSaturationMatrix(float saturation)
{ return CreateSaturationMatrix(saturation, saturation, saturation); }

//-----------------------------------------------------------------------------
//      コントラストを調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateContrastMatrix(float contrast)
{
    const auto t = (1.0f - contrast) * 0.5f;
    return Matrix(
        contrast, 0.0f, 0.0f, 0.0f,
        0.0f, contrast, 0.0f, 0.0f,
        0.0f, 0.0f, contrast, 0.0f,
        t, t, t, 1.0f);
}

//-----------------------------------------------------------------------------
//      色相を調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateHueMatrix(float hue)
{
    // https://docs.microsoft.com/ja-jp/windows/win32/direct2d/hue-rotate
    auto rad = ToRadian(hue);
    auto u   = cosf(rad);
    auto w   = sinf(rad);

    return Matrix(
        0.213f + 0.787f * u - 0.213f * w,
        0.213f - 0.213f * u + 0.143f * w,
        0.213f - 0.213f * u - 0.787f * w,
        0.0f,

        0.715f - 0.715f * u - 0.715f * w,
        0.715f + 0.285f * u + 0.140f * w,
        0.715f - 0.715f * u - 0.283f * w,
        0.0f,

        0.072f - 0.072f * u + 0.928f * w,
        0.072f - 0.072f * u - 0.283f * w,
        0.072f + 0.928f * u + 0.072f * w,
        0.0f,

        0.0f,
        0.0f,
        0.0f,
        1.0f);
}

//-----------------------------------------------------------------------------
//      セピアカラーを調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateSepiaMatrix(float tone)
{
    const Vector3 kWhite(0.298912f, 0.586611f, 0.114478f);
    const Vector3 kSepia(0.941f, 0.784f, 0.569f);

    return Matrix(
        tone * kWhite.x * kSepia.x + (1.0f - tone),
        tone * kWhite.x * kSepia.y,
        tone * kWhite.x * kSepia.z,
        0.0f,

        tone * kWhite.y * kSepia.x,
        tone * kWhite.y * kSepia.y + (1.0f - tone),
        tone * kWhite.y * kSepia.z,
        0.0f,

        tone * kWhite.z * kSepia.x,
        tone * kWhite.z * kSepia.y,
        tone * kWhite.z * kSepia.z + (1.0f - tone),
        0.0f,

        0.0f, 0.0f, 0.0f, 1.0f);
}

//-----------------------------------------------------------------------------
//      グレースケールカラーを調整するカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateGrayScaleMatrix(float tone)
{
    const Vector3 kGrayScale(0.22015f, 0.706655f, 0.071330f);
    return Matrix(
        tone * kGrayScale.x + (1.0f - tone),
        tone * kGrayScale.x,
        tone * kGrayScale.x,
        0.0f,

        tone * kGrayScale.y,
        tone * kGrayScale.y + (1.0f - tone),
        tone * kGrayScale.y,
        0.0f,

        tone * kGrayScale.z,
        tone * kGrayScale.z,
        tone * kGrayScale.z + (1.0f - tone),
        0.0f,

        0.0f, 0.0f, 0.0f, 1.0f);
}

//-----------------------------------------------------------------------------
//      ネガポジ反転のカラー行列を生成します.
//-----------------------------------------------------------------------------
inline Matrix Matrix::CreateReverseColorMatrix()
{
    return Matrix(
        -1.0f,  0.0f,  0.0f, 0.0f,
         0.0f, -1.0f,  0.0f, 0.0f,
         0.0f,  0.0f, -1.0f, 0.0f,
         1.0f,  1.0f,  1.0f, 1.0f);
}

///////////////////////////////////////////////////////////////////////////////
// Quaternion
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline Quaternion::Quaternion()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Quaternion::Quaternion(const float* pf)
{
    assert(pf != nullptr);
    x = pf[0];
    y = pf[1];
    z = pf[2];
    w = pf[3];
}

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Quaternion::Quaternion(float nx, float ny, float nz, float nw)
: x(nx)
, y(ny)
, z(nz)
, w(nw)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Quaternion::operator float* ()
{ return &x; }

//-----------------------------------------------------------------------------
//      const float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Quaternion::operator const float* () const
{ return &x; }

//-----------------------------------------------------------------------------
//      加算代入演算子です.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::operator += (const Quaternion& q)
{
    x += q.x;
    y += q.y;
    z += q.z;
    w += q.w;
    return (*this);
}

//-----------------------------------------------------------------------------
//      減算代入演算子です.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::operator -= (const Quaternion& q)
{
    x -= q.x;
    y -= q.y;
    z -= q.z;
    w -= q.w;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::operator *= (const Quaternion& q)
{
    auto X = (q.x * w) + (x * q.w) + (q.y * z) - (q.z * y);
    auto Y = (q.y * w) + (y * q.w) + (q.z * x) - (q.x * z);
    auto Z = (q.z * w) + (z * q.w) + (q.x * y) - (q.y * x);
    auto W = (q.w * w) - (q.x * x) - (q.y * y) + (q.z * z);
    x = X;
    y = Y;
    z = Z;
    w = W;
    return (*this);
}

//-----------------------------------------------------------------------------
//      乗算代入演算子です.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::operator *= (float f)
{
    x *= f;
    y *= f;
    z *= f;
    w *= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      除算代入演算子です.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::operator /= (float f)
{
    assert(!IsZero(f));
    x /= f;
    y /= f;
    z /= f;
    w /= f;
    return (*this);
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator + () const
{ return (*this); }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator - () const
{ return Quaternion(-x, -y, -z, -w); }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator + (const Quaternion& q) const
{ return Quaternion(x + q.x, y + q.y, z + q.z, w + q.z); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator - (const Quaternion& q) const
{ return Quaternion(x - q.x, y - q.y, z - q.z, w - q.z); }

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator * (const Quaternion& q) const
{ 
    return Quaternion(
        (q.x * w) + (x * q.w) + (q.y * z) - (q.z * y),
        (q.y * w) + (y * q.w) + (q.z * x) - (q.x * z),
        (q.z * w) + (z * q.w) + (q.x * y) - (q.y * x),
        (q.w * w) - (q.x * x) - (q.y * y) + (q.z * z)
   );
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator * (float f) const
{ return Quaternion(x * f, y * f, z * f, w * f); }

//-----------------------------------------------------------------------------
//      除算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::operator / (float f) const
{
    assert(!IsZero(f));
    return Quaternion(x / f, y / f, z / f, w / f ); 
}

//-----------------------------------------------------------------------------
//      乗算演算子です.
//-----------------------------------------------------------------------------
inline Quaternion operator * (float f, const Quaternion& q)
{ return Quaternion(f * q.x, f * q.y, f * q.z, f * q.w); }

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Quaternion::operator == (const Quaternion& q) const
{
    return IsEqual(x, q.x)
        && IsEqual(y, q.y)
        && IsEqual(z, q.z)
        && IsEqual(w, q.w);
}

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Quaternion::operator != (const Quaternion& q) const
{
    return !IsEqual(x, q.x)
        || !IsEqual(y, q.y)
        || !IsEqual(z, q.z)
        || !IsEqual(w, q.w);
}

//-----------------------------------------------------------------------------
//      四元数の大きさを求めます.
//-----------------------------------------------------------------------------
inline float Quaternion::Length() const
{ return Hypot(x, y, z, w); }

//-----------------------------------------------------------------------------
//      四元数の大きさの2乗値を求めます.
//-----------------------------------------------------------------------------
inline float Quaternion::LengthSq() const
{ return (x * x) + (y * y) + (z * z) + (w * w); }

//-----------------------------------------------------------------------------
//      正規化します.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::Normalize()
{
    auto mag = Length();
    assert(mag > 0.0f);
    x /= mag;
    y /= mag;
    z /= mag;
    w /= mag;
    return (*this);
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化します.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::SafeNormalize(const Quaternion& set)
{
    auto mag = Length();
    if (mag > 0.0f)
    {
        x /= mag;
        y /= mag;
        z /= mag;
        w /= mag;
    }
    else
    {
        x = set.x;
        y = set.y;
        z = set.z;
        w = set.w;
    }
    return (*this);
}

//-----------------------------------------------------------------------------
//      単位四元数化します.
//-----------------------------------------------------------------------------
inline Quaternion& Quaternion::Identity()
{
    x = 0.0f;
    y = 0.0f;
    z = 0.0f;
    w = 1.0f;
    return (*this);
}

///////////////////////////////////////////////////////////////////////////////
// Quaternion Methods
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      単位四元数を生成します.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::CreateIdentity()
{ return Quaternion(0.0f, 0.0f, 0.0f, 1.0f); }

//-----------------------------------------------------------------------------
//      単位四元数かどうかチェックします.
//-----------------------------------------------------------------------------
inline bool Quaternion::IsIdentity(const Quaternion& value)
{
    return IsEqual(value.x, 0.0f)
        && IsEqual(value.y, 0.0f)
        && IsEqual(value.z, 0.0f)
        && IsEqual(value.w, 1.0f);
}

//-----------------------------------------------------------------------------
//      正規化されているかどうかチェックします.
//-----------------------------------------------------------------------------
inline bool Quaternion::IsNormalized(const Quaternion& value)
{ return IsZero(1.0f - value.Length()); }

//-----------------------------------------------------------------------------
//      乗算を行います.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::Multiply(const Quaternion& lhs, const Quaternion& rhs)
{
    return Quaternion(
        (rhs.x * lhs.w) + (lhs.x * rhs.w) + (rhs.y * lhs.z) - (rhs.z * lhs.y),
        (rhs.y * lhs.w) + (lhs.y * rhs.w) + (rhs.z * lhs.x) - (rhs.x * lhs.z),
        (rhs.z * lhs.w) + (lhs.z * rhs.w) + (rhs.x * lhs.y) - (rhs.y * lhs.x),
        (rhs.w * lhs.w) - (rhs.x * lhs.x) - (rhs.y * lhs.y) + (rhs.z * lhs.z) );
}

//-----------------------------------------------------------------------------
//      内積を求めます.
//-----------------------------------------------------------------------------
inline float Quaternion::Dot(const Quaternion& lhs, const Quaternion& rhs)
{ return (lhs.x * rhs.x) + (lhs.y * rhs.y) + (lhs.z * rhs.z) + (lhs.w * rhs.w); }

//-----------------------------------------------------------------------------
//      共役な四元数を求めます.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::Conjugate(const Quaternion& value)
{ return Quaternion(-value.x, -value.y, -value.z, value.w); }

//-----------------------------------------------------------------------------
//      正規化を行います.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::Normalize(const Quaternion& value)
{
    auto mag = value.Length();
    assert(mag > 0.0f);
    return Quaternion(
        value.x / mag,
        value.y / mag,
        value.z / mag,
        value.w / mag
    );
}

//-----------------------------------------------------------------------------
//      零除算を考慮して正規化します.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::SafeNormalize(const Quaternion& value, const Quaternion& set)
{
    auto mag = value.Length();
    if (mag > 0.0f)
    {
        return Quaternion(
            value.x / mag,
            value.y / mag,
            value.z / mag,
            value.w / mag );
    }

    return set;
}

//-----------------------------------------------------------------------------
//      ヨー・ピッチ・ロール角から四元数を生成します.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::CreateFromYawPitchRoll(float yaw, float pitch, float roll)
{
    auto r = roll  * 0.5f;
    auto p = pitch * 0.5f;
    auto y = yaw   * 0.5f;
    auto sr = sinf(r);
    auto cr = cosf(r);
    auto sp = sinf(p);
    auto cp = cosf(p);
    auto sy = sinf(y);
    auto cy = cosf(y);

    return Quaternion(
        cy * sp * cr + sy * cp * sr,
        sy * cp * cr - cy * sp * sr,
        cy * cp * sr - sy * sp * cr,
        cy * cp * cr + sy * sp * sr);
}

//-----------------------------------------------------------------------------
//      指定された軸と角度から四元数を生成します.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::CreateFromAxisAngle(const Vector3& axis, float radian)
{
    auto halfRad = radian * 0.5f;
    auto sinX = sinf(halfRad);
    return Quaternion(
        axis.x * sinX,
        axis.y * sinX,
        axis.z * sinX,
        cosf(halfRad) );
}

//-----------------------------------------------------------------------------
//      回転行列から四元数を生成します.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::CreateFromRotationMatrix(const Matrix& value)
{
    auto tr = value._11 + value._22 + value._33;
    if (tr > 0.0f)
    {
        auto s = sqrtf(tr + 1.0f);
        auto w = s * 0.5f;
        s = 0.5f / s;
        return Quaternion(
            (value._23 - value._32) * s,
            (value._31 - value._13) * s,
            (value._12 - value._21) * s,
            w );
    }
    if ((value._11 >= value._22) && (value._11 >= value._33))
    {
        auto s = sqrtf(1.0f + value._11 - value._22 - value._33);
        auto x = s * 0.5f;
        s = 0.5f / s;
        return Quaternion(
            x,
            (value._12 + value._21) * s,
            (value._13 + value._31) * s,
            (value._23 - value._32) * s );
    }
    if (value._22 > value._33)
    {
        auto s = sqrtf(1.0f + value._22 - value._11 - value._33);
        auto y = s * 0.5f;
        s = 0.5f / s;
        return Quaternion(
            (value._21 + value._12) * s,
            y,
            (value._32 + value._23) * s,
            (value._31 - value._13) * s );
    }
    {
        auto s = sqrtf(1.0f + value._33 - value._11 - value._22);
        auto z = s * 0.5f;
        s = 0.5f / s;
        return Quaternion(
            (value._31 + value._13) * s,
            (value._32 + value._23) * s,
            z,
            (value._12 - value._21) * s );
    }
}

//-----------------------------------------------------------------------------
//      回転角を取得します.
//-----------------------------------------------------------------------------
inline Vector3 Quaternion::ToAxisAngle(const Quaternion& value)
{
    auto x2 = value.x * value.x;
    auto y2 = value.y * value.y;
    auto z2 = value.z * value.z;
    auto w2 = value.w * value.w;
    auto mag = x2 + y2 + z2 + w2;
    auto test = value.x * value.y + value.z * value.w;
    auto rad = F_PIDIV2;

    if (test > rad * mag)
    {
        return Vector3(
            0.0f,
            2.0f * std::atan2(value.x, value.w),
            F_PIDIV2);
    }
    if (test < -rad * mag)
    {
        return Vector3(
            0.0f,
            -2.0f * std::atan2(value.x, value.w),
            -F_PIDIV2);
    }

    return Vector3(
        std::atan2(2.0f * value.x * value.w - 2.0f * value.y * value.z, -x2 + y2 - z2 + w2),
        std::atan2(2.0f * value.y * value.w - 2.0f * value.x * value.z,  x2 - y2 - z2 + w2),
        std::asin (2.0f * test / mag) );
}

//-----------------------------------------------------------------------------
//      球面線形補間を行います.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::Slerp
(
    const Quaternion&   a,
    const Quaternion&   b,
    const float         amount
)
{
    if (amount <= 0.0f )
    { return a; }

    if (amount >= 1.0f )
    { return b; }

    if (a == b )
    { return b; }

    Quaternion temp;
    auto cosom = Quaternion::Dot(a, b);
    if (cosom < 0.0f)
    { 
        temp = -b;
        cosom = -cosom;
    }
    else
    { temp = b; }

    auto scale0 = 0.0f;
    auto scale1 = 0.0f;
    if (1.0f - cosom > 1e-6f)
    {
        scale0 = 1.0f - cosom * cosom;
        auto sinom = 1.0f / sqrtf(scale0 );
        auto omega = atan2f(scale0 * sinom, cosom );
        scale0 = sinf((1.0f - amount ) * omega ) * sinom;
        scale1 = sinf(amount * omega ) * sinom;
    }
    else
    {
        scale0 = 1.0f - amount;
        scale1 = amount;
    }

    return Quaternion(
        scale0 * a.x + scale1 * temp.x,
        scale0 * a.y + scale1 * temp.y,
        scale0 * a.z + scale1 * temp.z,
        scale0 * a.w + scale1 * temp.w );
}

//-----------------------------------------------------------------------------
//      球面四角形補間を行います.
//-----------------------------------------------------------------------------
inline Quaternion Quaternion::Squad
(
    const Quaternion&   q,
    const Quaternion&   a,
    const Quaternion&   b,
    const Quaternion&   c,
    float               amount
)
{
    auto d = Quaternion::Slerp(q, c, amount);
    auto e = Quaternion::Slerp(a, b, amount);
    return Quaternion::Slerp(d, e, 2.0f * amount * (1.0f - amount));
}

///////////////////////////////////////////////////////////////////////////////
// Transform3x4 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline Transform3x4::Transform3x4()
: _11(1.0f), _12(0.0f), _13(0.0f), _14(0.0f)
, _21(0.0f), _22(1.0f), _23(0.0f), _24(0.0f)
, _31(0.0f), _32(0.0f), _33(1.0f), _34(0.0f)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Transform3x4::Transform3x4
(
    float m11, float m12, float m13, float m14,
    float m21, float m22, float m23, float m24,
    float m31, float m32, float m33, float m34
)
: _11(m11), _12(m12), _13(m13), _14(m14)
, _21(m21), _22(m22), _23(m23), _24(m24)
, _31(m31), _32(m32), _33(m33), _34(m34)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Transform3x4::operator float* ()
{ return &_11; }

//-----------------------------------------------------------------------------
//      const float* 型へのキャストです.
//-----------------------------------------------------------------------------
inline Transform3x4::operator const float* () const
{ return &_11; }

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline Transform3x4& Transform3x4::operator = (const Transform3x4& value)
{
    _11 = value._11; _12 = value._12; _13 = value._13; _14 = value._14;
    _21 = value._21; _22 = value._22; _23 = value._23; _24 = value._24;
    _31 = value._31; _32 = value._32; _33 = value._33; _34 = value._34;
    return *this;
}

//-----------------------------------------------------------------------------
//      正符号演算子です.
//-----------------------------------------------------------------------------
inline Transform3x4 Transform3x4::operator + () const
{ return *this; }

//-----------------------------------------------------------------------------
//      負符号演算子です.
//-----------------------------------------------------------------------------
inline Transform3x4 Transform3x4::operator - () const
{
    return Transform3x4(
        -_11, -_12, -_13, -_14,
        -_21, -_22, -_23, -_24,
        -_31, -_32, -_33, -_34 );
}

//-----------------------------------------------------------------------------
//      等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Transform3x4::operator == (const Transform3x4& value) const
{
    return IsEqual(_11, value._11) && IsEqual(_12, value._12) && IsEqual(_13, value._13) && IsEqual(_14, value._14)
        && IsEqual(_21, value._21) && IsEqual(_22, value._22) && IsEqual(_23, value._23) && IsEqual(_24, value._24)
        && IsEqual(_31, value._31) && IsEqual(_32, value._32) && IsEqual(_33, value._33) && IsEqual(_34, value._34);
}

//-----------------------------------------------------------------------------
//      非等価比較演算子です.
//-----------------------------------------------------------------------------
inline bool Transform3x4::operator != (const Transform3x4& value) const
{
    return !IsEqual(_11, value._11) || !IsEqual(_12, value._12) || !IsEqual(_13, value._13) || !IsEqual(_14, value._14)
        || !IsEqual(_21, value._21) || !IsEqual(_22, value._22) || !IsEqual(_23, value._23) || !IsEqual(_24, value._24)
        || !IsEqual(_31, value._31) || !IsEqual(_32, value._32) || !IsEqual(_33, value._33) || !IsEqual(_34, value._34);
}

//-----------------------------------------------------------------------------
//      Matrix から Transform3x4 へ変換します.
//-----------------------------------------------------------------------------
inline Transform3x4 Transform3x4::FromMatrix(const Matrix& value)
{
    // 転置しながら格納.
    return Transform3x4(
        value.m[0][0], value.m[1][0], value.m[2][0], value.m[3][0],
        value.m[0][1], value.m[1][1], value.m[2][1], value.m[3][1],
        value.m[0][2], value.m[1][2], value.m[2][2], value.m[3][2]);
}

//-----------------------------------------------------------------------------
//      Transform3x4 から Matrix へ変換します.
//-----------------------------------------------------------------------------
inline Matrix Transform3x4::ToMatrix(const Transform3x4& value)
{
    // 転置しながら格納.
    return Matrix(
        value._11, value._21, value._31, 0.0f,
        value._12, value._22, value._32, 0.0f,
        value._13, value._23, value._33, 0.0f,
        value._14, value._24, value._34, 1.0f );
}

///////////////////////////////////////////////////////////////////////////////
// BoundingBox2 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingBox2::BoundingBox2()
: Mini( FLT_MAX,  FLT_MAX)
, Maxi(-FLT_MAX, -FLT_MAX)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingBox2::BoundingBox2(const Vector2& mini, const Vector2& maxi)
: Mini(mini)
, Maxi(maxi)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      中心座標を求めます.
//-----------------------------------------------------------------------------
inline Vector2 BoundingBox2::GetCenter() const
{ return (Maxi + Mini) * 0.5f; }

//-----------------------------------------------------------------------------
//      サイズを求めます.
//-----------------------------------------------------------------------------
inline Vector2 BoundingBox2::GetSize() const
{ return Vector2::Abs(Maxi - Mini); }

//-----------------------------------------------------------------------------
//      点が含まれるかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingBox2::Contains(const Vector2& value) const
{
    return (value.x >= Mini.x && value.x <= Maxi.x
         && value.y >= Mini.y && value.y <= Maxi.y);
}

//-----------------------------------------------------------------------------
//      バウンディングボックスが含まれるかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingBox2::Contains(const BoundingBox2& value) const
{
    return (value.Mini.x >= Mini.x && value.Maxi.x <= Maxi.x
         && value.Mini.y >= Mini.y && value.Maxi.y <= Maxi.y);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline BoundingBox2& BoundingBox2::operator = (const BoundingBox2& value)
{
    Mini = value.Mini;
    Maxi = value.Maxi;
    return *this;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingBox2 BoundingBox2::Merge(const BoundingBox2& lhs, const BoundingBox2& rhs)
{
    BoundingBox2 result;
    result.Mini = Vector2::Min(lhs.Mini, rhs.Mini);
    result.Maxi = Vector2::Max(lhs.Maxi, rhs.Maxi);
    return result;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingBox2 BoundingBox2::Merge(const BoundingBox2& lhs, const Vector2& rhs)
{
    BoundingBox2 result;
    result.Mini = Vector2::Min(lhs.Mini, rhs);
    result.Maxi = Vector2::Max(lhs.Maxi, rhs);
    return result;
}

//-----------------------------------------------------------------------------
//      頂点列からバウンディングスフィアを求めます.
//-----------------------------------------------------------------------------
inline BoundingBox2 BoundingBox2::Create(const float* pVertices, size_t vertexCount, size_t vertexStride)
{
    auto vertex = pVertices;
    BoundingBox2 result;
    result.Mini = Vector2(vertex[0], vertex[1]);
    result.Maxi = Vector2(vertex[0], vertex[1]);
    vertex += vertexStride;

    for(size_t i=1; i<vertexCount; ++i)
    {
        auto pos = Vector2(vertex[0], vertex[1]);
        result = Merge(result, pos);
        vertex += vertexStride;
    }

    return result;
}


///////////////////////////////////////////////////////////////////////////////
// BoundingBox3 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingBox3::BoundingBox3()
: Mini( FLT_MAX,  FLT_MAX,  FLT_MAX)
, Maxi(-FLT_MAX, -FLT_MAX, -FLT_MAX)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingBox3::BoundingBox3(const Vector3& mini, const Vector3& maxi)
: Mini(mini)
, Maxi(maxi)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      中心座標を求めます.
//-----------------------------------------------------------------------------
inline Vector3 BoundingBox3::GetCenter() const
{ return (Maxi + Mini) * 0.5f; }

//-----------------------------------------------------------------------------
//      サイズを求めます.
//-----------------------------------------------------------------------------
inline Vector3 BoundingBox3::GetSize() const
{ return Vector3::Abs(Maxi - Mini); }

//-----------------------------------------------------------------------------
//      点が含まれるかどうか判定します
//-----------------------------------------------------------------------------
inline bool BoundingBox3::Contains(const Vector3& value) const
{
    return (value.x >= Mini.x && value.x <= Maxi.x 
         && value.y >= Mini.y && value.y <= Maxi.y
         && value.z >= Mini.z && value.z <= Maxi.z);
}

//-----------------------------------------------------------------------------
//      バウンディングボックスが含まれるかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingBox3::Contains(const BoundingBox3& value) const
{
    return (value.Mini.x >= Mini.x && value.Maxi.x <= Maxi.x
         && value.Mini.y >= Mini.y && value.Maxi.y <= Maxi.y
         && value.Mini.z >= Mini.z && value.Maxi.z <= Maxi.z);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline BoundingBox3& BoundingBox3::operator = (const BoundingBox3& value)
{
    Mini = value.Mini;
    Maxi = value.Maxi;
    return *this;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingBox3 BoundingBox3::Merge(const BoundingBox3& lhs, const BoundingBox3& rhs)
{
    BoundingBox3 result;
    result.Mini = Vector3::Min(lhs.Mini, rhs.Mini);
    result.Maxi = Vector3::Max(lhs.Maxi, rhs.Maxi);
    return result;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingBox3 BoundingBox3::Merge(const BoundingBox3& lhs, const Vector3& rhs)
{
    BoundingBox3 result;
    result.Mini = Vector3::Min(lhs.Mini, rhs);
    result.Maxi = Vector3::Max(lhs.Maxi, rhs);
    return result;
}

//-----------------------------------------------------------------------------
//      指定行列で変換処理を行います.
//-----------------------------------------------------------------------------
inline BoundingBox3 BoundingBox3::Transform(const BoundingBox3& box, const Matrix& matrix)
{
    Vector3 corners[8] = {
        Vector3(box.Mini.x, box.Mini.y, box.Mini.z),
        Vector3(box.Maxi.x, box.Mini.y, box.Mini.z),
        Vector3(box.Mini.x, box.Maxi.y, box.Mini.z),
        Vector3(box.Maxi.x, box.Maxi.y, box.Mini.z),
        Vector3(box.Mini.x, box.Mini.y, box.Maxi.z),
        Vector3(box.Maxi.x, box.Mini.y, box.Maxi.z),
        Vector3(box.Mini.x, box.Maxi.y, box.Maxi.z),
        Vector3(box.Maxi.x, box.Maxi.y, box.Maxi.z),
    };

    BoundingBox3 result;
    for(auto i=0; i<8; ++i)
    {
        auto p = Vector3::Transform(corners[i], matrix);

        result.Mini = Vector3::Min(result.Mini, p);
        result.Maxi = Vector3::Max(result.Maxi, p);
    }

    return result;
}

//-----------------------------------------------------------------------------
//      頂点列からバウンディングスフィアを求めます.
//-----------------------------------------------------------------------------
inline BoundingBox3 BoundingBox3::Create(const float* pVertices, size_t vertexCount, size_t vertexStride)
{
    auto vertex = pVertices;
    BoundingBox3 result;
    result.Mini = Vector3(vertex[0], vertex[1], vertex[2]);
    result.Maxi = Vector3(vertex[0], vertex[1], vertex[2]);
    vertex += vertexStride;

    for(size_t i=1; i<vertexCount; ++i)
    {
        auto pos = Vector3(vertex[0], vertex[1], vertex[2]);
        result = Merge(result, pos);
        vertex += vertexStride;
    }

    return result;
}


///////////////////////////////////////////////////////////////////////////////
// BoundingSphere2 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere2::BoundingSphere2()
: Center(0.0f, 0.0f)
, Radius(0.0f)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere2::BoundingSphere2(float x, float y, float radius)
: Center(x, y)
, Radius(radius)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere2::BoundingSphere2(const Vector2& center, float radius)
: Center(center)
, Radius(radius)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      点を含むかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingSphere2::Contains(const Vector2& value) const
{
    auto diff = value - Center;
    return Vector2::Dot(diff, diff) <= (Radius * Radius);
}

//-----------------------------------------------------------------------------
//      バウンディングスフィアを含むかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingSphere2::Contains(const BoundingSphere2& value) const
{
    auto diff = value.Center - Center;
    return Vector2::Dot(diff, diff) <= ((Radius - value.Radius) * (Radius - value.Radius));
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline BoundingSphere2& BoundingSphere2::operator = (const BoundingSphere2& value)
{
    Center = value.Center;
    Radius = value.Radius;
    return *this;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingSphere2 BoundingSphere2::Merge(const BoundingSphere2& lhs, const BoundingSphere2& rhs)
{
    auto diff = rhs.Center - lhs.Center;
    auto dist = diff.Length();

    // 一方が他方を完全に包含している場合.
    if (lhs.Radius >= dist + rhs.Radius) return lhs;
    if (rhs.Radius >= dist + lhs.Radius) return rhs;

    // 新しい半径と中心補間.
    auto newRadius = (dist + lhs.Radius + rhs.Radius) * 0.5f;
    auto t = (newRadius - lhs.Radius) / dist;

    auto newCenter = lhs.Center + diff * t;
    return BoundingSphere2(newCenter, newRadius);
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingSphere2 BoundingSphere2::Merge(const BoundingSphere2& lhs, const Vector2& rhs)
{
    auto diff = rhs - lhs.Center;
    auto dist = diff.Length();

    // 既に点を含んでいる場合はそのまま返す.
    if (dist <= lhs.Radius) return lhs;

    // 新しい半径.
    auto newRadius = (lhs.Radius + dist) * 0.5f;
    auto t = (newRadius - lhs.Radius) / dist;

    auto newCenter = lhs.Center + diff * t;
    return BoundingSphere2(newCenter, newRadius);
}

//-----------------------------------------------------------------------------
//      頂点列からバウンディングスフィアを求めます.
//-----------------------------------------------------------------------------
inline BoundingSphere2 BoundingSphere2::Create(const float* pVertices, size_t vertexCount, size_t vertexStride)
{
    // Ritter法.
    BoundingSphere2 result;
    if (pVertices == nullptr || vertexCount == 0 || vertexStride == 0)
    { return result; }

    auto vertex = pVertices;
    auto stride = vertexStride / sizeof(float);

    // 最も離れた2点を探す.
    auto pos = Vector2(vertex[0], vertex[1]);

    Vector2 xMin = pos;
    Vector2 xMax = pos;

    Vector2 yMin = pos;
    Vector2 yMax = pos;

    for(size_t i=0; i<vertexCount; ++i)
    {
        pos = Vector2(vertex[0], vertex[1]);
        if (pos.x < xMin.x) xMin = pos;
        if (pos.x > xMax.x) xMax = pos;
        if (pos.y < yMin.y) yMin = pos;
        if (pos.y > yMax.y) yMax = pos;
        vertex += stride;
    }

    auto dx = Vector2::DistanceSq(xMax, xMin);
    auto dy = Vector2::DistanceSq(yMax, yMin);

    Vector2 p1 = xMin;
    Vector2 p2 = xMax;
    if (dy > dx)
    {
        p1 = yMin;
        p2 = yMax;
    }

    result.Center = (p1 + p2) * 0.5f;
    result.Radius = Vector2::Distance(p2, result.Center);

    // 全ての点を内包するように拡大.
    vertex = pVertices;
    for(size_t i=0; i<vertexCount; ++i)
    {
        pos = Vector2(vertex[0], vertex[1]);
        result = Merge(result, pos);
        vertex += stride;
    }

    return result;
}


///////////////////////////////////////////////////////////////////////////////
// BoundingSphere3 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere3::BoundingSphere3()
: Center(0.0f, 0.0f, 0.0f)
, Radius(0.0f)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere3::BoundingSphere3(float x, float y, float z, float radius)
: Center(x, y, z)
, Radius(radius)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline BoundingSphere3::BoundingSphere3(const Vector3& center, float radius)
: Center(center)
, Radius(radius)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      点を含むかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingSphere3::Contains(const Vector3& value) const
{
    auto diff = value - Center;
    return Vector3::Dot(diff, diff) <= (Radius * Radius);
}

//-----------------------------------------------------------------------------
//      バウンディングスフィアを含むかどうか判定します.
//-----------------------------------------------------------------------------
inline bool BoundingSphere3::Contains(const BoundingSphere3& value) const
{
    auto diff = value.Center - Center;
    return Vector3::Dot(diff, diff) <= ((Radius - value.Radius) * (Radius - value.Radius));
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline BoundingSphere3& BoundingSphere3::operator = (const BoundingSphere3& value)
{
    Center = value.Center;
    Radius = value.Radius;
    return *this;
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingSphere3 BoundingSphere3::Merge(const BoundingSphere3& lhs, const BoundingSphere3& rhs)
{
    auto diff = rhs.Center - lhs.Center;
    auto dist = diff.Length();

    // 一方が他方を完全に包含している場合.
    if (lhs.Radius >= dist + rhs.Radius) return lhs;
    if (rhs.Radius >= dist + lhs.Radius) return rhs;

    // 新しい半径と中心補間.
    auto newRadius = (dist + lhs.Radius + rhs.Radius) * 0.5f;
    auto t = (newRadius - lhs.Radius) / dist;

    auto newCenter = lhs.Center + diff * t;
    return BoundingSphere3(newCenter, newRadius);
}

//-----------------------------------------------------------------------------
//      マージ処理を行います.
//-----------------------------------------------------------------------------
inline BoundingSphere3 BoundingSphere3::Merge(const BoundingSphere3& lhs, const Vector3& rhs)
{
    auto diff = rhs - lhs.Center;
    auto dist = diff.Length();

    // 既に点を含んでいる場合はそのまま返す.
    if (dist <= lhs.Radius) return lhs;

    // 新しい半径.
    auto newRadius = (lhs.Radius + dist) * 0.5f;
    auto t = (newRadius - lhs.Radius) / dist;

    auto newCenter = lhs.Center + diff * t;
    return BoundingSphere3(newCenter, newRadius);
}

//-----------------------------------------------------------------------------
//      指定行列で変換処理を行います.
//-----------------------------------------------------------------------------
inline BoundingSphere3 BoundingSphere3::Transform(const BoundingSphere3& sphere, const Matrix& matrix)
{
    auto center = Vector3::Transform(sphere.Center, matrix);
    auto scale  = matrix.CalcScale();

    auto maxScale = Max(scale.x, Max(scale.y, scale.z));
    auto radius   = sphere.Radius * maxScale;
    return BoundingSphere3(center, radius);
}

//-----------------------------------------------------------------------------
//      頂点列からバウンディングスフィアを求めます.
//-----------------------------------------------------------------------------
inline BoundingSphere3 BoundingSphere3::Create(const float* pVertices, size_t vertexCount, size_t vertexStride)
{
    // Ritter法.
    BoundingSphere3 result;
    if (pVertices == nullptr || vertexCount == 0 || vertexStride == 0)
    { return result; }

    auto vertex = pVertices;
    auto stride = vertexStride / sizeof(float);

    // 最も離れた2点を探す.
    auto pos = Vector3(vertex[0], vertex[1], vertex[2]);

    Vector3 xMin = pos;
    Vector3 xMax = pos;

    Vector3 yMin = pos;
    Vector3 yMax = pos;

    Vector3 zMin = pos;
    Vector3 zMax = pos;

    for(size_t i=0; i<vertexCount; ++i)
    {
        pos = Vector3(vertex[0], vertex[1], vertex[2]);
        if (pos.x < xMin.x) xMin = pos;
        if (pos.x > xMax.x) xMax = pos;
        if (pos.y < yMin.y) yMin = pos;
        if (pos.y > yMax.y) yMax = pos;
        if (pos.z < zMin.z) zMin = pos;
        if (pos.z > zMax.z) zMax = pos;
        vertex += stride;
    }

    auto dx = Vector3::DistanceSq(xMax, xMin);
    auto dy = Vector3::DistanceSq(yMax, yMin);
    auto dz = Vector3::DistanceSq(zMax, zMin);

    Vector3 p1 = xMin;
    Vector3 p2 = xMax;
    if (dy > dx && dy > dz)
    {
        p1 = yMin;
        p2 = yMax;
    }
    else if (dz > dx && dz > dy)
    {
        p1 = zMin;
        p2 = zMax;
    }

    result.Center = (p1 + p2) * 0.5f;
    result.Radius = Vector3::Distance(p2, result.Center);

    // 全ての点を内包するように拡大.
    vertex = pVertices;
    for(size_t i=0; i<vertexCount; ++i)
    {
        pos = Vector3(vertex[0], vertex[1], vertex[2]);
        result = Merge(result, pos);
        vertex += stride;
    }

    return result;
}


///////////////////////////////////////////////////////////////////////////////
// XorShift class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline XorShift::XorShift(uint32_t seed)
{ SetSeed(seed); }

//-----------------------------------------------------------------------------
//      コピーコンストラクタです.
//-----------------------------------------------------------------------------
inline XorShift::XorShift(const XorShift& value)
: m_X(value.m_X)
, m_Y(value.m_Y)
, m_Z(value.m_Z)
, m_W(value.m_W)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      ランダム種を設定します.
//-----------------------------------------------------------------------------
inline void XorShift::SetSeed(uint32_t seed)
{
    m_X = 123456789;
    m_Y = 362436069;
    m_Z = 521288629;
    m_W = ( seed <= 0 ) ? 88675123 : seed;
}

//-----------------------------------------------------------------------------
//      疑似乱数を取得します.
//-----------------------------------------------------------------------------
inline uint32_t XorShift::GetValue()
{
    auto t = m_X ^ (m_X << 11);
    m_X = m_Y;
    m_Y = m_Z;
    m_Z = m_W;
    m_W = (m_W ^ (m_W >> 19)) ^ (t ^ (t >> 8));
    return m_W;
}

//-----------------------------------------------------------------------------
//      等価演算子です.
//-----------------------------------------------------------------------------
inline bool XorShift::operator == (const XorShift& value) const
{
    return (m_X == value.m_X)
        && (m_Y == value.m_Y)
        && (m_Z == value.m_Z)
        && (m_W == value.m_W);
}

//-----------------------------------------------------------------------------
//      非等価演算子です.
//-----------------------------------------------------------------------------
inline bool XorShift::operator != (const XorShift& value) const
{
    return (m_X != value.m_X)
        || (m_Y != value.m_Y)
        || (m_Z != value.m_Z)
        || (m_W != value.m_W);
}

///////////////////////////////////////////////////////////////////////////////
// PCG class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コンストラクタです.
//-----------------------------------------------------------------------------
inline PCG::PCG(uint64_t seed)
{ SetSeed(seed); }

//-----------------------------------------------------------------------------
//      コピーコンストラクタです.
//-----------------------------------------------------------------------------
inline PCG::PCG(const PCG& value)
: m_State(value.m_State)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      ランダム種を設定します.
//-----------------------------------------------------------------------------
inline void PCG::SetSeed(uint64_t seed)
{
    m_State = seed + s_Increment;
    GetValue();
}

//-----------------------------------------------------------------------------
//      乱数をuint32_t型として取得します.
//-----------------------------------------------------------------------------
inline uint32_t PCG::GetValue()
{
    auto x = m_State;
    auto count = uint32_t(x >> 59);

    m_State = x * s_Multiplier + s_Increment;
    x ^= x >> 18;
    return Rotate(uint32_t(x >> 27), count);
}

//-----------------------------------------------------------------------------
//      代入演算子です.
//-----------------------------------------------------------------------------
inline PCG& PCG::operator = (const PCG& value)
{
    m_State = value.m_State;
    return (*this);
}

//-----------------------------------------------------------------------------
//      等価演算子です.
//-----------------------------------------------------------------------------
inline bool PCG::operator == (const PCG& value) const
{ return m_State == value.m_State; }

//-----------------------------------------------------------------------------
//      非等価演算子です.
//-----------------------------------------------------------------------------
inline bool PCG::operator != (const PCG& value) const
{ return m_State != value.m_State; }

//-----------------------------------------------------------------------------
//      ビット回転処理を行います.
//-----------------------------------------------------------------------------
inline uint32_t PCG::Rotate(uint32_t x, uint32_t r)
{ return x >> r | x << ((~r + 1u) & 31); }


///////////////////////////////////////////////////////////////////////////////
// RandomHelper class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      疑似乱数を int型に変換します.
//-----------------------------------------------------------------------------
inline int RandomHelper::GetAsInt(uint32_t value)
{
    int ret = value & 0x7fffffff;
    return ret;
}

//-----------------------------------------------------------------------------
//      疑似乱数を int型に変換し，指定範囲に変換します.
//-----------------------------------------------------------------------------
inline int RandomHelper::GetAsInt(uint32_t value, int mini, int maxi)
{
    int ret = GetAsInt(value);
    ret %= (maxi - mini);
    ret += mini;
    return ret;
}

//-----------------------------------------------------------------------------
//      疑似乱数を float型に変換します.
//-----------------------------------------------------------------------------
inline float RandomHelper::GetAsFloat(uint32_t value)
{
    // 2^(-32)をかけて[0, 1)のfloatに戻す.
    return float(value * 2.3283064365386962890625e-10);
}

//-----------------------------------------------------------------------------
//      疑似乱数を float型に変換し，指定範囲に変換します.
//-----------------------------------------------------------------------------
inline float RandomHelper::GetAsFloat(uint32_t value, float mini, float maxi)
{
    float ret = GetAsFloat(value);
    ret *= (maxi - mini);
    ret += mini;
    return ret;
}


///////////////////////////////////////////////////////////////////////////////
// Quad2 class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      コントラクタです.
//-----------------------------------------------------------------------------
inline Quad2::Quad2(int px, int py, int width, int height)
: x(px)
, y(py)
, w(width)
, h(height)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      平行移動します.
//-----------------------------------------------------------------------------
inline Quad2& Quad2::Move(int tx, int ty)
{
    x += tx;
    y += ty;
    return (*this);
}

//-----------------------------------------------------------------------------
//      矩形と矩形の包含を調べます.
//-----------------------------------------------------------------------------
inline bool Quad2::Contains(const Quad2& lhs, const Quad2& rhs)
{
    return lhs.x < (rhs.x + rhs.w)
        && rhs.x < (lhs.x + lhs.w)
        && lhs.y < (rhs.y + rhs.h)
        && rhs.y < (lhs.y + lhs.h);
}

//-----------------------------------------------------------------------------
//      点と矩形の包含を調べます.
//-----------------------------------------------------------------------------
inline bool Quad2::Contains(int x, int y, const Quad2& quad)
{
    return (quad.x <= x && x <= (quad.x + quad.w))
        && (quad.y <= y && y <= (quad.y + quad.h));
}


///////////////////////////////////////////////////////////////////////////////
// Other functions.
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      正規直交基底を求めます.
//-----------------------------------------------------------------------------
inline void CalcONB(const Vector3& N, Vector3& T, Vector3& B)
{
    float sig = (N.z >= 0.0) ? 1.0f : -1.0f;
    float a = -1.0f / (sig + N.z);
    float b = N.x * N.y * a;
    T = Vector3(1.0f + sig * N.x * N.x * a, sig * b, -sig * N.x);
    B = Vector3(b, sig + N.y * N.y * a, -N.y);
}

//-----------------------------------------------------------------------------
//      Hammersleyサンプルを行います.
//-----------------------------------------------------------------------------
inline Vector2 Hammersley(uint32_t i, uint32_t numSamples)
{
    uint32_t bits = i;
    bits = (bits << 16u) | (bits >> 16u);
    bits = ((bits & 0x55555555u) << 1u) | ((bits & 0xAAAAAAAAu) >> 1u);
    bits = ((bits & 0x33333333u) << 2u) | ((bits & 0xCCCCCCCCu) >> 2u);
    bits = ((bits & 0x0F0F0F0Fu) << 4u) | ((bits & 0xF0F0F0F0u) >> 4u);
    bits = ((bits & 0x00FF00FFu) << 8u) | ((bits & 0xFF00FF00u) >> 8u);
    float result = float(bits) * 2.3283064365386963e-10f; // / 0x100000000

    return Vector2(float(i)/float(numSamples), result );
}

//-----------------------------------------------------------------------------
//      視錐台を構成する6平面を求めます.
//-----------------------------------------------------------------------------
inline void CalcFrustumPlanes(const Matrix& view, const Matrix& proj, Vector4* planes)
{
    // Gil Gribb, Klaus Hartmann,
    // "Fast Extraction of Viewing Frustum Planes from the World-View-Projection Matrix"
    // https://www.gamedevs.org/
    auto vp = Matrix::MultiplyTranspose(view, proj);

    planes[PLANE_LEFT]   = Vector4::NormalizePlane(vp.row[3] + vp.row[0]);
    planes[PLANE_RIGHT]  = Vector4::NormalizePlane(vp.row[3] - vp.row[0]);
    planes[PLANE_BOTTOM] = Vector4::NormalizePlane(vp.row[3] + vp.row[1]);
    planes[PLANE_TOP]    = Vector4::NormalizePlane(vp.row[3] - vp.row[1]);
    planes[PLANE_NEAR]   = Vector4::NormalizePlane(vp.row[2]);
    planes[PLANE_FAR]    = Vector4::NormalizePlane(vp.row[3] - vp.row[2]);
}

//-----------------------------------------------------------------------------
//      交差線を求めます.
//-----------------------------------------------------------------------------
inline void ComputeIntersectionLine(const Vector4& p1, const Vector4& p2, Vector3& orig, Vector3& dir)
{
    auto n1 = Vector3(p1.x, p1.y, p1.z);
    auto n2 = Vector3(p2.x, p2.y, p2.z);
    dir = Vector3::Cross(n1, n2);
    auto divider = Vector3::Dot(dir, dir);
    orig = Vector3::Cross(p1.w * n2 + p2.w * n1, dir) / divider;
}

//-----------------------------------------------------------------------------
//      平面とレイの交差点を求めます.
//-----------------------------------------------------------------------------
inline Vector3 ComputeIntersection(const Vector4& plane, const Vector3& orig, const Vector3& dir)
{
    auto normal = Vector3(plane.x, plane.y, plane.z);
    auto t = (-plane.w - Vector3::Dot(normal, orig)) / Vector3::Dot(normal, dir);
    return orig + dir * t;
}

//-----------------------------------------------------------------------------
//      視錐台の8角を求めます.
//-----------------------------------------------------------------------------
inline void GetCorners(const Vector4* planes, Vector3* corners)
{
    assert(planes  != nullptr);
    assert(corners != nullptr);
    Vector3 orig, dir;
    ComputeIntersectionLine(planes[0], planes[2], orig, dir);
    corners[0] = ComputeIntersection(planes[4], orig, dir);
    corners[3] = ComputeIntersection(planes[5], orig, dir);
 
    ComputeIntersectionLine(planes[3], planes[0], orig, dir);
    corners[1] = ComputeIntersection(planes[4], orig, dir);
    corners[2] = ComputeIntersection(planes[5], orig, dir);

    ComputeIntersectionLine(planes[2], planes[1], orig, dir);
    corners[4] = ComputeIntersection(planes[4], orig, dir);
    corners[7] = ComputeIntersection(planes[5], orig, dir);

    ComputeIntersectionLine(planes[1], planes[3], orig, dir);
    corners[5] = ComputeIntersection(planes[4], orig, dir);
    corners[6] = ComputeIntersection(planes[5], orig, dir);
}

///////////////////////////////////////////////////////////////////////////////
// Unorm2 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm2::Unorm2(uint8_t nx, uint8_t ny)
: x(nx)
, y(ny)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm2::Unorm2(float nx, float ny)
: x(uint8_t(asdx::Saturate(nx) * 255.0f))
, y(uint8_t(asdx::Saturate(ny) * 255.0f))
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      Vector2型に変換します.
//-----------------------------------------------------------------------------
inline Vector2 Unorm2::ToVector2() const
{
    return Vector2(
        asdx::Saturate(x / 255.0f),
        asdx::Saturate(y / 255.0f));
}


///////////////////////////////////////////////////////////////////////////////
// Unorm3 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm3::Unorm3(uint8_t nx, uint8_t ny, uint8_t nz)
: x(nx)
, y(ny)
, z(nz)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm3::Unorm3(float nx, float ny, float nz)
: x(uint8_t(asdx::Saturate(nx) * 255.0f))
, y(uint8_t(asdx::Saturate(ny) * 255.0f))
, z(uint8_t(asdx::Saturate(nz) * 255.0f))
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      Vector3型に変換します.
//-----------------------------------------------------------------------------
inline Vector3 Unorm3::ToVector3() const
{
    return Vector3(
        asdx::Saturate(x / 255.0f),
        asdx::Saturate(y / 255.0f),
        asdx::Saturate(z / 255.0f));
}

//-----------------------------------------------------------------------------
//      Unorm3に変換します.
//-----------------------------------------------------------------------------
inline Unorm3 Unorm3::FromRGB(uint32_t value)
{
    uint8_t r = (value >> 16) & 0xff;
    uint8_t g = (value >>  8) & 0xff;
    uint8_t b = (value & 0xff);
    return Unorm3(r, g, b);
}

//-----------------------------------------------------------------------------
//      Unorm3に変換します.
//-----------------------------------------------------------------------------
inline Unorm3 Unorm3::FromBGR(uint32_t value)
{
    uint8_t b = (value >> 16) & 0xff;
    uint8_t g = (value >>  8) & 0xff;
    uint8_t r = (value & 0xff);
    return Unorm3(r, g, b);
}


///////////////////////////////////////////////////////////////////////////////
// Unorm4 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm4::Unorm4(uint8_t nx, uint8_t ny, uint8_t nz, uint8_t nw)
: x(nx)
, y(ny)
, z(nz)
, w(nw)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Unorm4::Unorm4(float nx, float ny, float nz, float nw)
: x(uint8_t(asdx::Saturate(nx) * 255.0f))
, y(uint8_t(asdx::Saturate(ny) * 255.0f))
, z(uint8_t(asdx::Saturate(nz) * 255.0f))
, w(uint8_t(asdx::Saturate(nw) * 255.0f))
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//     Vector4型に変換します.
//-----------------------------------------------------------------------------
inline Vector4 Unorm4::ToVector4() const
{
    return Vector4(
        asdx::Saturate(x / 255.0f),
        asdx::Saturate(y / 255.0f),
        asdx::Saturate(z / 255.0f),
        asdx::Saturate(w / 255.0f));
}

//-----------------------------------------------------------------------------
//      Unorm4に変換します.
//-----------------------------------------------------------------------------
inline Unorm4 Unorm4::FromRGBA(uint32_t value)
{
    uint8_t r = (value >> 24) & 0xff;
    uint8_t g = (value >> 16) & 0xff;
    uint8_t b = (value >>  8) & 0xff;
    uint8_t a = (value & 0xff);
    return Unorm4(r, g, b, a);
}

//-----------------------------------------------------------------------------
//      Unorm4に変換します.
//-----------------------------------------------------------------------------
inline Unorm4 Unorm4::FromARGB(uint32_t value)
{
    uint8_t a = (value >> 24) & 0xff;
    uint8_t r = (value >> 16) & 0xff;
    uint8_t g = (value >>  8) & 0xff;
    uint8_t b = (value & 0xff);
    return Unorm4(r, g, b, a);
}

//-----------------------------------------------------------------------------
//      Unorm4に変換します.
//-----------------------------------------------------------------------------
inline Unorm4 Unorm4::FromBGRA(uint32_t value)
{
    uint8_t b = (value >> 24) & 0xff;
    uint8_t g = (value >> 16) & 0xff;
    uint8_t r = (value >>  8) & 0xff;
    uint8_t a = (value & 0xff);
    return Unorm4(r, g, b, a);
}

//-----------------------------------------------------------------------------
//      Unorm4に変換します.
//-----------------------------------------------------------------------------
inline Unorm4 Unorm4::FromABGR(uint32_t value)
{
    uint8_t a = (value >> 24) & 0xff;
    uint8_t b = (value >> 16) & 0xff;
    uint8_t g = (value >>  8) & 0xff;
    uint8_t r = (value & 0xff);
    return Unorm4(r, g, b, a);
}


///////////////////////////////////////////////////////////////////////////////
// Uint2 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Uint2::Uint2(uint32_t nx, uint32_t ny)
: x(nx)
, y(ny)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Uint2 Uint2::operator + (const Uint2& value) const
{ return Uint2(x + value.x, y + value.y); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Uint2 Uint2::operator - (const Uint2& value) const
{ return Uint2(x - value.x, y - value.y); }


///////////////////////////////////////////////////////////////////////////////
// Uint3 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Uint3::Uint3(uint32_t nx, uint32_t ny, uint32_t nz)
: x(nx)
, y(ny)
, z(nz)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Uint3 Uint3::operator + (const Uint3& value) const
{ return Uint3(x + value.x, y + value.y, z + value.z); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Uint3 Uint3::operator - (const Uint3& value) const
{ return Uint3(x - value.x, y - value.y, z - value.z); }


///////////////////////////////////////////////////////////////////////////////
// Uint4 structure
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      引数付きコンストラクタです.
//-----------------------------------------------------------------------------
inline Uint4::Uint4(uint32_t nx, uint32_t ny, uint32_t nz, uint32_t nw)
: x(nx)
, y(ny)
, z(nz)
, w(nw)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      加算演算子です.
//-----------------------------------------------------------------------------
inline Uint4 Uint4::operator + (const Uint4& value) const
{ return Uint4(x + value.x, y + value.y, z + value.z, w + value.w); }

//-----------------------------------------------------------------------------
//      減算演算子です.
//-----------------------------------------------------------------------------
inline Uint4 Uint4::operator - (const Uint4& value) const
{ return Uint4(x - value.x, y - value.y, z - value.z, w - value.w); }


} // namespace asdx

