//-----------------------------------------------------------------------------
// File : asdxResBMP.h
// Desc : Bitmap Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// BMP_COMPRESSION_TYPE enum
///////////////////////////////////////////////////////////////////////////////
enum BMP_COMPRESSION_TYPE
{
    BMP_COMPRESSION_RGB       = 0,      // 無圧縮.
    BMP_COMPRESSION_RLE8      = 1,      // RLE圧縮 8 bits/pixel.
    BMP_COMPRESSION_RLE4      = 2,      // RLE圧縮 4 bits/pixel.
    BMP_COMPRESSION_BITFIELDS = 3,      // ビットフィールド.
};

///////////////////////////////////////////////////////////////////////////////
// BMP_COLOR_SPACE_TYPE enum
///////////////////////////////////////////////////////////////////////////////
enum BMP_COLOR_SPACE_TYPE
{
    BMP_COLOR_SPACE_CALIBRATED_RGB  = 0x00000000,
    BMP_COLOR_SPACE_SRGB            = 0x73524742,
    BMP_COLOR_SPACE_WIN_COLOR_SPACE = 0x57696E20,
    BMP_COLOR_SPACE_LINK            = 0x4C494E4B,
    BMP_COLOR_SPACE_MBED            = 0x4D424544,
};

///////////////////////////////////////////////////////////////////////////////
// BMP_FILE_HEADER structure
///////////////////////////////////////////////////////////////////////////////
#pragma pack( push, 1 )
struct BMP_FILE_HEADER
{
    uint16_t     Type;           // ファイルタイプ 'BM'
    uint32_t     Size;           // ファイルサイズ.
    uint16_t     Reserved1;      // 予約領域 (0固定).
    uint16_t     Reserved2;      // 予約領域 (0固定).
    uint32_t     OffBits;        // ファイル先頭から画像データまでのオフセット.
};
#pragma pack( pop )

///////////////////////////////////////////////////////////////////////////////
// BMP_INFO_HEADER structure
///////////////////////////////////////////////////////////////////////////////
#pragma pack( push, 1 )
struct BMP_INFO_HEADER
{
    uint32_t    Size;           // ヘッダサイズ (40固定).
    int32_t     Width;          // 画像の横幅.
    int32_t     Height;         // 画像の縦幅.
    uint16_t    Planes;         // プレーン数 (1固定).
    uint16_t    BitCount;       // 1ピクセルあたりのビット数.
    uint32_t    Compression;    // 圧縮形式.
    uint32_t    SizeImage;      // 画像データ部のサイズ.
    int32_t     ResolutionX;    // 横方向の解像度.
    int32_t     ResolutionY;    // 縦方向の解像度.
    uint32_t    ClrUsed;        // 格納されているパレット数.
    uint32_t    ClrImportant;   // 重要なパレットのインデックス.
};
#pragma pack( pop )

///////////////////////////////////////////////////////////////////////////////
// BMP_HEADER_V4 structure
///////////////////////////////////////////////////////////////////////////////
#pragma pack( push, 1 )
struct BMP_HEADER_V4
{
    uint32_t    Size;               //!< ヘッダサイズ (108固定).
    int32_t     Width;              //!< 画像の横幅.
    int32_t     Height;             //!< 画像の縦幅.
    uint16_t    Planes;             //!< プレーン数.
    uint16_t    BitCount;           //!< 1ピクセルあたりのビット数.
    uint32_t    Compression;        //!< 圧縮形式.
    uint32_t    SizeImage;          //!< 画像データ部のサイズ.
    int32_t     ResolutionX;        //!< 横方向の解像度.
    int32_t     ResolutionY;        //!< 縦方向の解像度.
    uint32_t    ClrUsed;            //!< 格納されているパレット数.
    uint32_t    ClrImportant;       //!< 重要なパレットインデックス.

    uint32_t    MaskR;              //!< 赤成分のカラーマスク.
    uint32_t    MaskG;              //!< 緑成分のカラーマスク.
    uint32_t    MaskB;              //!< 青成分のカラーマスク.
    uint32_t    MaskA;              //!< α成分のカラーマスク.
    uint32_t    ColorSpaceType;     //!< 色空間.
    int32_t     RedX;               //!< 赤成分に対するCIEXYZのX座標
    int32_t     RedY;               //!< 赤成分に対するCIEXYZのY座標
    int32_t     RedZ;               //!< 赤成分に対するCIEXYZのZ座標
    int32_t     GreenX;             //!< 緑成分に対するCIEXYZのX座標
    int32_t     GreenY;             //!< 緑成分に対するCIEXYZのY座標
    int32_t     GreenZ;             //!< 緑成分に対するCIEXYZのZ座標
    int32_t     BlueX;              //!< 青成分に対するCIEXYZのX座標
    int32_t     BlueY;              //!< 青成分に対するCIEXYZのY座標
    int32_t     BlueZ;              //!< 青成分に対するCIEXYZのZ座標
    uint32_t    GammaR;             //!< 赤成分のガンマ値.
    uint32_t    GammaG;             //!< 緑成分のガンマ値.
    uint32_t    GammaB;             //!< 青成分のガンマ値.
};
#pragma pack( pop )

///////////////////////////////////////////////////////////////////////////////
// BMP_HEADER_V5 structure
///////////////////////////////////////////////////////////////////////////////
#pragma pack( push, 1 )
struct BMP_HEADER_V5
{
    uint32_t    Size;               //!< ヘッダサイズ (124固定).
    int32_t     Width;              //!< 画像の横幅.
    int32_t     Height;             //!< 画像の縦幅.
    uint16_t    Planes;             //!< プレーン数.
    uint16_t    BitCount;           //!< 1ピクセルあたりのビット数.
    uint32_t    Compression;        //!< 圧縮形式.
    uint32_t    SizeImage;          //!< 画像データ部のサイズ.
    int32_t     ResolutionX;        //!< 横方向の解像度.
    int32_t     ResolutionY;        //!< 縦方向の解像度.
    uint32_t    ClrUsed;            //!< 格納されているパレット数.
    uint32_t    ClrImportant;       //!< 重要なパレットインデックス.

    uint32_t    MaskR;              //!< 赤成分のカラーマスク.
    uint32_t    MaskG;              //!< 緑成分のカラーマスク.
    uint32_t    MaskB;              //!< 青成分のカラーマスク.
    uint32_t    MaskA;              //!< α成分のカラーマスク.
    uint32_t    ColorSpaceType;     //!< 色空間.
    int32_t     RedX;               //!< 赤成分に対するCIEXYZのX座標
    int32_t     RedY;               //!< 赤成分に対するCIEXYZのY座標
    int32_t     RedZ;               //!< 赤成分に対するCIEXYZのZ座標
    int32_t     GreenX;             //!< 緑成分に対するCIEXYZのX座標
    int32_t     GreenY;             //!< 緑成分に対するCIEXYZのY座標
    int32_t     GreenZ;             //!< 緑成分に対するCIEXYZのZ座標
    int32_t     BlueX;              //!< 青成分に対するCIEXYZのX座標
    int32_t     BlueY;              //!< 青成分に対するCIEXYZのY座標
    int32_t     BlueZ;              //!< 青成分に対するCIEXYZのZ座標
    uint32_t    GammaR;             //!< 赤成分のガンマ値.
    uint32_t    GammaG;             //!< 緑成分のガンマ値.
    uint32_t    GammaB;             //!< 青成分のガンマ値.

    uint32_t    Intent;             //!< レンダリング意図.
    uint32_t    ProfileData;        //!< プロファイルデータのオフセット(単位バイト).
    uint32_t    ProfileSize;        //!< プロファイルデータのサイズ'(単位バイト).
    uint32_t    Reserved;           //!< 予約領域(常に0).
};
#pragma pack( pop )


///////////////////////////////////////////////////////////////////////////////
// BMP_CORE_HEADER structure
///////////////////////////////////////////////////////////////////////////////
struct BMP_CORE_HEADER
{
    uint32_t     Size;
    uint16_t     Width;
    uint16_t     Height;
    uint16_t     Planes;
    uint16_t     BitCount;
};

///////////////////////////////////////////////////////////////////////////////
// ResBMP class
///////////////////////////////////////////////////////////////////////////////
class ResBMP
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Format
    ///////////////////////////////////////////////////////////////////////////
    enum Format
    {
        Format_RGB = 0,     // RGB形式  3コンポーネント.
        Format_RGBA,        // RGBA形式 4コンポーネント.
        Format_RGB_SRGB,    // RGB形式  sRGB空間  
        Format_RGBA_SRGB,   // RGBA形式 sRGB空間.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ResBMP();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ResBMP();

    //-------------------------------------------------------------------------
    //! @brief      ファイルから読み込みします.
    //!
    //! @param[in]      filename        ファイル名.
    //! @retval true    読み込みに成功.
    //! @retval false   読み込みに失敗.
    //-------------------------------------------------------------------------
    bool Load(const wchar_t* filename);

    //-------------------------------------------------------------------------
    //! @brief      メモリを解放します.
    //-------------------------------------------------------------------------
    void Release();

    //-------------------------------------------------------------------------
    //! @brief      画像の横幅を取得します.
    //!
    //! @return     画像の横幅を返却します.
    //-------------------------------------------------------------------------
    const uint32_t GetWidth() const;

    //-------------------------------------------------------------------------
    //! @brief      画像の縦幅を取得します.
    //!
    //! @return     画像の縦幅を返却します.
    //-------------------------------------------------------------------------
    const uint32_t GetHeight() const;

    //-------------------------------------------------------------------------
    //! @brief      フォーマットを取得します.
    //!
    //! @return     フォーマットを返却します.
    //-------------------------------------------------------------------------
    const uint32_t GetFormat() const;

    //-------------------------------------------------------------------------
    //! @brief      ピクセルデータを取得します.
    //!
    //! @return     ピクセルデータを返却します.
    //-------------------------------------------------------------------------
    const uint8_t* GetPixels() const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    uint32_t     m_Width;        //!< 画像の横幅です.
    uint32_t     m_Height;       //!< 画像の縦幅です.
    uint32_t     m_Format;       //!< フォーマットです.
    uint8_t*     m_pPixels;      //!< ピクセルデータです.

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
