//-----------------------------------------------------------------------------
// File : GameApp.h
// Desc : Game Application.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxMacro.h>
#include <fw/asdxApp.h>
#include <gfx/asdxCommandQueue.h>
#include <gfx/asdxSprite.h>
#include <gfx/asdxSampler.h>
#include <gfx/asdxTextureManager.h>
#include <gfx/asdxTarget.h>
#include "SpriteData.h"


///////////////////////////////////////////////////////////////////////////////
// GameApp class
///////////////////////////////////////////////////////////////////////////////
class GameApp : public asdx::App
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    using base = asdx::App;

    //=========================================================================
    // public variables.
    //=========================================================================

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    GameApp();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~GameApp();

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    asdx::WaitPoint         m_FrameWaitPoint;
    asdx::SpriteRenderer    m_SpriteRenderer;
    asdx::Sampler           m_LinearClamp;
    asdx::TextureHolder     m_SpriteChip;
    asdx::TextureHolder     m_TextureBG;
    asdx::ColorTarget       m_OffScreen;
    int                     m_OffsetBG0 = 0;
    int                     m_OffsetBG1 = 0;
    int                     m_OffsetBG2 = 0;

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      初期化時の処理です.
    //! 
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool OnInit() override;

    //-------------------------------------------------------------------------
    //! @brief      終了時の処理です.
    //-------------------------------------------------------------------------
    void OnTerm() override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム遷移時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnFrameMove(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      フレーム描画時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnFrameRender(const asdx::App::FrameEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      リサイズ時の処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnResize(const asdx::App::ResizeEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      キー処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnKey(const asdx::App::KeyEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      マウス処理です.
    //! 
    //! @param[in]      args        イベント引数.
    //-------------------------------------------------------------------------
    void OnMouse(const asdx::App::MouseEventArgs& args) override;

    //-------------------------------------------------------------------------
    //! @brief      タイピング時の処理です.
    //! 
    //! @param[in]      keyCode     キーコードです.
    //-------------------------------------------------------------------------
    void OnTyping(uint32_t keyCode) override;

    //-------------------------------------------------------------------------
    //! @brief      メッセージの処理です.
    //! 
    //! @param[in]      hWnd        ウィンドウハンドルです.
    //! @param[in]      msg         ウィンドウメッセージです.
    //! @param [in]     wp          メッセージの追加情報.
    //! @param [in]     lp          メッセージの追加情報.
    //-------------------------------------------------------------------------
    void OnMsgProc(HWND hWnd, UINT msg, WPARAM wp, LPARAM lp) override;
};