//-----------------------------------------------------------------------------
// File : asdxTarget.h
// Desc : Target Wrapper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <dxgi1_6.h>
#include <gfx/asdxView.h>


namespace asdx {

///////////////////////////////////////////////////////////////////////////////
// TargetDesc2D structure
///////////////////////////////////////////////////////////////////////////////
struct TargetDesc
{
    D3D12_RESOURCE_DIMENSION    Dimension;          //!< 次元です.
    uint64_t                    Alignment;          //!< アライメントです.
    uint64_t                    Width;              //!< 横幅です.
    uint32_t                    Height;             //!< 縦幅です.
    uint16_t                    DepthOrArraySize;   //!< 奥行 または 配列サイズです.
    uint16_t                    MipLevels;          //!< ミップレベル数です.
    DXGI_FORMAT                 Format;             //!< フォーマットです.
    DXGI_SAMPLE_DESC            SampleDesc;         //!< サンプル設定です.
    D3D12_RESOURCE_STATES       InitState;          //!< 初期ステート.
    float                       ClearColor[4];
    float                       ClearDepth;
    uint8_t                     ClearStencil;

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    TargetDesc()
    : Dimension         ( D3D12_RESOURCE_DIMENSION_UNKNOWN )
    , Alignment         ( 0 )
    , Width             ( 0 )
    , Height            ( 0 )
    , MipLevels         ( 0 )
    , DepthOrArraySize  ( 0 )
    , Format            ( DXGI_FORMAT_UNKNOWN )
    , InitState         ( D3D12_RESOURCE_STATE_COMMON )
    {
        SampleDesc.Count   = 0;
        SampleDesc.Quality = 0;

        ClearColor[0] = 1.0f;
        ClearColor[1] = 1.0f;
        ClearColor[2] = 1.0f;
        ClearColor[3] = 1.0f;
        ClearDepth    = 1.0f;
        ClearStencil  = 0;
    }
};

///////////////////////////////////////////////////////////////////////////////
// ColorTarget class
///////////////////////////////////////////////////////////////////////////////
class ColorTarget
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ColorTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ColorTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化成功.
    //! @retval false   初期化失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc);

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pSwapChain          スワップチェインです.
    //! @param[in]      backbufferIndex     バックバッファ番号です.
    //! @retval true    初期化成功.
    //! @retval false   初期化失敗.
    //-------------------------------------------------------------------------
    bool Init(IDXGISwapChain* pSwapChain, uint32_t backbufferIndex);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅
    //! @param[in]      height      縦幅.
    //! @retval true    リサイズに成功.
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      レンダーターゲットビューを取得します.
    //!
    //! @return     レンダーターゲットビューを返却します.
    //-------------------------------------------------------------------------
    IRenderTargetView* GetRTV() const;

    //-------------------------------------------------------------------------
    //! @brief      シェーダリソースビューを取得します.
    //!
    //! @return     シェーダリソースビューを返却します.
    //-------------------------------------------------------------------------
    IShaderResourceView* GetSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //!
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      sRGBフラグを取得します.
    //! 
    //! @return     sRGBフラグを返却します.
    //-------------------------------------------------------------------------
    bool IsSRGB() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>      m_pResource;
    RefPtr<IRenderTargetView>   m_pRTV;
    RefPtr<IShaderResourceView> m_pSRV;
    TargetDesc                  m_Desc;
    D3D12_RESOURCE_STATES       m_PrevState = D3D12_RESOURCE_STATE_COMMON;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// DepthTarget class
///////////////////////////////////////////////////////////////////////////////
class DepthTarget
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    DepthTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~DepthTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      device      グラフィックスデバイスです.
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //! @retval true    リサイズに成功
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      深度ステンシルビューを取得します.
    //!
    //! @return     深度ステンシルビューを返却します.
    //-------------------------------------------------------------------------
    IDepthStencilView* GetDSV() const;

    //-------------------------------------------------------------------------
    //! @brief      シェーダリソースビューを取得します.
    //!
    //! @return     シェーダリソースビューを返却します.
    //-------------------------------------------------------------------------
    IShaderResourceView* GetSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //! 
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>      m_pResource;
    RefPtr<IDepthStencilView>   m_pDSV;
    RefPtr<IShaderResourceView> m_pSRV;
    TargetDesc                  m_Desc;
    D3D12_RESOURCE_STATES       m_PrevState = D3D12_RESOURCE_STATE_COMMON;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};


///////////////////////////////////////////////////////////////////////////////
// ComputeTarget
///////////////////////////////////////////////////////////////////////////////
class ComputeTarget
{
public:
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    ComputeTarget();

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~ComputeTarget();

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      device      グラフィックスデバイスです.
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(const TargetDesc* pDesc, uint32_t stride = 0);

    //-------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //! 
    //! @param[in]      target      カラーターゲットです.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //-------------------------------------------------------------------------
    bool Init(ColorTarget& target);

    //-------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //-------------------------------------------------------------------------
    void Term();

    //-------------------------------------------------------------------------
    //! @brief      リサイズ処理を行います.
    //! 
    //! @param[in]      width       横幅.
    //! @param[in]      height      縦幅.
    //! @param[in]      depth       奥行.
    //! @retval true    リサイズに成功.
    //! @retval false   リサイズに失敗.
    //-------------------------------------------------------------------------
    bool Resize(uint32_t width, uint32_t height = 1, uint16_t depth = 1);

    //-------------------------------------------------------------------------
    //! @brief      リソースを取得します.
    //!
    //! @return     リソースを返却します.
    //-------------------------------------------------------------------------
    ID3D12Resource* GetResource() const;

    //-------------------------------------------------------------------------
    //! @brief      アンオーダードアクセスビューを取得します.
    //!
    //! @return     アンオーダードアクセスビューを返却します.
    //-------------------------------------------------------------------------
    const IUnorderedAccessView* GetUAV() const;

    //-------------------------------------------------------------------------
    //! @brief      シェーダリソースビューを取得します.
    //!
    //! @return     シェーダリソースビューを返却します.
    //-------------------------------------------------------------------------
    const IShaderResourceView* GetSRV() const;

    //-------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //! 
    //! @return     構成設定を返却します.
    //-------------------------------------------------------------------------
    TargetDesc GetDesc() const;

    //-------------------------------------------------------------------------
    //! @brief      ストライドサイズを取得します.
    //! 
    //! @return     ストライドサイズを返却します.
    //-------------------------------------------------------------------------
    uint32_t GetStride() const;

    //-------------------------------------------------------------------------
    //! @brief      デバッグ名を設定します.
    //!
    //! @param[in]      tag     タグ名.
    //-------------------------------------------------------------------------
    void SetName(LPCWSTR tag);

    //-------------------------------------------------------------------------
    //! @brief      UAVバリアを設定します.
    //! 
    //! @param[in]      pCmdList        コマンドリスト.
    //-------------------------------------------------------------------------
    void UAVBarrier(ID3D12GraphicsCommandList* pCmdList);

#if ASDX_ENABLE_SINGLE_THREAD
    //-------------------------------------------------------------------------
    //! @brief      ステート遷移を行います.
    //! 
    //! @param[in]      pCmdList    コマンドリスト.
    //! @param[in]      nextState   遷移後のステート.
    //-------------------------------------------------------------------------
    void ChangeState(ID3D12GraphicsCommandList* pCmdList, D3D12_RESOURCE_STATES nextState)
    {
        if (nextState == m_PrevState)
        { return; }

        D3D12_RESOURCE_BARRIER barrier = {};
        barrier.Type                    = D3D12_RESOURCE_BARRIER_TYPE_TRANSITION;
        barrier.Transition.pResource    = m_pResource.GetPtr();
        barrier.Transition.Subresource  = 0;
        barrier.Transition.StateBefore  = m_PrevState;
        barrier.Transition.StateAfter   = nextState;

        pCmdList->ResourceBarrier(1, &barrier);

        m_PrevState = nextState;
    }

    //-------------------------------------------------------------------------
    //! @brief      ステートを取得します.
    //! 
    //! @return     ステートを返却します.
    //-------------------------------------------------------------------------
    D3D12_RESOURCE_STATES GetState() const { return m_PrevState; }
#endif

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    RefPtr<ID3D12Resource>          m_pResource;
    RefPtr<IUnorderedAccessView>    m_pUAV;
    RefPtr<IShaderResourceView>     m_pSRV;
    TargetDesc                      m_Desc;
    D3D12_RESOURCE_STATES           m_PrevState = D3D12_RESOURCE_STATE_COMMON;
    uint32_t                        m_Stride    = 0;

    //=========================================================================
    // private methods.
    //=========================================================================
    /* NOTHING */
};

} // namespace asdx
