//-----------------------------------------------------------------------------
// File : asdxMath.h
// Desc : Math Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cstdint>
#include <cfloat>
#include <cmath>
#include <cassert>
#include <cstring>  // for memcpy.
#if _HAS_CXX20
#include <bit>
#endif


namespace asdx {

//-----------------------------------------------------------------------------
// Forward Declarations
//-----------------------------------------------------------------------------
struct Vector2;
struct Vector3;
struct Vector4;
struct Matrix;
struct Quaternion;
struct Transform3x4;

//-----------------------------------------------------------------------------
// Type defines.
//-----------------------------------------------------------------------------
using half = uint16_t;


//-----------------------------------------------------------------------------
// Constant Variables
//-----------------------------------------------------------------------------
static constexpr float F_PI      = 3.1415926535897932384626433832795f;      //!< πです.
static constexpr float F_2PI     = 6.283185307179586476925286766559f;       //!< 2πです.
static constexpr float F_1DIVPI  = 0.31830988618379067153776752674503f;     //!< 1/πです.
static constexpr float F_PIDIV2  = 1.5707963267948966192313216916398f;      //!< π/2です.
static constexpr float F_PIDIV3  = 1.0471975511965977461542144610932f;      //!< π/3です.
static constexpr float F_PIDIV4  = 0.78539816339744830961566084581988f;     //!< π/4です.
static constexpr float F_PIDIV6  = 0.52359877559829887307710723054658f;     //!< π/6です.
static constexpr float F_EPSILON = 1.192092896e-07f;                        //!< マシンイプシロン(float).

static constexpr double D_PI      = 3.1415926535897932384626433832795;      //!< πです.
static constexpr double D_2PI     = 6.283185307179586476925286766559;       //!< 2πです.
static constexpr double D_1DVIPI  = 0.31830988618379067153776752674503;     //!< 1/πです.
static constexpr double D_PIDIV2  = 1.5707963267948966192313216916398;      //!< π/2です.
static constexpr double D_PIDIV3  = 1.0471975511965977461542144610932;      //!< π/3です.
static constexpr double D_PIDIV4  = 0.78539816339744830961566084581988;     //!< π/4です.
static constexpr double D_PIDIV6  = 0.52359877559829887307710723054658;     //!< π/6です.
static constexpr double D_EPSILON = 2.2204460492503131e-016;                //!< マシンイプシロン(double)

static constexpr float ONB_EPSILON = 0.01f;                                 //!< 正規直交規定を算出する際に用いるイプシロン値です.


///////////////////////////////////////////////////////////////////////////////
// PLANE_TYPE enum
///////////////////////////////////////////////////////////////////////////////
enum PLANE_TYPE
{
    PLANE_LEFT      = 0,        //!< 左.
    PLANE_RIGHT     = 1,        //!< 右.
    PLANE_BOTTOM    = 2,        //!< 底面.
    PLANE_TOP       = 3,        //!< 天面.
    PLANE_NEAR      = 4,        //!< ニア平面.
    PLANE_FAR       = 5,        //!< ファー平面.
    PLANE_EXTRA0    = 6,        //!< シャドウ用追加平面0.
    PLANE_EXTRA1    = 7,        //!< シャドウ用追加平面1.

    PLANE_COUNT        = 6,     //!< 通常カリング用平面数.
    SHADOW_PLANE_COUNT = 8,     //!< シャドウカリング用平面数.
};


//-----------------------------------------------------------------------------
// Function
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//! @brief      度をラジアンに変換します.
//!
//! @param [in]     degree      角度(度)
//! @return     度をラジアンに変換した結果を返却します.
//-----------------------------------------------------------------------------
constexpr float ToRadian(float degree) noexcept;

//-----------------------------------------------------------------------------
//! @brief      度をラジアンに変換します.
//!
//! @param [in]     degree      角度(度)
//! @return     度をラジアンに変換した結果を返却します.
//-----------------------------------------------------------------------------
constexpr double ToRadian(double degree) noexcept;

//-----------------------------------------------------------------------------
//! @brief      ラジアンを度に変換します.
//!
//! @param [in]     radian      角度(ラジアン)
//! @return     ラジアンを度に変換した結果を返却します.
//-----------------------------------------------------------------------------
constexpr float ToDegree(float radian) noexcept;

//-----------------------------------------------------------------------------
//! @brief      ラジアンを度に変換します.
//!
//! @param [in]     radian      角度(ラジアン)
//! @return     ラジアンを度に変換した結果を返却します.
//-----------------------------------------------------------------------------
constexpr double ToDegree(double radian) noexcept;

//-----------------------------------------------------------------------------
//! @brief      値がゼロであるかどうか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     値がゼロであるとみなせる場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsZero(float value) noexcept;

//-----------------------------------------------------------------------------
//! @brief      値がゼロであるかどうか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     値がゼロであるとみなせる場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsZero(double value) noexcept;

//-----------------------------------------------------------------------------
//! @brief      値が等価であるか判定します.
//!
//! @param [in]     a           判定する値.
//! @param [in]     b           判定する値.
//! @return     値が等価であるとみなせる場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsEqual(float a, float b) noexcept;

//-----------------------------------------------------------------------------
//! @brief      値が等価であるか判定します.
//!
//! @param [in]     a           判定する値.
//! @param [in]     b           判定する値.
//! @return     値が等価であるとみなせる場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsEqual(double a, double b) noexcept;

//-----------------------------------------------------------------------------
//! @brief      非数であるか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     非数であった場合にtrueを返却します.
//-----------------------------------------------------------------------------
constexpr bool IsNaN(float value) noexcept;

//-----------------------------------------------------------------------------
//! @brief      非数であるか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     非数であった場合にtrueを返却します.
//-----------------------------------------------------------------------------
constexpr bool IsNaN(double value) noexcept;

//-----------------------------------------------------------------------------
//! @brief      無限大であるか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     無限大であった場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsInf(float value);

//-----------------------------------------------------------------------------
//! @brief      無限大であるか判定します.
//!
//! @param [in]     value       判定する値.
//! @return     無限大であった場合にtrueを返却します.
//-----------------------------------------------------------------------------
bool IsInf(double value);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
float Hypot(float x, float y);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @param [in]     z       値3
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
float Hypot(float x, float y, float z);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @param [in]     z       値3
//! @param [in]     w       値4
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
float Hypot(float x, float y, float z, float w);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
double Hypot(double x, double y);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @param [in]     z       値3
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
double Hypot(double x, double y, double z);

//-----------------------------------------------------------------------------
//! @brief      平方和の平方根を求めます.
//!
//! @param [in]     x       値1
//! @param [in]     y       値2
//! @param [in]     z       値3
//! @param [in]     w       値4
//! @return     平方和の平方根を返却します.
//-----------------------------------------------------------------------------
double Hypot(double x, double y, double z, double w);

//-----------------------------------------------------------------------------
//! @brief      階乗を計算します.
//!
//! @param [in]     number      階乗を計算する値.
//! @return     (number)!を計算した値を返却します.
//-----------------------------------------------------------------------------
uint32_t Fact(uint32_t number);

//-----------------------------------------------------------------------------
//! @brief      2重階乗を計算します.
//!
//! @param [in]     number      2重階乗を計算する値.
//! @return     (number)!!を計算した値を返却します.
//-----------------------------------------------------------------------------
uint32_t DblFact(uint32_t number);

//-----------------------------------------------------------------------------
//! @brief      順列を計算します.
//!
//! @param [in]     n       総数.
//! @param [in]     r       選択数.
//! @return     n個のものからr個とった順列を返却します.
//-----------------------------------------------------------------------------
uint32_t Perm(uint32_t n, uint32_t r);

//-----------------------------------------------------------------------------
//! @brief      組合せを計算します.
//!
//! @param [in]     n       総数.
//! @param [in]     r       選択数.
//! @return     n個のものからr個とった組合せを返却します.
//-----------------------------------------------------------------------------
uint32_t Comb(uint32_t n, uint32_t r);

//-----------------------------------------------------------------------------
//! @brief      float型からhalf型に変換します.
//!
//! @param [in]     value       half型に変換する値.
//! @return     半精度浮動小数表現に変換した結果を返却します.
//-----------------------------------------------------------------------------
half ToHalf(float value);

//-----------------------------------------------------------------------------
//! @brief      half型からfloat型に変換します.
//!
//! @param [in]     value       float型に変換する値.
//! @return     単精度浮動小数表現に変換した結果を返却します.
//-----------------------------------------------------------------------------
float ToFloat(half value);

//-----------------------------------------------------------------------------
//! @brief      線形補間を行います.
//!
//! @param [in]     a           入力値.
//! @param [in]     b           入力値.
//! @param [in]     amount      重み(0～1の値範囲で指定).
//! @return     線形補間の結果を返却します.
//-----------------------------------------------------------------------------
constexpr float Lerp(float a, float b, float amount) noexcept;

//-----------------------------------------------------------------------------
//! @brief      線形補間を行います.
//!
//! @param [in]     a           入力値.
//! @param [in]     b           入力値.
//! @param [in]     amount      重み(0～1の値範囲で指定).
//! @return     線形補間の結果を返却します.
//-----------------------------------------------------------------------------
constexpr double Lerp(double a, double b, double amount) noexcept;

//-----------------------------------------------------------------------------
//! @brief      2つの値のうち，大きい方を返却します.
//!
//! @param [in]     a       判定する値.
//! @param [in]     b       判定する値.
//! @return     2つの値のうち，大きい方を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
constexpr T Max(const T& a, const T& b) noexcept
{ return (a > b) ? a : b; }

//-----------------------------------------------------------------------------
//! @brief      2つの値のうち，小さい方の値を返却します.
//!
//! @param [in]     a       判定する値.
//! @param [in]     b       判定する値.
//! @return     2つの値のうち，小さい方の値を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
constexpr T Min(const T& a, const T& b) noexcept
{ return (a < b) ? a : b; }

//-----------------------------------------------------------------------------
//! @brief      値を指定された範囲内に収めます.
//!
//! @param [in]     value   クランプする値.
//! @param [in]     a       最小値.
//! @param [in]     b       最大値.
//! @return     値をaからbの範囲内に収めた結果を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
constexpr T Clamp(const T& value, const T& mini, const T& maxi) noexcept
{ return Max( mini, Min( maxi, value ) ); }

//-----------------------------------------------------------------------------
//! @brief      値を0～1に収めます.
//!
//! @param [in]     value   クランプする値.
//! @return     値を0から1の範囲内に収めた結果を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
constexpr T Saturate(const T& value) noexcept
{ return Clamp( value, T(0), T(1) ); }

//-----------------------------------------------------------------------------
//! @brief      指定された値の符号を返却します.
//!
//! @param [in]     value   符号を取得する値.
//! @return     符号が正である場合には1を，負である場合には-1を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
constexpr T Sign(T value) noexcept
{ return (value < T(0)) ? T(-1) : T(1); }

//-----------------------------------------------------------------------------
//! @brief      指定された数値の倍数に切り上げます.
//!
//! @param [in]     val     数値.
//! @param [in]     base    倍数.
//! @return     val を base の倍数に切り上げた結果を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
T RoundUp(T val, T base)
{ return (val + (base - 1)) & ~(base - 1); }

//-----------------------------------------------------------------------------
//! @brief      指定された数値の倍数に切り下げます.
//!
//! @param [in]     val     数値.
//! @param [in]     base    倍数.
//! @return     val を base の倍数に切り下げた結果を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
T RoundDown(T val, T base)
{ return val & ~(base - 1); }

//-----------------------------------------------------------------------------
//! @brief      指定された値で切り上げを考慮した除算を行います.
//! 
//! @param[in]      val     数値
//! @param[in]      div     割る数.
//! @return     val を div で除算して切り上げた結果を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
T RoundDiv(T val, T div)
{ return (val + (div - 1)) / div; }

//-----------------------------------------------------------------------------
//! @brief      指定範囲内で繰り返します.
//! 
//! @param[in]      value       値.
//! @param[in]      low         下限値.
//! @param[in]      high        上限値.
//! @return     指定範囲内に収めた値を返却します.
//-----------------------------------------------------------------------------
template<typename T> inline
T Wrap(T value, T low, T high)
{
    assert(low < high);
    const T n = (value - low) % (high - low);
    return (n >= 0) ? (n + low) : (n + high);
}

//-----------------------------------------------------------------------------
//! @brief      指定範囲内で繰り返します.
//! 
//! @param[in]      value       値.
//! @param[in]      low         下限値.
//! @param[in]      high        上限値.
//! @return     指定範囲内に収めた値を返却します.
//-----------------------------------------------------------------------------
template<> inline
float Wrap<float>(float value, float low, float high)
{
    assert(low < high);
    const float n = fmodf(value - low, high - low);
    return (n >= 0.0f) ? (n + low) : (n + high);
}

//-----------------------------------------------------------------------------
//! @brief      指定範囲内で繰り返します.
//! 
//! @param[in]      value       値.
//! @param[in]      low         下限値.
//! @param[in]      high        上限値.
//! @return     指定範囲内に収めた値を返却します.
//-----------------------------------------------------------------------------
template<> inline
double Wrap<double>(double value, double low, double high)
{
    assert(low < high);
    const double n = fmod(value - low, high - low);
    return (n >= 0.0) ? (n + low) : (n + high);
}

//-----------------------------------------------------------------------------
//! @brief      2のべき乗かどうかをチェックします.
//! 
//! @param[in]      val     チェックする値.
//! @retval true    2のべき乗です.
//! @retval false   2のべき乗ではありません.
//-----------------------------------------------------------------------------
template<typename T> inline
bool IsPowerOf2(T val)
{ return (val != 0) && !(val & (val - 1)); }

///////////////////////////////////////////////////////////////////////////////
// Vector2 strucutre
///////////////////////////////////////////////////////////////////////////////
struct Vector2
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     lhs     乗算するスカラー値.
    //! @param [in]     rhs     乗算されるベクトル.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    friend Vector2 operator* (float lhs, const Vector2& rhs);

public:
    //=========================================================================
    // public variables
    //=========================================================================
    float x = 0.0f;  //!< X成分です.
    float y = 0.0f;  //!< Y成分です.

    //=========================================================================
    // public methods
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Vector2() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     pValues     要素数2の配列.
    //-------------------------------------------------------------------------
    explicit Vector2(const float* pValues);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       設定値.
    //-------------------------------------------------------------------------
    explicit Vector2(float value);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     nx           X成分.
    //! @param [in]     ny           Y成分.
    //-------------------------------------------------------------------------
    Vector2(float nx, float ny);

    //-------------------------------------------------------------------------
    //! @brief      float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      加算代入演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2& operator += (const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      減算代入演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2& operator -= (const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value      乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2&  operator *= (float value);

    //-------------------------------------------------------------------------
    //! @brief      除算代入演算子です.
    //!
    //! @param [in]     value      除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2& operator /= (float value);

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value       代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    Vector2& operator = (const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身の値を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //!
    //! @return     負符号を付けた値を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator + (const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator - (const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value      乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator * (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      除算演算子です.
    //!
    //! @param [in]     value       除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector2 operator / (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator == (const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が非等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator != (const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さを求めます.
    //!
    //! @return     ベクトルの長さを返却します.
    //-------------------------------------------------------------------------
    float Length() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さの2乗値を求めます.
    //!
    //! @return     ベクトルの長さの2乗値を返却します.
    //-------------------------------------------------------------------------
    float LengthSq() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector2& Normalize();

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     reset       長さが0の場合に設定する値.
    //! @return     ベクトルの長さが0の場合はvalueを，そうでないときは正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector2& SafeNormalize(const Vector2& reset);

    //-------------------------------------------------------------------------
    //! @brief      各成分の絶対値を求めます.
    //!
    //! @param [in]     value       絶対値を求める値.
    //! @return     各成分の絶対値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Abs(const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      値を指定された範囲内に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @param [in]     a           最小値.
    //! @param [in]     b           最大値.
    //! @return     クランプされた値を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Clamp(const Vector2& value, const Vector2& mini, const Vector2& maxi);

    //-------------------------------------------------------------------------
    //! @brief      指定された値を0～1の範囲に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @return     クランプされた値.
    //-------------------------------------------------------------------------
    static Vector2 Saturate(const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離を求めます.
    //!
    //! @param [in]     lhs     入力ベクトル.
    //! @param [in]     rhs     入力ベクトル.
    //! @return     2つのベクトル間の距離を返却します.
    //-------------------------------------------------------------------------
    static float Distance(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離の2乗値を求めます.
    //!
    //! @param [in]     lhs     入力ベクトル.
    //! @param [in]     rhs     入力ベクトル.
    //! @return     2つのベクトル間の距離の2乗値を返却します.
    //-------------------------------------------------------------------------
    static float DistanceSq(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの内積を求めます.
    //!
    //! @param [in]     lhs     入力ベクトル.
    //! @param [in]     rhs     入力ベクトル.
    //! @return     ベクトルの内積を返却します.
    //-------------------------------------------------------------------------
    static float Dot(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector2 Normalize(const Vector2& value);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @param [in]     set         長さが0の場合に設定するベクトル.
    //! @return     ベクトルの長さが0でなければ正規化したベクトルを返却,
    //!             長さが0の場合はsetを返却します.
    //-------------------------------------------------------------------------
    static Vector2 SafeNormalize(const Vector2& value, const Vector2& set);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトルの交差角を求めます.
    //!
    //! @param [in]     lhs     入力ベクトル.
    //! @param [in]     rhs     入力ベクトル.
    //! @return     2つのベクトルの交差角をラジアンで返却します.
    //-------------------------------------------------------------------------
    static float ComputeCrossingAngle(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最小値を求めます.
    //!
    //! @param [in]     lhs     比較する値.
    //! @param [in]     rhs     比較する値.
    //! @return     各成分の最小値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Min(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最大値を求めます.
    //!
    //! @param [in]     lhs     比較する値.
    //! @param [in]     rhs     比較する値.
    //! @return     各成分の最大値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Max(const Vector2& lhs, const Vector2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      指定された法線を持つ表面の入射ベクトルから，反射ベクトルを求めます.
    //!
    //! @param [in]     i           入射ベクトル.
    //! @param [in]     n           法線ベクトル.
    //! @return     反射ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector2 Reflect(const Vector2& i, const Vector2& n);

    //-------------------------------------------------------------------------
    //! @brief      指定された法線を持つ表面の入射ベクトルと屈折角から，屈折ベクトルを求めます.
    //!
    //! @param [in]     i           入射ベクトル.
    //! @param [in]     n           法線ベクトル.
    //! @param [in]     eta         屈折率.
    //! @return     屈折ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector2 Refract(const Vector2& i, const Vector2& n, float eta);

    //-------------------------------------------------------------------------
    //! @brief      重心座標上の点を求めます.
    //!
    //! @param [in]     p0      入力ベクトル.
    //! @param [in]     p1      入力ベクトル.
    //! @param [in]     p2      入力ベクトル.
    //! @param [in]     a       重み.
    //! @param [in]     b       重み.
    //! @return     重心座標上の点を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Barycentric(const Vector2& p0, const Vector2& p1, const Vector2& p2, float a, float b);

    //-------------------------------------------------------------------------
    //! @brief      エルミートスプライン補間を行います.
    //!
    //! @param [in]     a           入力位置ベクトル.
    //! @param [in]     t1          入力接ベクトル.
    //! @param [in]     b           入力位置ベクトル.
    //! @param [in]     t2          入力接ベクトル.
    //! @param [in]     amount      重み.
    //! @return     エルミートスプライン補間を行った結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Hermite(const Vector2& a, const Vector2& t1, const Vector2& b, const Vector2& t2, float amount);

    //-------------------------------------------------------------------------
    //! @brief      Catmull-Rom補間を行います.
    //!
    //! @param [in]     a           補間の最初の位置.
    //! @param [in]     b           補間の2番目の位置.
    //! @param [in]     c           補間の3番目の位置.
    //! @param [in]     d           補間の4番目の位置.
    //! @param [in]     amount      加重係数.
    //! @return     Catmull-Rom補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 CatmullRom(const Vector2& a, const Vector2& b, const Vector2& c, const Vector2& d, float amount);

    //-------------------------------------------------------------------------
    //! @brief      線形補間を行います.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み(0～1の値範囲で指定).
    //! @return     線形補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 Lerp(const Vector2& a, const Vector2& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      3次方程式を用いて，2つの値の間を補間します.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み.
    //! @return     補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector2 SmoothStep(const Vector2& a, const Vector2& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いて，ベクトルを変換します.
    //!
    //! @param [in]     position    入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     変換されたベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector2 Transform(const Vector2& position, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いて，法線ベクトルを変換します.
    //!
    //! @param [in]     normal      入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     変換された法線ベクトル.
    //-------------------------------------------------------------------------
    static Vector2 TransformNormal(const Vector2& normal, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いてベクトルを変換し，変換結果をw=1に射影します.
    //!
    //! @param [in]     coord       入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     行列変換後, w=1に射影されたベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector2 TransformCoord(const Vector2& coords, const Matrix& matrix);
};


///////////////////////////////////////////////////////////////////////////////
// Vector3 structure
///////////////////////////////////////////////////////////////////////////////
struct Vector3
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     lhs     乗算するスカラー値.
    //! @param [in]     rhs     乗算されるベクトル.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    friend Vector3 operator * (float lhs, const Vector3& rhs);

public:
    //=========================================================================
    // public variables
    //=========================================================================
    float x = 0.0f;  //!< X成分です.
    float y = 0.0f;  //!< Y成分です.
    float z = 0.0f;  //!< Z成分です.

    //=========================================================================
    // public methods
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Vector3() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     pValeus     要素数3の配列.
    //-------------------------------------------------------------------------
    explicit Vector3(const float* pValues);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       設定値.
    //-------------------------------------------------------------------------
    explicit Vector3(float value);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       2次元ベクトル.
    //! @param [in]     nz          Z成分.
    //-------------------------------------------------------------------------
    Vector3(const Vector2& value, float nz);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     nx           X成分.
    //! @param [in]     ny           Y成分.
    //! @param [in]     nz           Z成分.
    //-------------------------------------------------------------------------
    Vector3(float nx, float ny, float nz);

    //-------------------------------------------------------------------------
    //! @brief      float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      加算代入演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3& operator += (const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      減算代入演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3& operator -= (const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value      乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3& operator *= (float value);

    //-------------------------------------------------------------------------
    //! @brief      除算代入演算子です.
    //!
    //! @param [in]     value      除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3& operator /= (float value);

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value       代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    Vector3& operator = (const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身の値を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //!
    //! @return     負符号を付けた値を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator + (const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator - (const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value      乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator * (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      除算演算子です.
    //!
    //! @param [in]     value      除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector3 operator / (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator == (const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が非等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator != (const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さを求めます.
    //!
    //! @return     ベクトルの長さを返却します.
    //-------------------------------------------------------------------------
    float Length() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さの2乗値を求めます.
    //!
    //! @return     ベクトルの長さの2乗値を返却します.
    //-------------------------------------------------------------------------
    float LengthSq() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector3& Normalize();

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     set     長さが0の場合に設定する値.
    //! @return     ベクトルの長さが0の場合はvalueを，そうでないときは正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector3& SafeNormalize(const Vector3& set);

    //-------------------------------------------------------------------------
    //! @brief      各成分の絶対値を求めます.
    //!
    //! @param [in]     value       絶対値を求める値.
    //! @return     各成分の絶対値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Abs(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      値を指定された範囲内に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @param [in]     a           最小値.
    //! @param [in]     b           最大値.
    //! @return     クランプされた値を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Clamp(const Vector3& value, const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      指定された値を0～1の範囲に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @return     クランプされた値.
    //-------------------------------------------------------------------------
    static Vector3 Saturate(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     2つのベクトル間の距離を返却します.
    //-------------------------------------------------------------------------
    static float Distance(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離の2乗値を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     2つのベクトル間の距離の2乗値を返却します.
    //-------------------------------------------------------------------------
    static float DistanceSq(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの内積を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     ベクトルの内積を返却します.
    //-------------------------------------------------------------------------
    static float Dot(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの外積を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     ベクトルの外積を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Cross(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 Normalize(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @param [in]     set         長さが0の場合に設定するベクトル.
    //! @return     ベクトルの長さが0でなければ正規化したベクトルを返却,
    //!             長さが0の場合はsetを返却します.
    //-------------------------------------------------------------------------
    static Vector3 SafeNormalize(const Vector3& value, const Vector3& set);

    //-------------------------------------------------------------------------
    //! @brief      三角形の法線ベクトルを求めます.
    //!
    //! @param [in]     p1          三角形を構成する頂点.
    //! @param [in]     p2          三角形を構成する頂点.
    //! @param [in]     p3          三角形を構成する頂点.
    //! @return     法線ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 ComputeNormal(const Vector3& p1, const Vector3& p2, const Vector3& p3);

    //-------------------------------------------------------------------------
    //! @brief      四角形の法線ベクトルを求めます.
    //!
    //! @param [in]     p1          四角形を構成する頂点.
    //! @param [in]     p2          四角形を構成する頂点.
    //! @param [in]     p3          四角形を構成する頂点.
    //! @param [in]     p4          四角形を構成する頂点.
    //! @return     法線ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 ComputeQuadNormal(const Vector3& p1, const Vector3& p2, const Vector3& p3, const Vector3& p4);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトルの交差角を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [out]    result      2つのベクトルの交差角(ラジアン).
    //-------------------------------------------------------------------------
    static float ComputeCrossingAngle(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最小値を求めます.
    //!
    //! @param [in]     a           比較する値.
    //! @param [in]     b           比較する値.
    //! @return     各成分の最小値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Min(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最大値を求めます.
    //!
    //! @param [in]     a           比較する値.
    //! @param [in]     b           比較する値.
    //! @return     各成分の最大値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Max(const Vector3& a, const Vector3& b);

    //-------------------------------------------------------------------------
    //! @brief      指定された法線を持つ表面の入射ベクトルから，反射ベクトルを求めます.
    //!
    //! @param [in]     i           入射ベクトル.
    //! @param [in]     n           法線ベクトル.
    //! @return     反射ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 Reflect(const Vector3& i, const Vector3& n);

    //-------------------------------------------------------------------------
    //! @brief      指定された法線を持つ表面の入射ベクトルと屈折角から，屈折ベクトルを求めます.
    //!
    //! @param [in]     i           入射ベクトル.
    //! @param [in]     n           法線ベクトル.
    //! @param [in]     eta         屈折率.
    //! @return     屈折ベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 Refract(const Vector3& i, const Vector3& n, float eta);

    //-------------------------------------------------------------------------
    //! @brief      重心座標上の点を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     c           入力ベクトル.
    //! @param [in]     amount1     重み.
    //! @param [in]     amount2     重み.
    //! @return     重心座標上の点を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Barycentric(const Vector3& a, const Vector3& b, const Vector3& , float f, float g);

    //-------------------------------------------------------------------------
    //! @brief      エルミートスプライン補間を行います.
    //!
    //! @param [in]     a           入力位置ベクトル.
    //! @param [in]     t1          入力接ベクトル.
    //! @param [in]     b           入力位置ベクトル.
    //! @param [in]     t2          入力接ベクトル.
    //! @param [in]     amount      重み.
    //! @return     エルミートスプライン補間を行った結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Hermite(const Vector3& a, const Vector3& t1, const Vector3& b, const Vector3& t2, float amount);

    //-------------------------------------------------------------------------
    //! @brief      Catmull-Rom補間を行います.
    //!
    //! @param [in]     a           補間の最初の位置.
    //! @param [in]     b           補間の2番目の位置.
    //! @param [in]     c           補間の3番目の位置.
    //! @param [in]     d           補間の4番目の位置.
    //! @param [in]     amount      加重係数.
    //! @return     Catmull-Rom補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 CatmullRom(const Vector3& a, const Vector3& b, const Vector3& c, const Vector3& d, float amount);

    //-------------------------------------------------------------------------
    //! @brief      線形補間を行います.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み(0～1の値範囲で指定).
    //! @return     線形補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Lerp(const Vector3& a, const Vector3& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      3次方程式を用いて，2つの値の間を補間します.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み.
    //! @return     補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 SmoothStep(const Vector3& a, const Vector3& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いて，ベクトルを変換します.
    //!
    //! @param [in]     position    入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     変換されたベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 Transform(const Vector3& position, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いて，法線ベクトルを変換します.
    //!
    //! @param [in]     normal      入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     変換された法線ベクトル.
    //-------------------------------------------------------------------------
    static Vector3 TransformNormal(const Vector3& normal, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いてベクトルを変換し，変換結果をw=1に射影します.
    //!
    //! @param [in]     coord       入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     行列変換後, w=1に射影されたベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector3 TransformCoord(const Vector3& coord, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      スカラー3重積を計算します.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     c           入力ベクトル.
    //! @return     スカラー3重積の演算結果を返却します.
    //-------------------------------------------------------------------------
    static float ScalarTriple(const Vector3& a, const Vector3& b, const Vector3& c);

    //-------------------------------------------------------------------------
    //! @brief      ベクトル3重積を計算します.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     c           入力ベクトル.
    //! @return     ベクトル3重積の演算結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 VectorTriple(const Vector3& a, const Vector3& b, const Vector3& c);

    //-------------------------------------------------------------------------
    //! @brief      四元数でベクトルを回転させます.
    //!
    //! @param[in]      value       ベクトル.
    //! @param[in]      rotation    四元数.
    //! @return     回転した結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 Rotate(const Vector3& value, const Quaternion& rotation);

    //-------------------------------------------------------------------------
    //! @brief      四元数でベクトルを逆回転させます.
    //!
    //! @param[in]      value       ベクトル.
    //! @param[in]      rotation    四元数.
    //! @return     逆回転した結果を返却します.
    //-------------------------------------------------------------------------
    static Vector3 InverseRotate(const Vector3& value, const Quaternion& rotation);
};


///////////////////////////////////////////////////////////////////////////////
// Vector4 structure
///////////////////////////////////////////////////////////////////////////////
struct Vector4
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     lhs     乗算するスカラー値.
    //! @param [in]     rhs     乗算されるベクトル.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    friend Vector4   operator *  (float lhs, const Vector4& rhs);

public:
    //=========================================================================
    // private variables
    //=========================================================================
    float x = 0.0f;      //!< X成分です.
    float y = 0.0f;      //!< Y成分です.
    float z = 0.0f;      //!< Z成分です.
    float w = 0.0f;      //!< W成分です.

    //=========================================================================
    // public methods
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Vector4() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     pValeus     要素数4の配列.
    //-------------------------------------------------------------------------
    explicit Vector4(const float* pValues);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       設定値.
    //-------------------------------------------------------------------------
    explicit Vector4(float value);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       2次元ベクトル.
    //! @param [in]     nz          Z成分.
    //! @param [in]     nw          W成分.
    //-------------------------------------------------------------------------
    Vector4(const Vector2& value, float nz, float nw);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     value       3次元ベクトル.
    //! @param [in]     nw          W成分.
    //-------------------------------------------------------------------------
    Vector4(const Vector3& value, float nw);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     nx           X成分.
    //! @param [in]     ny           Y成分.
    //! @param [in]     nz           Z成分.
    //! @param [in]     nw           W成分.
    //-------------------------------------------------------------------------
    Vector4(float nx, float ny, float nz, float nw);

    //-------------------------------------------------------------------------
    //! @brief      float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      加算代入演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4& operator += (const Vector4& value);

    //-------------------------------------------------------------------------
    //! @brief      減算代入演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4& operator -= (const Vector4& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value       乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4& operator *= (float value);

    //-------------------------------------------------------------------------
    //! @brief      除算代入演算子です.
    //!
    //! @param [in]     value       除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4& operator /= (float value);

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value       代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    Vector4& operator = (const Vector4& value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身の値を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //!
    //! @return     負符号を付けた値を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator + (const Vector4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator - (const Vector4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value       乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator * (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      除算演算子です.
    //!
    //! @param [in]     value       除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Vector4 operator / (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator == (const Vector4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @return     値が非等価であればtrue, そうでなければfalseを返却します.
    //-------------------------------------------------------------------------
    bool operator != (const Vector4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さを求めます.
    //!
    //! @return     ベクトルの長さを返却します.
    //-------------------------------------------------------------------------
    float Length() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの長さの2乗値を求めます.
    //!
    //! @return     ベクトルの長さの2乗値を返却します.
    //-------------------------------------------------------------------------
    float LengthSq() const;

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector4& Normalize();

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     set       長さが0の場合に設定する値.
    //! @return     ベクトルの長さが0の場合はvalueを，そうでないときは正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector4& SafeNormalize(const Vector4& set);

    //-------------------------------------------------------------------------
    //! @brief      各成分の絶対値を求めます.
    //!
    //! @param [in]     value       絶対値を求める値.
    //! @return     各成分の絶対値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Abs(const Vector4& v);

    //-------------------------------------------------------------------------
    //! @brief      値を指定された範囲内に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @param [in]     a           最小値.
    //! @param [in]     b           最大値.
    //! @return     クランプされた値を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Clamp(const Vector4& value, const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      指定された値を0～1の範囲に制限します.
    //!
    //! @param [in]     value       クランプする値.
    //! @return     クランプされた値.
    //-------------------------------------------------------------------------
    static Vector4 Saturate(const Vector4& value);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     2つのベクトル間の距離を返却します.
    //-------------------------------------------------------------------------
    static float Distance(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトル間の距離の2乗値を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     2つのベクトル間の距離の2乗値を返却します.
    //-------------------------------------------------------------------------
    static float DistanceSq(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの内積を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     ベクトルの内積を返却します.
    //-------------------------------------------------------------------------
    static float Dot(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルを正規化します.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @return     正規化したベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector4 Normalize(const Vector4& value);

    //-------------------------------------------------------------------------
    //! @brief      ベクトルの正規化を試みます.
    //!
    //! @param [in]     value       正規化するベクトル.
    //! @param [in]     set         長さが0の場合に設定するベクトル.
    //! @return     ベクトルの長さが0でなければ正規化したベクトルを返却,
    //!             長さが0の場合はsetを返却します.
    //-------------------------------------------------------------------------
    static Vector4 SafeNormalize(const Vector4& value, const Vector4& set);

    //-------------------------------------------------------------------------
    //! @brief      2つのベクトルの交差角を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @return     2つのベクトルの交差角をラジアンで返却します.
    //-------------------------------------------------------------------------
    static float ComputeCrossingAngle(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最小値を求めます.
    //!
    //! @param [in]     a           比較する値.
    //! @param [in]     b           比較する値.
    //! @return     各成分の最小値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Min(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      各成分の最大値を求めます.
    //!
    //! @param [in]     a           比較する値.
    //! @param [in]     b           比較する値.
    //! @return     各成分の最大値を求め，その結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Max(const Vector4& a, const Vector4& b);

    //-------------------------------------------------------------------------
    //! @brief      重心座標上の点を求めます.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     c           入力ベクトル.
    //! @param [in]     amount1     重み.
    //! @param [in]     amount2     重み.
    //! @return     重心座標上の点を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Barycentric(const Vector4& a, const Vector4& b, const Vector4& c, float f, float g);

    //-------------------------------------------------------------------------
    //! @brief      エルミートスプライン補間を行います.
    //!
    //! @param [in]     a           入力位置ベクトル.
    //! @param [in]     t1          入力接ベクトル.
    //! @param [in]     b           入力位置ベクトル.
    //! @param [in]     t2          入力接ベクトル.
    //! @param [in]     amount      重み.
    //! @return     エルミートスプライン補間を行った結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Hermite(const Vector4& a, const Vector4& t1, const Vector4& b, const Vector4& t2, float amount);

    //-------------------------------------------------------------------------
    //! @brief      Catmull-Rom補間を行います.
    //!
    //! @param [in]     a           補間の最初の位置.
    //! @param [in]     b           補間の2番目の位置.
    //! @param [in]     c           補間の3番目の位置.
    //! @param [in]     d           補間の4番目の位置.
    //! @param [in]     amount      加重係数.
    //! @return     Catmull-Rom補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 CatmullRom(const Vector4& a, const Vector4& b, const Vector4& c, const Vector4& d, float amount);

    //-------------------------------------------------------------------------
    //! @brief      線形補間を行います.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み(0～1の値範囲で指定).
    //! @return     線形補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 Lerp(const Vector4& a, const Vector4& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      3次方程式を用いて，2つの値の間を補間します.
    //!
    //! @param [in]     a           入力ベクトル.
    //! @param [in]     b           入力ベクトル.
    //! @param [in]     amount      重み.
    //! @return     補間の結果を返却します.
    //-------------------------------------------------------------------------
    static Vector4 SmoothStep(const Vector4& a, const Vector4& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      指定された行列を用いて，ベクトルを変換します.
    //!
    //! @param [in]     position    入力ベクトル.
    //! @param [in]     matrix      変換行列.
    //! @return     変換されたベクトルを返却します.
    //-------------------------------------------------------------------------
    static Vector4 Transform(const Vector4& position, const Matrix& matrix);

    //-------------------------------------------------------------------------
    //! @brief      平面式を正規化します.
    //!
    //! @param[in]      value       平面式(x, y, zが法線, wが距離).
    //! @return     正規化した平面式を返却します.
    //-------------------------------------------------------------------------
    static Vector4 NormalizePlane(const Vector4& value);
};

///////////////////////////////////////////////////////////////////////////////
// Matrix structure
// 行列クラス    (行優先行列 row-major)
///////////////////////////////////////////////////////////////////////////////
struct Matrix
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     scalar      乗算するスカラー値.
    //! @param [in]     value       乗算される行列.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    friend Matrix operator * ( float, const Matrix& );

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    union
    {
        struct
        {
            float _11, _12, _13, _14;
            float _21, _22, _23, _24;
            float _31, _32, _33, _34;
            float _41, _42, _43, _44;
        };
        float m[4][4];
        Vector4 row[4];
    };

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Matrix();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     pValues     要素数16の配列.
    //-------------------------------------------------------------------------
    explicit Matrix(const float* pValues);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     m11         1行1列の値.
    //! @param [in]     m12         1行2列の値.
    //! @param [in]     m13         1行3列の値.
    //! @param [in]     m14         1行4列の値.
    //! @param [in]     m21         2行1列の値.
    //! @param [in]     m22         2行2列の値.
    //! @param [in]     m23         2行3列の値.
    //! @param [in]     m24         2行4列の値.
    //! @param [in]     m31         3行1列の値.
    //! @param [in]     m32         3行2列の値.
    //! @param [in]     m33         3行3列の値.
    //! @param [in]     m34         3行4列の値.
    //! @param [in]     m41         4行1列の値.
    //! @param [in]     m42         4行2列の値.
    //! @param [in]     m43         4行3列の値.
    //! @param [in]     m44         4行4列の値.
    //-------------------------------------------------------------------------
    explicit Matrix (
        float m11, float m12, float m13, float m14,
        float m21, float m22, float m23, float m24,
        float m31, float m32, float m33, float m34,
        float m41, float m42, float m43, float m44 );

    //---------------------------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param[in]      v0      1行目の値です.
    //! @param[in]      v1      2行目の値です.
    //! @param[in]      v2      3行目の値です.
    //! @param[in]      v3      4行目の値です.
    //---------------------------------------------------------------------------------------------
    explicit Matrix(const Vector4& v1, const Vector4& v2, const Vector4& v3, const Vector4& v4);

    //-------------------------------------------------------------------------
    //! @brief      インデクサです.
    //!
    //! @param [in]     row         行番号.
    //! @param [in]     col         列番号.
    //! @return     指定された行番号と列番号に対応する要素を返却します.
    //-------------------------------------------------------------------------
    float& operator() (uint32_t row, uint32_t col);

    //-------------------------------------------------------------------------
    //! @brief      インデクサです(const版).
    //!
    //! @param [in]     row         行番号.
    //! @param [in]     col         列番号.
    //! @return     指定された行番号と列番号に対応する要素を返却します.
    //-------------------------------------------------------------------------
    const float& operator() (uint32_t row, uint32_t col) const;

    //-------------------------------------------------------------------------
    //! @brief      float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value       乗算する行列.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator *= (const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      加算代入演算子です.
    //!
    //! @param [in]     value       加算する行列.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator += (const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      減算代入演算子です.
    //!
    //! @param [in]     value       減算する行列.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator -= (const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value       乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator *= (float value);

    //-------------------------------------------------------------------------
    //! @brief      除算代入演算子です.
    //!
    //! @param [in]     value       除算するスカラー値.
    //! @return     除算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator /= (float value);

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value       代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& operator = (const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身を値を返却します.
    //-------------------------------------------------------------------------
    Matrix operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //
    //! @return     各成分にマイナスを付けた値を返却します.
    //-------------------------------------------------------------------------
    Matrix operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value       乗算する値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix operator * (const Matrix& value) const;

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix operator + (const Matrix& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @retrurn    減算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix operator - (const Matrix& value) const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //
    //! @param [in]     value       乗算するスカラー値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Matrix operator * (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      除算演算子です.
    //!
    //! @param [in]     value       除算するスカラー値.
    //-------------------------------------------------------------------------
    Matrix operator / (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    値が等価です.
    //! @retval false   値が非等価です.
    //-------------------------------------------------------------------------
    bool operator == (const Matrix& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    値が非等価です.
    //! @retval false   値が等価です.
    //-------------------------------------------------------------------------
    bool operator != (const Matrix& value) const;

    //-------------------------------------------------------------------------
    //! @brief      行列式を求めます.
    //!
    //! @return     行列式の値を返却します.
    //-------------------------------------------------------------------------
    float Determinant() const;

    //-------------------------------------------------------------------------
    //! @brief      単位行列にします.
    //!
    //! @return     単位行列にした結果を返却します.
    //-------------------------------------------------------------------------
    Matrix& Identity();

    //-------------------------------------------------------------------------
    //! @brief      基底Xベクトルを取得します.
    //! 
    //! @return     基底Xベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetBasisX() const;

    //-------------------------------------------------------------------------
    //! @brief      基底Yベクトルを取得します.
    //! 
    //! @return     基底Yベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetBasisY() const;

    //-------------------------------------------------------------------------
    //! @brief      基底Zベクトルを取得します.
    //! 
    //! @return     基底Zベクトルを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetBasisZ() const;

    //-------------------------------------------------------------------------
    //! @brief      スケール成分を求めます.
    //! 
    //! @return     スケール成分を返却します.
    //-------------------------------------------------------------------------
    Vector3 CalcScale() const;

    //-------------------------------------------------------------------------
    //! @brief      単位行列を取得します.
    //!
    //! @return     単位行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateIdentity();

    //-------------------------------------------------------------------------
    //! @brief      単位行列であるか判定します.
    //!
    //! @param [in]     value       判定する値.
    //! @retval true    単位行列です.
    //! @retval false   非単位行列です.
    //-------------------------------------------------------------------------
    static bool IsIdentity(const Matrix &value);

    //-------------------------------------------------------------------------
    //! @brief      行列を転置します.
    //!
    //! @param [in]     value       転置する行列.
    //! @return     行列を転置した結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix Transpose(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      行列同士を乗算します.
    //!
    //! @param [in]     a           入力行列.
    //! @param [in]     b           入力行列.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix Multiply(const Matrix& a, const Matrix& b);

    //-------------------------------------------------------------------------
    //! @brief      スカラー乗算します.
    //!
    //! @param [in]     value       入力行列.
    //! @param [in]     scalar      スカラー値.
    //! @return     行列をスカラー倍した結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix Multiply(const Matrix& value, float scalar );

    //-------------------------------------------------------------------------
    //! @brief      行列同士を乗算し，乗算結果を転置します.
    //!
    //! @param [in]     a           入力行列.
    //! @param [in]     b           入力行列.
    //! @return     行列同士を乗算し，乗算結果を転置した値を返却します.
    //-------------------------------------------------------------------------
    static Matrix MultiplyTranspose(const Matrix& a, const Matrix& b);

    //-------------------------------------------------------------------------
    //! @brief      逆行列を求めます.
    //!
    //! @param [in]     value       逆行列を求める値.
    //-------------------------------------------------------------------------
    static Matrix Invert(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      拡大縮小行列を生成します.
    //!
    //! @param [in]     scale      拡大縮小値.
    //! @return     拡大縮小行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateScale(float scale);

    //-------------------------------------------------------------------------
    //! @brief      拡大縮小行列を生成します.
    //!
    //! @param [in]     sx          X成分の拡大縮小値.
    //! @param [in]     sy          Y成分の拡大縮小値.
    //! @param [in]     sz          Z成分の拡大縮小値.
    //! @return     拡大縮小行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateScale(float sx, float sy, float sz);

    //-------------------------------------------------------------------------
    //! @brief      拡大縮小行列を生成します.
    //!
    //! @param [in]     value       拡大縮小値.
    //! @return     拡大縮小行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateScale(const Vector3& value);

    //-------------------------------------------------------------------------
    //! @brief      平行移動行列を生成します.
    //!
    //! @param [in]     tx          X成分の平行移動値.
    //! @param [in]     ty          Y成分の平行移動値.
    //! @param [in]     tz          Z成分の平行移動値.
    //! @return     平行移動行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateTranslation(float tx, float ty, float tz);

    //-------------------------------------------------------------------------
    //! @brief      平行移動行列を生成します.
    //!
    //! @param [in]     translate   平行移動値.
    //! @return     平行移動行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateTranslation(const Vector3& translate);

    //-------------------------------------------------------------------------
    //! @brief      X軸回りの回転行列を生成します.
    //!
    //! @param [in]     radian         角度(ラジアン).
    //! @return     X軸回りの回転行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateRotationX(float radian);

    //-------------------------------------------------------------------------
    //! @brief      Y軸回りの回転行列を生成します.
    //!
    //! @param [in]     radian         角度(ラジアン).
    //! @return     Y軸回りの回転行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateRotationY(float radian);

    //-------------------------------------------------------------------------
    //! @brief      Z軸回りの回転行列を生成します.
    //!
    //! @param [in]     radian         角度(ラジアン).
    //! @return     Z軸回りの回転行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateRotationZ(float radian);

    //-------------------------------------------------------------------------
    //! @brief      四元数から行列を生成します.
    //!
    //! @param [in]     value       四元数.
    //! @return     四元数から生成された行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateFromQuaternion(const Quaternion& qua);

    //-------------------------------------------------------------------------
    //! @brief      指定された軸と角度から回転行列を生成します.
    //!
    //! @param [in]     axis        回転軸.
    //! @param [in]     radian      回転角(ラジアン).
    //! @return     回転行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateFromAxisAngle(const Vector3& axis, float radian);

    //-------------------------------------------------------------------------
    //! @brief      ヨー・ピッチ・ロール角から回転行列を生成します.
    //!
    //! @param [in]     yaw         ヨー角(ラジアン).
    //! @param [in]     pitch       ピッチ角(ラジアン).
    //! @param [in]     roll        ロール角(ラジアン).
    //! @return     回転行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateRotationFromYawPitchRoll(float yaw, float pitch, float roll);

    //-------------------------------------------------------------------------
    //! @brief      ビュー行列を生成します.
    //!
    //! @param [in]     position    カメラ位置.
    //! @param [in]     target      注視点.
    //! @param [in]     upward      上向きベクトル.
    //! @return     ビュー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateLookAt(const Vector3& position, const Vector3& target, const Vector3& upward);

    //-------------------------------------------------------------------------
    //! @brief      ビュー行列を生成します.
    //!
    //! @param [in]     position    カメラ位置.
    //! @param [in]     viewDir     視線ベクトル.
    //! @param [in]     upward      上向きベクトル.
    //! @return     ビュー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateLookTo(const Vector3& position, const Vector3& viewDir, const Vector3& upward);

    //-------------------------------------------------------------------------
    //! @brief      透視投影行列を生成します.
    //!
    //! @param [in]     width       ビューボリュームの幅.
    //! @param [in]     height      ビューボリュームの高さ.
    //! @param [in]     naerClip    近クリップ平面までの距離.
    //! @param [in]     farClip     遠クリップ平面までの距離.
    //! @return     透視投影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreatePerspective(float width, float height, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      視野角に基づいて透視投影行列を生成します.
    //!
    //! @param [in]     fieldOfView     視野角(ラジアン).
    //! @param [in]     aspectRatio     アスペクト比.
    //! @param [in]     nearClip        近クリップ平面までの距離.
    //! @param [in]     farClip         遠クリップ平面までの距離.
    //! @return     透視投影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreatePerspectiveFieldOfView(float fieldOfView, float aspectRatio, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      視野角に基づいてReverse-Z透視投影行列を生成します.
    //!
    //! @param [in]     fieldOfView     視野角(ラジアン).
    //! @param [in]     aspectRatio     アスペクト比.
    //! @param [in]     nearClip        近クリップ平面までの距離.
    //! @return     投資投影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreatePerspectiveFieldOfViewReverseZ(float filedOfView, float aspectRatio, float nearClip);

    //-------------------------------------------------------------------------
    //! @brief      カスタマイズした透視投影行列を生成します.
    //!
    //! @param [in]     left        ビューボリュームの最小X値.
    //! @param [in]     right       ビューボリュームの最大X値.
    //! @param [in]     bottom      ビューボリュームの最小Y値.
    //! @param [in]     top         ビューボリュームの最大Y値.
    //! @param [in]     nearClip    近クリップ平面までの距離.
    //! @param [in]     farClip     遠クリップ平面までの距離.
    //! @return     透視投影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreatePerspectiveOffCenter(float left, float right, float bottom, float top, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      正射影行列を生成します.
    //!
    //! @param [in]     width       ビューボリュームの幅.
    //! @param [in]     height      ビューボリュームの高さ.
    //! @param [in]     nearClip    近クリップ平面までの距離.
    //! @param [in]     farClip     遠クリップ平面までの距離.
    //! @return     正射影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix  CreateOrthographic(float width, float height, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      カスタマイズした正射影行列を生成します.
    //!
    //! @param [in]     left        ビューボリュームの最小X値.
    //! @param [in]     right       ビューボリュームの最大X値.
    //! @param [in]     bottom      ビューボリュームの最小Y値.
    //! @param [in]     top         ビューボリュームの最大Y値.
    //! @param [in]     nearClip    近クリップ平面までの距離.
    //! @param [in]     farClip     遠クリップ平面までの距離.
    //! @return     正射影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateOrthographicOffCenter(float left, float right, float bottom, float top, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      カスタマイズした正射影行列を生成します.
    //!
    //! @param [in]     left        ビューボリュームの最小X値.
    //! @param [in]     right       ビューボリュームの最大X値.
    //! @param [in]     bottom      ビューボリュームの最小Y値.
    //! @param [in]     top         ビューボリュームの最大Y値.
    //! @param [in]     nearClip    近クリップ平面までの距離.
    //! @param [in]     farClip     遠クリップ平面までの距離.
    //! @return     正射影行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateOrthographicOffCenterReverseZ(float left, float right, float bottom, float top, float nearClip, float farClip);

    //-------------------------------------------------------------------------
    //! @brief      2つの行列を線形補間します.
    //!
    //! @param [in]     a           入力行列.
    //! @param [in]     b           入力行列.
    //! @param [in]     amount      補間係数.
    //! @return     線形補間した行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix Lerp(const Matrix& a, const Matrix& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      ビルボード行列を生成します.
    //!
    //! @param[in]      value       ビュー行列.
    //! @return     ビルボード行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateBillboard(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      Y軸ビルボード行列を生成します.
    //!
    //! @param[in]      value       ビュー行列.
    //! @return     Y軸ビルボード行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateBillboardAxisY(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      平行移動行列を左から掛けます.
    //!
    //! @param[in]      vec         平行移動量.
    //! @param[in]      mat         行列.
    //! @return     平行移動行列を←から掛けた結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix AppendTranslation(const Vector3& vec, Matrix& mat);

    //-------------------------------------------------------------------------
    //! @brief      平行移動行列を右から掛けます.
    //!
    //! @param[in]      mat         行列.
    //! @param[in]      vec         平行移動量.
    //! @return     平行移動行列を右から掛けた結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix AppendTranslation(Matrix& mat, const Vector3& vec);

    //-------------------------------------------------------------------------
    //! @brief      スケール行列を左から掛けます.
    //!
    //! @param[in]      vec         スケール値.
    //! @param[in]      mat         行列.
    //! @return     左からスケール行列を掛けた結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix AppendScale(const Vector3& vec, Matrix& mat);

    //-------------------------------------------------------------------------
    //! @brief      スケール行列を右から掛けます.
    //!
    //! @param[in]      mat         行列.
    //! @param[in]      vec         スケール値.
    //! @return     右からスケール行列を掛けた結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix AppendScale(Matrix& mat, const Vector3& vec);

    //-------------------------------------------------------------------------
    //! @brief      明度を調整するカラー行列を生成します.
    //! 
    //! @param[in]      brightness  明度[0, 1].
    //! @return     明度を調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateBrightnessMatrix(float brightness);

    //-------------------------------------------------------------------------
    //! @brief      彩度を調整するカラー行列を生成します.
    //! 
    //! @param[in]      r       赤成分の彩度[0, 1]
    //! @param[in]      g       緑成分の彩度[0, 1]
    //! @param[in]      b       青成分の彩度[0, 1]
    //! @return     彩度を調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateSaturationMatrix(float r, float g, float b);

    //-------------------------------------------------------------------------
    //! @brief      彩度を調整するカラー行列を生成します.
    //! 
    //! @param[in]      saturation  彩度[0, 1]
    //! @return     彩度を調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateSaturationMatrix(float saturation);

    //-------------------------------------------------------------------------
    //! @brief      コントラストを調整するカラー行列を生成します.
    //! 
    //! @param[in]      contrast    コントラスト[0, 1]
    //! @return     コントラストを調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateContrastMatrix(float contrast);

    //-------------------------------------------------------------------------
    //! @brief      色相を調整するカラー行列を生成します.
    //! 
    //! @param[in]      hueDegree   色相[0度-360度].
    //! @return     色相を調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateHueMatrix(float hueDegree);

    //-------------------------------------------------------------------------
    //! @brief      セピアカラーを調整するカラー行列を生成します.
    //! 
    //! @param[in]      tone        セピアトーン[0, 1]
    //! @return     セピアカラーを調整するカラー行列返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateSepiaMatrix(float tone);

    //-------------------------------------------------------------------------
    //! @brief      グレイスケールカラーを調整するカラー行列を生成します.
    //! 
    //! @param[in]      tone        グレイスケールトーン[0, 1]
    //! @return     グレイスケールカラーを調整するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateGrayScaleMatrix(float tone);

    //-------------------------------------------------------------------------
    //! @brief      色を反転するカラー行列を生成します.
    //! 
    //! @return     色を反転するカラー行列を返却します.
    //-------------------------------------------------------------------------
    static Matrix CreateReverseColorMatrix();
};


///////////////////////////////////////////////////////////////////////////////
// Quaternion structure
///////////////////////////////////////////////////////////////////////////////
struct Quaternion
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief          乗算演算子です.
    //!
    //! @param [in]     scalar          乗算するスカラー値.
    //! @param [in]     value           乗算される四元数.
    //! @return         乗算結果を返却します.
    //-------------------------------------------------------------------------
    friend Quaternion operator * ( float, const Quaternion& );

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    float x = 0.0f;  //!< X成分です.
    float y = 0.0f;  //!< Y成分です.
    float z = 0.0f;  //!< Z成分です.
    float w = 1.0f;  //!< W成分です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Quaternion();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     pValues     要素数4の配列.
    //-------------------------------------------------------------------------
    Quaternion(const float* pValue);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //!
    //! @param [in]     nx          X成分.
    //! @param [in]     ny          Y成分.
    //! @param[in]     nz          Z成分.
    //! @param [in]     nw          W成分.
    //-------------------------------------------------------------------------
    Quaternion(float nx, float ny, float nz, float nw);

    //-------------------------------------------------------------------------
    //! @brief      float*型へのキャストです.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型へのキャストです.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      加算代入演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& operator += (const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      減算代入演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& operator -= (const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value       乗算する値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& operator *= (const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      乗算代入演算子です.
    //!
    //! @param [in]     value      スカラー乗算する値.
    //! @return     スカラー乗算した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& operator *= (float value);

    //-------------------------------------------------------------------------
    //! @brief      除算代入演算子です.
    //!
    //! @param [in]     value      スカラー除算する値.
    //! @return     スカラー除算した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& operator /= (float value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身の値を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //!
    //! @return     各成分の符号を反転した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value       乗算する値.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator * (const Quaternion& value) const;

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //!
    //! @param [in]     value       加算する値.
    //! @return     加算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator + (const Quaternion& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //!
    //! @param [in]     value       減算する値.
    //! @return     減算結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator - (const Quaternion& value) const;

    //-------------------------------------------------------------------------
    //! @brief      乗算演算子です.
    //!
    //! @param [in]     value      スカラー乗算する値.
    //! @return     スカラー乗算した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator * (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      除算演算子です.
    //!
    //! @param [in]     value      スカラー除算する値.
    //! @return     スカラー除算した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion operator / (float value) const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    等価です.
    //! @retval false   非等価です.
    //-------------------------------------------------------------------------
    bool operator == (const Quaternion& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    非等価です.
    //! @retval flase   等価です.
    //-------------------------------------------------------------------------
    bool operator != (const Quaternion& value) const;

    //-------------------------------------------------------------------------
    //! @brief      四元数の長さを求めます.
    //!
    //! @return     四元数の長さを返却します.
    //-------------------------------------------------------------------------
    float Length() const;

    //-------------------------------------------------------------------------
    //! @brief      四元数の長さの2乗値を求めます.
    //!
    //! @return     四元数の長さの2乗値を返却します.
    //-------------------------------------------------------------------------
    float LengthSq() const;

    //-------------------------------------------------------------------------
    //! @brief      四元数を正規化します.
    //!
    //! @return     正規化した四元数を返却します.
    //-------------------------------------------------------------------------
    Quaternion& Normalize();

    //-------------------------------------------------------------------------
    //! @brief      零除算を考慮して，四元数を正規化を試みます.
    //!
    //! @param [in]     set         長さが0の場合に設定する四元数.
    //! @return     長さが0でなければ正規化した四元数，0であればsetを返却します.
    //-------------------------------------------------------------------------
    Quaternion& SafeNormalize(const Quaternion& set);

    //-------------------------------------------------------------------------
    //! @brief      単位四元数化します.
    //!
    //! @return     単位四元数化した結果を返却します.
    //-------------------------------------------------------------------------
    Quaternion& Identity();

    //-------------------------------------------------------------------------
    //! @brief      単位四元数を生成します.
    //!
    //! @return     単位四元数を返却します.
    //-------------------------------------------------------------------------
    static Quaternion CreateIdentity();

    //-------------------------------------------------------------------------
    //! @brief      単位四元数かどうかチェックします.
    //!
    //! @param [in]     value       チェックする値.
    //! @retval true    単位四元数です.
    //! @retval false   非単位四元数です.
    //-------------------------------------------------------------------------
    static bool IsIdentity(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      正規化されているかどうかチェックします.
    //!
    //! @param [in]    value       チェックする値.
    //! @return     正規化されていればtrueを返却します.
    //-------------------------------------------------------------------------
    static bool IsNormalized(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      四元数同士の乗算を行います.
    //!
    //! @param [in]     a           入力四元数.
    //! @param [in]     b           入力四元数.
    //! @return     乗算結果を返却します.
    //-------------------------------------------------------------------------
    static Quaternion Multiply(const Quaternion& a, const Quaternion& b);

    //-------------------------------------------------------------------------
    //! @brief      四元数の内積を求めます.
    //!
    //! @param [in]     a           入力四元数.
    //! @param [in]     b           入力四元数.
    //! @return     四元数の内積を返却します.
    //-------------------------------------------------------------------------
    static float Dot(const Quaternion& a, const Quaternion& b);

    //-------------------------------------------------------------------------
    //! @brief      四元数の共役を求めます.
    //!
    //! @param [in]     value       共役を求めたい四元数.
    //! @return     四元数の共役を返却します.
    //-------------------------------------------------------------------------
    static Quaternion Conjugate(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      四元数を正規化します.
    //!
    //! @param [in]     value       入力四元数.
    //! @return     四元数を正規化した結果を返却します.
    //-------------------------------------------------------------------------
    static Quaternion Normalize(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      零除算を考慮して正規化を試みます.
    //!
    //! @param [in]     value       入力四元数.
    //! @param [in]     set         長さが0の場合に設定する四元数.
    //! @return     長さが0でなければ正規化した四元数、長さが0であればsetを返却します.
    //-------------------------------------------------------------------------
    static Quaternion SafeNormalize(const Quaternion& value, const Quaternion& set);

    //-------------------------------------------------------------------------
    //! @brief      ヨー・ピッチ・ロール角から四元数を生成します.
    //!
    //! @param [in]     yaw         ヨー角(ラジアン).
    //! @param [in]     pitch       ピッチ角(ラジアン).
    //! @param [in]     roll        ロール角(ラジアン).
    //! @return     指定されたヨー・ピッチ・ロール角から生成された四元数を返却します.
    //-------------------------------------------------------------------------
    static Quaternion CreateFromYawPitchRoll(float yaw, float pitch, float roll);

    //-------------------------------------------------------------------------
    //! @brief      指定された軸と角度から四元数を生成します.
    //!
    //! @param [in]     axis        回転軸.
    //! @param [in]     rad         回転角(ラジアン).
    //! @return     指定された軸と角度から生成された四元数を返却します.
    //-------------------------------------------------------------------------
    static Quaternion CreateFromAxisAngle(const Vector3& axis, float radian);

    //-------------------------------------------------------------------------
    //! @brief      回転行列から四元数を生成します.
    //!
    //! @param [in]     value       回転行列.
    //! @return     回転行列から生成した四元数を返却します.
    //-------------------------------------------------------------------------
    static Quaternion CreateFromRotationMatrix(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      オイラー角(XYZの順)を取得します.
    //!
    //! @param[in]      value       オイラー角を求める四元数.
    //! @return     オイラー角(XYZの順)をラジアン単位で返却します.
    //-------------------------------------------------------------------------
    static Vector3 ToAxisAngle(const Quaternion& value);

    //-------------------------------------------------------------------------
    //! @brief      球面線形補間を行います.
    //!
    //! @param [in]     a           入力四元数.
    //! @param [in]     b           入力四元数.
    //! @param [in]     amount      補間係数.
    //! @return     球面線形補間した結果を返却します.
    //-------------------------------------------------------------------------
    static Quaternion Slerp(const Quaternion& a, const Quaternion& b, float amount);

    //-------------------------------------------------------------------------
    //! @brief      球面四角形補間を行います.
    //!
    //! @param [in]     a           入力四元数.
    //! @param [in]     b           入力四元数.
    //! @param [in]     c           入力四元数.
    //! @param [in]     d           入力四元数.
    //! @param [in]     amount      補間係数.
    //! @return     球面四角形補間した結果を返却します.
    //-------------------------------------------------------------------------
    static Quaternion Squad(const Quaternion& value, const Quaternion& a, const Quaternion& b, const Quaternion& c, float amount);
};

///////////////////////////////////////////////////////////////////////////////
// Transform3x4 structure 
// 変換行列クラス (column-majaor matrix:列優先行列)
///////////////////////////////////////////////////////////////////////////////
struct Transform3x4
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    union
    {
        struct
        {
            float _11, _12, _13, _14;
            float _21, _22, _23, _24;
            float _31, _32, _33, _34;
        };
        float m[3][4];
        Vector4 col[3];
    };

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //--------------------------------------------------------------------------
    Transform3x4();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //--------------------------------------------------------------------------
    Transform3x4(
        float m11, float m12, float m13, float m14,
        float m21, float m22, float m23, float m24,
        float m31, float m32, float m33, float m34);

    //-------------------------------------------------------------------------
    //! @brief      float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator float* ();

    //-------------------------------------------------------------------------
    //! @brief      const float*型への演算子です.
    //!
    //! @return     最初の要素へのポインタを返却します.
    //-------------------------------------------------------------------------
    operator const float* () const;

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value       代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    Transform3x4& operator = (const Transform3x4& value);

    //-------------------------------------------------------------------------
    //! @brief      正符号演算子です.
    //!
    //! @return     自分自身を値を返却します.
    //-------------------------------------------------------------------------
    Transform3x4 operator + () const;

    //-------------------------------------------------------------------------
    //! @brief      負符号演算子です.
    //
    //! @return     各成分にマイナスを付けた値を返却します.
    //-------------------------------------------------------------------------
    Transform3x4 operator - () const;

    //-------------------------------------------------------------------------
    //! @brief      等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    値が等価です.
    //! @retval false   値が非等価です.
    //-------------------------------------------------------------------------
    bool operator == (const Transform3x4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価比較演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    値が非等価です.
    //! @retval false   値が等価です.
    //-------------------------------------------------------------------------
    bool operator != (const Transform3x4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      Matrix型からTransform3x4型へ変換します.
    //! 
    //! @param[in]      value       変換元のMatrix型の値.
    //! @return     変換結果を返却します.
    //--------------------------------------------------------------------------
    static Transform3x4 FromMatrix(const Matrix& value);

    //-------------------------------------------------------------------------
    //! @brief      Transform3x4型からMatrix型へ変換します.
    //! 
    //! @param[in]      value       変換元のTransform3x4型の値.
    //! @return     変換結果を返却します.
    //-------------------------------------------------------------------------
    static Matrix ToMatrix(const Transform3x4& value);
};


///////////////////////////////////////////////////////////////////////////////
// BoundingBox2 structure
///////////////////////////////////////////////////////////////////////////////
struct BoundingBox2
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    Vector2 Mini;   //!< 最小値です.
    Vector2 Maxi;   //!< 最大値です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BoundingBox2();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      mini        最小値です.
    //! @param[in]      maxi        最大値です.
    //-------------------------------------------------------------------------
    BoundingBox2(const Vector2& mini, const Vector2& maxi);

    //-------------------------------------------------------------------------
    //! @brief      中心座標を求めます.
    //! 
    //! @return     中心座標を返却します.
    //-------------------------------------------------------------------------
    Vector2 GetCenter() const;

    //-------------------------------------------------------------------------
    //! @brief      サイズを求めます.
    //! 
    //! @return     サイズを返却します.
    //-------------------------------------------------------------------------
    Vector2 GetSize() const;

    //-------------------------------------------------------------------------
    //! @brief      点が含まれるかどうか判定します.
    //! 
    //! @param[in]      value       点の座標.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングボックスが含まれるかどうか判定します.
    //! 
    //! @param[in]      value       バウンディングボックス.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const BoundingBox2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //! 
    //! @param[in]      value       代入する値です.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    BoundingBox2& operator = (const BoundingBox2& value);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングボックス.
    //! @param[in]      rhs         バウンディングボックス.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingBox2 Merge(const BoundingBox2& lhs, const BoundingBox2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングボックス.
    //! @param[in]      rhs         点の座標.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingBox2 Merge(const BoundingBox2& lhs, const Vector2& rhs);

    //------------------------------------------------------------------------
    //! @brief      頂点データからバウンディングスフィアを求めます.
    //! 
    //! @param[in]      vertices        頂点座標データ.
    //! @param[in]      vertexCount     頂点数.
    //! @param[in]      vertexStride    1頂点のサイズ.
    //! @return     求めたバウンディングスフィアを返却します.
    //------------------------------------------------------------------------
    static BoundingBox2 Create(const float* vertices, size_t vertexCount, size_t vertexStride);
};


///////////////////////////////////////////////////////////////////////////////
// BoundingBox3 structure
///////////////////////////////////////////////////////////////////////////////
struct BoundingBox3
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    Vector3 Mini;   //!< 最大値です.
    Vector3 Maxi;   //!< 最小値です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BoundingBox3();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      mini        最小値です.
    //! @param[in]      maxi        最大値です.
    //-------------------------------------------------------------------------
    BoundingBox3(const Vector3& mini, const Vector3& maxi);

    //-------------------------------------------------------------------------
    //! @brief      中心座標を求めます.
    //! 
    //! @return     中心座標を返却します.
    //-------------------------------------------------------------------------
    Vector3 GetCenter() const;

    //-------------------------------------------------------------------------
    //! @brief      サイズを求めます.
    //! 
    //! @return     サイズを返却します.
    //-------------------------------------------------------------------------
    Vector3 GetSize() const;

    //-------------------------------------------------------------------------
    //! @brief      点が含まれるかどうか判定します.
    //! 
    //! @param[in]      value       点の座標.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングボックスが含まれるかどうか判定します.
    //! 
    //! @param[in]      value       バウンディングボックス.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const BoundingBox3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //! 
    //! @param[in]      value       代入する値です.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    BoundingBox3& operator = (const BoundingBox3& value);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングボックス.
    //! @param[in]      rhs         バウンディングボックス.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingBox3 Merge(const BoundingBox3& lhs, const BoundingBox3& rhs);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングボックス.
    //! @param[in]      rhs         点の座標.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingBox3 Merge(const BoundingBox3& lhs, const Vector3& rhs);

    //-------------------------------------------------------------------------
    //! @brief      指定行列で変換処理を行います.
    //! 
    //! @param[in]      box         バウンディングボックス.
    //! @param[in]      matrix      変換行列.
    //! @return     変換結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingBox3 Transform(const BoundingBox3& box, const Matrix& matrix);

    //------------------------------------------------------------------------
    //! @brief      頂点データからバウンディングスフィアを求めます.
    //! 
    //! @param[in]      vertices        頂点座標データ.
    //! @param[in]      vertexCount     頂点数.
    //! @param[in]      vertexStride    1頂点のサイズ.
    //! @return     求めたバウンディングスフィアを返却します.
    //------------------------------------------------------------------------
    static BoundingBox3 Create(const float* vertices, size_t vertexCount, size_t vertexStride);
};


///////////////////////////////////////////////////////////////////////////////
// BoundingSphere2 structure
///////////////////////////////////////////////////////////////////////////////
struct BoundingSphere2
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    Vector2 Center;     //!< 中心位置です.
    float   Radius;     //!< 半径です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BoundingSphere2();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      x           中心位置X.
    //! @param[in]      y           中心位置Y.
    //! @param[in]      radius      半径.
    //-------------------------------------------------------------------------
    BoundingSphere2(float x, float y, float radius);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      center      中心位置です.
    //! @param[in]      radius      半径です.
    //-------------------------------------------------------------------------
    BoundingSphere2(const Vector2& center, float radius);

    //-------------------------------------------------------------------------
    //! @brief      点を含むかどうか判定します.
    //! 
    //! @param[in]      value       点の座標です.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const Vector2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを含むかどうか判定します.
    //! 
    //! @param[in]      value       バウンディングスフィア.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const BoundingSphere2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //! 
    //! @param[in]      value       代入する値です.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    BoundingSphere2& operator = (const BoundingSphere2& value);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います
    //! 
    //! @param[in]      lhs         バウンディングスフィア.
    //! @param[in]      rhs         バウンディングスフィア.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingSphere2 Merge(const BoundingSphere2& lhs, const BoundingSphere2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングスフィア.
    //! @param[in]      rhs         点の座標.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingSphere2 Merge(const BoundingSphere2& lhs, const Vector2& rhs);

    //------------------------------------------------------------------------
    //! @brief      頂点データからバウンディングスフィアを求めます.
    //! 
    //! @param[in]      vertices        頂点座標データ.
    //! @param[in]      vertexCount     頂点数.
    //! @param[in]      vertexStride    1頂点のサイズ.
    //! @return     求めたバウンディングスフィアを返却します.
    //------------------------------------------------------------------------
    static BoundingSphere2 Create(const float* vertices, size_t vertexCount, size_t vertexStride);
};

///////////////////////////////////////////////////////////////////////////////
// BoundingSphere3 structure
///////////////////////////////////////////////////////////////////////////////
struct BoundingSphere3
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    Vector3 Center;     //!< 中心位置です.
    float   Radius;     //!< 半径です.

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    BoundingSphere3();

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタ.
    //! 
    //! @param[in]      x       中心位置X
    //! @param[in]      y       中心位置Y
    //! @param[in]      z       中心位置Z.
    //! @param[in]      radius  半径.
    //-------------------------------------------------------------------------
    BoundingSphere3(float x, float y, float z, float radius);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //! 
    //! @param[in]      center      中心位置です.
    //! @param[in]      radius      半径です.
    //-------------------------------------------------------------------------
    BoundingSphere3(const Vector3& center, float radius);

    //-------------------------------------------------------------------------
    //! @brief      点を含むかどうか判定します.
    //! 
    //! @param[in]      value       点の座標です.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const Vector3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      バウンディングスフィアを含むかどうか判定します.
    //! 
    //! @param[in]      value       バウンディングスフィア.
    //! @retval true    含みます.
    //! @retval false   含みません.
    //-------------------------------------------------------------------------
    bool Contains(const BoundingSphere3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //! 
    //! @param[in]      value       代入する値です.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    BoundingSphere3& operator = (const BoundingSphere3& value);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います
    //! 
    //! @param[in]      lhs         バウンディングスフィア.
    //! @param[in]      rhs         バウンディングスフィア.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingSphere3 Merge(const BoundingSphere3& lhs, const BoundingSphere3& rhs);

    //-------------------------------------------------------------------------
    //! @brief      マージ処理を行います.
    //! 
    //! @param[in]      lhs         バウンディングスフィア.
    //! @param[in]      rhs         点の座標.
    //! @return     マージ結果を返却します.
    //-------------------------------------------------------------------------
    static BoundingSphere3 Merge(const BoundingSphere3& lhs, const Vector3& rhs);

    //------------------------------------------------------------------------
    //! @brief      指定行列で変換処理を行います.
    //! 
    //! @param[in]      sphere      バウンディングスフィア.
    //! @param[in]      matrix      変換行列.
    //! @return     変換したバウンディングスフィアを返却します.
    //------------------------------------------------------------------------
    static BoundingSphere3 Transform(const BoundingSphere3& sphere, const Matrix& matrix);

    //------------------------------------------------------------------------
    //! @brief      頂点データからバウンディングスフィアを求めます.
    //! 
    //! @param[in]      vertices        頂点座標データ.
    //! @param[in]      vertexCount     頂点数.
    //! @param[in]      vertexStride    1頂点のサイズ.
    //! @return     求めたバウンディングスフィアを返却します.
    //------------------------------------------------------------------------
    static BoundingSphere3 Create(const float* vertices, size_t vertexCount, size_t vertexStride);
};


///////////////////////////////////////////////////////////////////////////////
// XorShif class
///////////////////////////////////////////////////////////////////////////////
class XorShift
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //!
    //! @param [in]     seed        設定する種.
    //-------------------------------------------------------------------------
    XorShift(uint32_t seed);

    //-------------------------------------------------------------------------
    //! @brief      コピーコンストラクタです.
    //!
    //! @param [in]     random      複製元のインスタンス.
    //-------------------------------------------------------------------------
    XorShift(const XorShift& random);

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~XorShift() = default;

    //-------------------------------------------------------------------------
    //! @brief      ランダム種を設定します.
    //!
    //! @param [in]     seed        設定する種.
    //-------------------------------------------------------------------------
    void SetSeed(uint32_t seed);

    //-------------------------------------------------------------------------
    //! @brief      議事乱数を取得します.
    //-------------------------------------------------------------------------
    uint32_t GetValue();

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //
    //! @param [in]     value      代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    XorShift& operator = (const XorShift& value);

    //-------------------------------------------------------------------------
    //! @brief      等価演算子です.
    //
    //! @param [in]     value      比較する値.
    //! @retval true    等価です.
    //! @retval false   非等価です.
    //-------------------------------------------------------------------------
    bool operator == (const XorShift& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価演算子です.
    //!
    //! @param [in]     value      比較する値.
    //! @retval true    非等価です.
    //! @retval false   等価です.
    //-------------------------------------------------------------------------
    bool operator != (const XorShift& value) const;

private:
    //=========================================================================
    // private variables
    //=========================================================================
    uint32_t    m_X;    //!< 変数です.
    uint32_t    m_Y;    //!< 変数です.
    uint32_t    m_Z;    //!< 変数です.
    uint32_t    m_W;    //!< 変数です.

    //=========================================================================
    // private methods
    //=========================================================================
    /* NOTHING */
};

///////////////////////////////////////////////////////////////////////////////
// PCG (Permuted congruential generator) class
///////////////////////////////////////////////////////////////////////////////
class PCG
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //!
    //! @param [in]     seed        設定する種.
    //-------------------------------------------------------------------------
    PCG(uint64_t seed);

    //-------------------------------------------------------------------------
    //! @brief      コピーコンストラクタです.
    //!
    //! @param [in]     random      複製元のインスタンス.
    //-------------------------------------------------------------------------
    PCG(const PCG& random);

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~PCG() = default;

    //-------------------------------------------------------------------------
    //! @brief      ランダム種を設定します.
    //!
    //! @param [in]     seed        設定する種.
    //-------------------------------------------------------------------------
    void SetSeed(uint64_t seed);

    //-------------------------------------------------------------------------
    //! @brief      疑似乱数を取得します.
    //!
    //! @return     疑似乱数を返却します.
    //-------------------------------------------------------------------------
    uint32_t GetValue();

    //-------------------------------------------------------------------------
    //! @brief      代入演算子です.
    //!
    //! @param [in]     value      代入する値.
    //! @return     代入結果を返却します.
    //-------------------------------------------------------------------------
    PCG& operator = (const PCG& value);

    //-------------------------------------------------------------------------
    //! @brief      等価演算子です.
    //
    //! @param [in]     value      比較する値.
    //! @retval true    等価です.
    //! @retval false   非等価です.
    //-------------------------------------------------------------------------
    bool operator == (const PCG& value) const;

    //-------------------------------------------------------------------------
    //! @brief      非等価演算子です.
    //!
    //! @param [in]     value       比較する値.
    //! @retval true    非等価です.
    //! @retval false   等価です.
    //-------------------------------------------------------------------------
    bool operator != (const PCG& value) const;

private:
    //=========================================================================
    // private variables
    //=========================================================================
    static const uint64_t s_Multiplier = 6364136223846793005u;
    static const uint64_t s_Increment  = 1442695040888963407u;
    uint64_t              m_State      = 0x4d595df4d0f33173;

    //=========================================================================
    // private methods
    //=========================================================================
    static uint32_t Rotate(uint32_t x, uint32_t r);
};


///////////////////////////////////////////////////////////////////////////////
// RandomHelper class
///////////////////////////////////////////////////////////////////////////////
class RandomHelper
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      疑似乱数値をint型に変換します.
    //! 
    //! @param[in]      value       疑似乱数の値.
    //! @return     変換した結果を返却します.
    //-------------------------------------------------------------------------
    static int GetAsInt(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      疑似乱数をint型に変換し，指定範囲値に変換します.
    //! 
    //! @param[in]      value       疑似乱数の値.
    //! @param[in]      mini        範囲の最小値.
    //! @param[in]      maxi        範囲の最大値.
    //! @return     指定範囲値に変換した結果を返却します.
    //-------------------------------------------------------------------------
    static int GetAsInt(uint32_t value, int mini, int maxi);

    //-------------------------------------------------------------------------
    //! @brief      疑似乱数値をfloat型に変換します.
    //! 
    //! @param[in]      value       疑似乱数の値.
    //! @return     変換した結果を返却します.
    //-------------------------------------------------------------------------
    static float GetAsFloat(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      疑似乱数をfloat型に変換し，指定範囲値に変換します.
    //! 
    //! @param[in]      value       疑似乱数の値.
    //! @param[in]      mini        範囲の最小値.
    //! @param[in]      maxi        範囲の最大値.
    //! @return     指定範囲値に変換した結果を返却します.
    //-------------------------------------------------------------------------
    static float GetAsFloat(uint32_t value, float mini, float maxi);
};

///////////////////////////////////////////////////////////////////////////////
// Quad2 class
///////////////////////////////////////////////////////////////////////////////
class Quad2
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    //=========================================================================
    // public variables.
    //=========================================================================
    int x = 0;
    int y = 0;
    int w = 0;
    int h = 0;

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    Quad2() = default;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Quad2(int nx, int ny, int width, int height);

    //-------------------------------------------------------------------------
    //! @brief      平行移動します.
    //! 
    //! @param[in]      tx      X成分の移動量.
    //! @param[in]      ty      Y成分の移動量.
    //! @return     平行移動後の結果を返却します.
    //-------------------------------------------------------------------------
    Quad2& Move(int tx, int ty);

    //-------------------------------------------------------------------------
    //! @brief      矩形と矩形の包含を調べます.
    //! 
    //! @param[in]      lhs     矩形
    //! @param[in]      rhs     矩形
    //! @retval true    含まれます.
    //! @retval false   含まれません.
    //-------------------------------------------------------------------------
    static bool Contains(const Quad2& lhs, const Quad2& rhs);

    //-------------------------------------------------------------------------
    //! @brief      点と矩形の包含を調べます.
    //! 
    //! @param[in]      x       点のX成分.
    //! @param[in]      y       点のY成分.
    //! @param[in]      quad    矩形.
    //! @retval true    含まれます.
    //! @retval false   含まれません.
    //-------------------------------------------------------------------------
    static bool Contains(int x, int y, const Quad2& quad);
};

//-----------------------------------------------------------------------------
//! @brief      正規直交基底を求めます.
//!
//! @param[in]      N       法線ベクトル.
//! @param[out]     T       接線ベクトル.
//! @param[out]     B       従接線ベクトル.
//-----------------------------------------------------------------------------
void CalcONB(const Vector3& N, Vector3& T, Vector3& B);

//-----------------------------------------------------------------------------
//! @brief      Hammersleyサンプルを行います.
//!
//! @param[in]      i               サンプリング番号.
//! @param[in]      numSamples      サンプル数.
//-----------------------------------------------------------------------------
Vector2 Hammersley( uint32_t i, uint32_t numSamples );

//-----------------------------------------------------------------------------
//! @brief      平面式を正規化します.
//!
//! @param[in]      value       平面式(x, y, zが法線, wが距離).
//-----------------------------------------------------------------------------
Vector4 NormalizePlane(const Vector4& value);

//-----------------------------------------------------------------------------
//! @brief      視錐台を構成する平面を計算します.
//!
//! @param[in]      view            ビュー行列です.
//! @param[in]      proj            射影行列です.
//! @param[out]     planes          平面の格納先です.
//------------------------------------------------------------------------------
void CalcFrustumPlanes(const Matrix& view, const Matrix& proj, Vector4* planes);

//-----------------------------------------------------------------------------
//! @brief      平面とレイの交差点を求めます.
//!
//! @param[in]      plane       平面式です.
//! @param[in]      orig        レイの原点です.
//! @param[in]      dir         レイの方向ベクトルです.
//! @return     交差点を返却します.
//-----------------------------------------------------------------------------
Vector3 ComputeIntersection(const Vector4& plane, const Vector3& orig, const Vector3& dir);

//-----------------------------------------------------------------------------
//! @brief      視錐台の8角を求めます.
//!
//! @param[in]      planes      錐台を構成する6平面です.
//! @param[out]     corners     錐台の8角を返却します.
//-----------------------------------------------------------------------------
void GetCorners(const Vector4* planes, Vector3* corners);


///////////////////////////////////////////////////////////////////////////////
// Unorm2 structure
///////////////////////////////////////////////////////////////////////////////
struct Unorm2
{
    uint8_t     x;
    uint8_t     y;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm2(uint8_t nx, uint8_t ny);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm2(float nx, float ny);

    //-------------------------------------------------------------------------
    //! @brief      Vector2型に変換します.
    //-------------------------------------------------------------------------
    Vector2 ToVector2() const;
};

///////////////////////////////////////////////////////////////////////////////
// Unorm3 structure
///////////////////////////////////////////////////////////////////////////////
struct Unorm3
{
    uint8_t     x;
    uint8_t     y;
    uint8_t     z;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm3(uint8_t nx, uint8_t ny, uint8_t nz);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm3(float nx, float ny, float nz);

    //-------------------------------------------------------------------------
    //! @brief      Vector3型に変換します.
    //-------------------------------------------------------------------------
    Vector3 ToVector3() const;

    //-------------------------------------------------------------------------
    //! @brief      Unorm3に変換します.
    //-------------------------------------------------------------------------
    static Unorm3 FromRGB(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      Unormに変換します.
    //-------------------------------------------------------------------------
    static Unorm3 FromBGR(uint32_t value);
};

///////////////////////////////////////////////////////////////////////////////
// Unorm4 structure
///////////////////////////////////////////////////////////////////////////////
struct Unorm4
{
    uint8_t     x;
    uint8_t     y;
    uint8_t     z;
    uint8_t     w;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm4(uint8_t nx, uint8_t ny, uint8_t nz, uint8_t nw);

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Unorm4(float nx, float ny, float nz, float nw);

    //-------------------------------------------------------------------------
    //! @brief      Vector4型に変換します.
    //-------------------------------------------------------------------------
    Vector4 ToVector4() const;

    //-------------------------------------------------------------------------
    //! @brief      Unorm4に変換します.
    //-------------------------------------------------------------------------
    static Unorm4 FromRGBA(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      Unorm4に変換します.
    //-------------------------------------------------------------------------
    static Unorm4 FromARGB(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      Unorm4に変換します.
    //-------------------------------------------------------------------------
    static Unorm4 FromBGRA(uint32_t value);

    //-------------------------------------------------------------------------
    //! @brief      Unorm4に変換します.
    //-------------------------------------------------------------------------
    static Unorm4 FromABGR(uint32_t value);
};

///////////////////////////////////////////////////////////////////////////////
// Uint2 structure.
///////////////////////////////////////////////////////////////////////////////
struct Uint2
{
    uint32_t    x;
    uint32_t    y;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Uint2(uint32_t nx, uint32_t ny);

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //-------------------------------------------------------------------------
    Uint2 operator + (const Uint2& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //-------------------------------------------------------------------------
    Uint2 operator - (const Uint2& value) const;
};

///////////////////////////////////////////////////////////////////////////////
// Uint3 structure.
///////////////////////////////////////////////////////////////////////////////
struct Uint3
{
    uint32_t    x;
    uint32_t    y;
    uint32_t    z;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Uint3(uint32_t nx, uint32_t ny, uint32_t nz);

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //-------------------------------------------------------------------------
    Uint3 operator + (const Uint3& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //-------------------------------------------------------------------------
    Uint3 operator - (const Uint3& value) const;
};

///////////////////////////////////////////////////////////////////////////////
// Uint4 structure.
///////////////////////////////////////////////////////////////////////////////
struct Uint4
{
    uint32_t    x;
    uint32_t    y;
    uint32_t    z;
    uint32_t    w;

    //-------------------------------------------------------------------------
    //! @brief      引数付きコンストラクタです.
    //-------------------------------------------------------------------------
    Uint4(uint32_t nx, uint32_t ny, uint32_t nz, uint32_t nw);

    //-------------------------------------------------------------------------
    //! @brief      加算演算子です.
    //-------------------------------------------------------------------------
    Uint4 operator + (const Uint4& value) const;

    //-------------------------------------------------------------------------
    //! @brief      減算演算子です.
    //-------------------------------------------------------------------------
    Uint4 operator - (const Uint4& value) const;
};

} // namespace asdx

//-----------------------------------------------------------------------------
// Inline Files
//-----------------------------------------------------------------------------
#include "asdxMath.inl"


