//-----------------------------------------------------------------------------
// File : MeshOBJ.h
// Desc : Wavefront OBJ File Loader Module.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <fnd/asdxMath.h>


///////////////////////////////////////////////////////////////////////////////
// MeshOBJ class
///////////////////////////////////////////////////////////////////////////////
class MeshOBJ
{
    //=========================================================================
    // list of friend classes and methods.
    //=========================================================================
    /* NOTHING */

public:
    ///////////////////////////////////////////////////////////////////////////
    // Subset structure
    ///////////////////////////////////////////////////////////////////////////
    struct Subset
    {
        uint32_t    MaterialId; //!< マテリアルID.
        uint32_t    Offset;     //!< 頂点インデックスオフセット.
        uint32_t    Count;      //!< 頂点インデックス数.
    };

    ///////////////////////////////////////////////////////////////////////////
    // Material structure
    ///////////////////////////////////////////////////////////////////////////
    struct Material
    {
        std::string     Name;           //!< マテリアル名.
        asdx::Vector3   Ambient;        //!< アンビエント.
        asdx::Vector3   Diffuse;        //!< ディフューズ.
        asdx::Vector3   Specular;       //!< スペキュラー.
        asdx::Vector3   Emissive;       //!< エミッシブ.
        float           Shininess;      //!< 鏡面反射指数.
        float           Alpha;          //!< 透明度.
        std::string     MapKa;          //!< アンビエントマップ名.
        std::string     MapKd;          //!< ディフューズマップ名.
        std::string     MapKs;          //!< スペキュラーマップ名.
        std::string     MapBump;        //!< 法線マップ.
    };

    //=========================================================================
    // public variables.
    //=========================================================================
    /* NOTHING */

    //=========================================================================
    // public methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //-------------------------------------------------------------------------
    MeshOBJ() = default;

    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    ~MeshOBJ() = default;

    //-------------------------------------------------------------------------
    //! @brief      ファイルからデータをロードします.
    //!
    //! @param [in]     path            ファイル名です.
    //! @retval true    ロードに成功.
    //! @retval false   ロードに失敗.
    //-------------------------------------------------------------------------
    bool Load(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      メモリを解放します.
    //-------------------------------------------------------------------------
    void Reset();

    //-------------------------------------------------------------------------
    //! @brief      位置座標を取得します.
    //-------------------------------------------------------------------------
    const std::vector<asdx::Vector3>& GetPositions() const
    { return m_Positions; }

    //-------------------------------------------------------------------------
    //! @brief      法線ベクトルを取得します.
    //-------------------------------------------------------------------------
    const std::vector<asdx::Vector3>& GetNormals() const
    { return m_Normals; }

    //-------------------------------------------------------------------------
    //! @brief      接線ベクトルを取得します.
    //-------------------------------------------------------------------------
    const std::vector<asdx::Vector3>& GetTangents() const
    { return m_Tangents; }

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ座標を取得します.
    //-------------------------------------------------------------------------
    const std::vector<asdx::Vector2>& GetTexCoords() const
    { return m_TexCoords; }

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックスを取得します.
    //-------------------------------------------------------------------------
    const std::vector<uint32_t>& GetIndices() const
    { return m_Indices; }

    //-------------------------------------------------------------------------
    //! @brief      サブセットを取得します.
    //-------------------------------------------------------------------------
    const std::vector<Subset>& GetSubsets() const
    { return m_Subsets; }

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを取得します.
    //-------------------------------------------------------------------------
    const std::vector<Material>& GetMaterials() const
    { return m_Materials; }

    //-------------------------------------------------------------------------
    //! @brief      位置座標を持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasPositions() const
    { return !m_Positions.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      法線ベクトルを持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasNormals() const
    { return !m_Normals.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      接線ベクトルを持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasTangents() const
    { return !m_Tangents.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      テクスチャ座標を持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasTexCoords() const
    { return !m_TexCoords.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      頂点インデックスを持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasIndices() const
    { return !m_Indices.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      サブセットを持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasSubsets() const
    { return !m_Subsets.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      マテリアルを持つかチェックします.
    //-------------------------------------------------------------------------
    bool HasMaterials() const
    { return !m_Materials.empty(); }

    //-------------------------------------------------------------------------
    //! @brief      ロードディレクトリパスを取得します.
    //-------------------------------------------------------------------------
    const std::string& GetDirectoryPath() const
    { return m_Directory; }

    //-------------------------------------------------------------------------
    //! @brief      指定されたマテリアル名を検索します.
    //! 
    //! @param[in]      name        検索するマテリアル名.
    //! @param[out]     result      マテリアルインデックス.
    //! @retval true    検索に成功.
    //! @retval false   検索に失敗.
    //-------------------------------------------------------------------------
    bool FindMaterial(const char* name, uint32_t& result) const;

private:
    //=========================================================================
    // private variables.
    //=========================================================================
    std::vector<asdx::Vector3>  m_Positions;    //!< 位置座標です.
    std::vector<asdx::Vector3>  m_Normals;      //!< 法線ベクトルです.
    std::vector<asdx::Vector3>  m_Tangents;     //!< 接線ベクトルです.
    std::vector<asdx::Vector2>  m_TexCoords;    //!< テクスチャ座標です.
    std::vector<uint32_t>       m_Indices;      //!< 頂点インデックスです.
    std::vector<Subset>         m_Subsets;      //!< サブセットです.
    std::vector<Material>       m_Materials;    //!< マテリアルです.
    std::string                 m_Directory;    //!< ロードディレクトリパスです.

    //=========================================================================
    // private methods.
    //=========================================================================

    //-------------------------------------------------------------------------
    //! @brief      MTLファイルをロードします.
    //!
    //! @param [in]     filename        ファイル名.
    //! @retval true    ロードに成功.
    //! @retval false   ロードに失敗.
    //-------------------------------------------------------------------------
    bool LoadMTLFile(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      OBJファイルをロードします.
    //!
    //! @param [in]     filename        ファイル名.
    //! @retval true    ロードに成功.
    //! @retval false   ロードに失敗.
    //-------------------------------------------------------------------------
    bool LoadOBJFile(const char* path);

    //-------------------------------------------------------------------------
    //! @brief      法線ベクトルを計算します.
    //!
    //! @retval true    法線ベクトル算出に成功.
    //! @retval false   法線ベクトル算出に失敗.
    //-------------------------------------------------------------------------
    bool ComputeNormal();

    //-------------------------------------------------------------------------
    //! @brief      接線ベクトルを計算します.
    //! 
    //! @retval true    接線ベクトル算出に成功.
    //! @retval false   接線ベクトル算出に失敗.
    //-------------------------------------------------------------------------
    bool ComputeTangent();
};
